Repository: kakaroto/e17
Catalog: e_modules/alarm/po/*.po
Languages: fr

source: Alarm
fr: Alarme

source: Active
fr: Activé

source: Alarm Options
fr: Options de l'alarme

source: Show next alarm
fr: Monter l'alarme suivante

source: Alarms Defaults
fr: Alarme par défaut

source: Open popup
fr: Ouvrir un popup

source: Run program
fr: Exécuter un programme

source: Auto-Remove alarms
fr: Automatiquement effacer l'alarme

source: Alarm Configuration : Setup an alarm
fr: Configuration de l'alarme: paramétrer une alarme

source: Schedule
fr: Planification

source: %1.0f hour
fr: %1.0f heures

source: Days of the week
fr: Jour de la semaine

source: Monday
fr: Lundi

source: Tuesday
fr: Mardi

source: Wenesday
fr: Mercredi

source: Thursday
fr: Jeudi

source: Friday
fr: Vendredi

source: Saturday
fr: Samedi

source: Sunday
fr: Dimanche

source: One day
fr: Un jour

source: Date (YYYY/MM/DD)
fr: Date (AAAA/MM/JJ)

source: Today
fr: Aujourd'hui

source: Tomorrow
fr: Demain

source: Alarm Module Error
fr: Erreur dans le module alarme

source: Test this alarm
fr: Tester cette alarme

source: Ring Options
fr: Option de la sonnerie

source: Remove alarm
fr: Effacer une alarme

source: Run a program
fr: Exécuter un programme

source: Run default one
fr: Exécuter

source: Run this program
fr: Exécuter ce programme

source: <hilight>Alarm test SUCCEED !</hilight>
fr: <hilight>Test avec succès de l'alarme Alarm !</hilight>

source: <hilight>Alarm test FAILED !</hilight>
fr: <hilight>Erreur lors du test de l'alarme !</hilight>

source: Alarm Module Test Report
fr: Test du rapport d'alarme

source: <hilight>Alarm : %s</hilight><br><br>%s
fr: <hilight>Alarme : %s</hilight><br><br>%s

source: Alarm Module Popup
fr: Popup du module d'alarme

source: Snooze %s
fr: Répétition %s

source: %1.0f hours
fr: %1.0f heures

source: Snooze %.14s of %.2d:%.2d
fr: Alarme retardée %.14s of %.2d:%.2d

source: Snooze (No alarm to delay)
fr: Alarme retardée (pas d'alarme à répéter)

source: Add an alarm
fr: Ajouter une alarme

source: Configuration
fr: Configuration de l'alarme

source: Alarm Module version
fr: Version du module alarme
