Repository: kakaroto/e17
Catalog: E-MODULES-EXTRA/tiling/po/*.po
Languages: ar, fr, he, hr, hu, it, ja, pl, uk

source: Tiling
ar: التبليط
fr: Pavage
he: ריצוף
pl: Kafelkowanie
uk: Мозайка

source: Windows
ar: النوافذ
fr: Fenêtres
he: חלונות
hu: Ablakok
it: Finestre
ja: ウィンドウ
pl: Ustawienia okien
uk: Вікна

source: Tiling Configuration
ar: إعدادات التبليط
fr: Configuration du pavage
he: תצורת הריצוף
hr: Tiling Konfiguracija
hu: Beállítások
it: Configurazione modulo Tiling
ja: Tiling設定
pl: Ustawienia kafelkowania
uk: Налаштування мозайки

source: General
ar: عامّ
fr: Paramètres généraux
he: כללי
hr: Općenito
hu: Általános
it: Impostazioni generali
ja: 一般
pl: Ogólne
uk: Загальні

source: Horizontal:
ar: أفقي:
he: אופקי:
hr: Vodoravno:
hu: Horizontális:
it: Orizzontale:
ja: 横
pl: Poziome:
uk: Горизонталь:

source: %1.0f px
ar: %1.0f بكسل
fr: %1.0f pixels
he: %1.0f פיקסלים
hu: %1.0f pixel
ja: %1.0f ピクセル
pl: %1.0f pikseli
uk: %1.0f пікселів

source: Vertical:
ar: عمودي:
he: אנכי:
hr: Okomito:
hu: Vertikális:
it: Verticale:
ja: 縦
pl: Pionowo:
uk: Вертикаль:

source: Virtual Desktops
ar: أسطح المكتب الإفتراضية
fr: Bureaux virtuels
he: שולחנות עבודה וירטואליים
hr: Virtualni Desktop
hu: Virtuális munkaasztalok
it: Desktop virtuali
ja: 仮想デスクトップ
pl: Wirtualne Pulpity
uk: Віртуальні стільниці

source: Grid mode settings
ar: إعدادات وضع الشبكة
fr: Paramètres du mode grille
he: הגדרות מצב הרשת
hr: Postavke Grid moda
hu: Rács mód beállítások
it: Impostazioni modalit√† griglia
ja: グリッドモード設定
pl: Ustawienia trybu siatki
uk: Налаштування в пікселях

source: Bigmain settings
ar: اﻹعدادات الرئيسية
fr: Paramètres de la super-fenêtre
he: הגדרות Bigmain
hr: BIgmain postavke
hu: Nagy alap beállítások
it: Impostazioni superfinestra
ja: Bigmain設定
pl: Ustawienia okna głównego
uk: Налаштування величини

source: Big win takes percent of screen:
ar: Big win يأخذ النسبة المئوية من الشاشة
fr: La super-fenêtre recouvre ce pourcentage de l'écran:
he: נצחון גדול לוקח אחוזים מהצג:
hr: Veliki win koristi postotak ekrana:
hu: Nagyított ablakok a képernyő ennyi %-át foglalják el:
it: Percentuale schermo occupato dalla superfinestra:
ja: メインウィンドウの割合 :
pl: Główne okno zajmuje (procent ekranu):
uk: Великі вікна забирають:

source: %.2f
uk: %.2f відсотків екрана

source: Tiling border
ar: حدود التبليط
fr: Bordure du pavage
he: מסגרת הריצוף
hr: Tiling rub
hu: Keret csempézése
it: Bordo mosaico
ja: タイルの境界線
pl: Ramka kafelkowania
uk: Межі мозайки

source: Floating border
ar: الحدود العائمة
fr: Bordure flottante
he: מסגרת צפה
hr: Plutajući rub
hu: Keret úsztatása
it: Bordo fluttuante
ja: フロートの境界線
pl: Ramka płynna
uk: Мінливі межі
