Repository: kakaroto/e17
Catalog: E-MODULES-EXTRA/screenshot/po/*.po
Languages: pt

source: Screenshot Settings
pt: Definições

source: General Settings
pt: Definições gerais

source: Beep when taking screenshot
pt: Reproduzir som ao capturar

source: Delay Time:
pt: Tempo de espera:

source: Capture Mode
pt: Modo de captura

source: Whole Screen
pt: Todo o ecrã

source: Select Window
pt: Janela selecionada

source: Select Region
pt: Área selecionada

source: File Settings
pt: Definições de ficheiro

source: Always prompt for filename
pt: Solicitar o nome do ficheiro

source: Save Directory:
pt: Diretório de gravação:

source: Filename:
pt: Nome:

source: Application Settings
pt: Definições da aplicação

source: Launch application after taking screenshot
pt: Iniciar aplicação depois de efetuar a captura

source: Thumbnail Settings
pt: Definições das miniaturas

source: Generate thumbnail from screenshot
pt: Gerar miniatura da captura

source: Image Quality:
pt: Qualidade:

source: Application:
pt: Aplicação:

source: Size:
pt: Tamanho:

source: (Percentage of original image to use for thumbnail)
pt: (Percentagem da imagem a utilizar como miniatura)

source: Screenshot
pt: Captura

source: Screenshot Module Configuration data needed upgrading. Your old configuration<br> has been wiped and a new set of defaults initialized. This<br>will happen regularly during development, so don't report a<br>bug. This simply means Screenshot module needs new configuration<br>data by default for usable functionality that your old<br>configuration simply lacks. This new set of defaults will fix<br>that by adding it in. You can re-configure things now to your<br>liking. Sorry for the inconvenience.<br>
pt: A configuração do módulo de capturas precisa de ser atualizada. A sua configuração foi apagada e foram iniciados novos valores padrão.<br>Isto irá ocorrer recorrentemente durante o desenvolvimento e não deve reportar nenhum erro.<br>Isto apenas significa que o módulo precisa de novos dados de configuração que a sua antiga configuração não possui.<br>Este conjunto de valores irá corrigir a configuração.<br> Mais tarde poderá configurar o módulo ao seu gosto. Desculpe qualquer inconveniente.

source: Your Screenshot Module configuration is NEWER than the Screenshot Module version. This is very<br>strange. This should not happen unless you downgraded<br>the Screenshot Module or copied the configuration from a place where<br>a newer version of the Screenshot Module was running. This is bad and<br>as a precaution your configuration has been now restored to<br>defaults. Sorry for the inconvenience.<br>
pt: A configuração do módulo de capturas é mais recente que a do módulo.<br>Isto é muito estranho e só acontece se reverter o seu módulo ou caso tenha copiado a configuração de um local em que está instalada uma versão mais recente do módulo.<br>Isto é mau e por precaução, a sua configuração foi restaurada para as omissões.<br>Desculpe qualquer inconveniente.<br>

source: Take Screenshot
pt: Capturar

source: Screenshot Configuration Updated
pt: A configuração do módulo foi atualizada

source: Settings
pt: Definições

source: Screenshot Module
pt: Módulo de capturas

source: Enter a new filename for this screenshot
pt: Indique o nome para esta captura
