Repository: kakaroto/e17
Catalog: e_modules/net/po/*.po
Languages: fi, it

source: Configuration
fi: Asetukset
it: Configurazione

source: Device - %s
fi: Laite - %s
it: Dispositivo - %s

source: Net
fi: Verkko

source: Net Module Configuration
fi: Verkkomoduulin asetukset
it: Configurazione modulo Net

source: General Settings
fi: Yleisasetukset

source: Show Text
fi: Näytä teksti
it: Mostra testo

source: Show Popup On Mouse-Over
fi: Näytä ponnahdus hiiren ollessa kohdalla
it: Mostra popup al passaggio del mouse

source: Launch Application On Double-Click
fi: Käynnistä sovellus tuplaklikkauksella
it: Lancia applicazione al doppio clic

source: Activity Notification Level
fi: Aktiviteetin huomioinnin taso
it: Livello notifica attivit√†

source: High (MB)
fi: Korkea (Mt)
it: Alto (MB)

source: Middle (KB)
fi: Keskitaso (kt)
it: Medio (KB)

source: Low (B)
fi: Matala (t)
it: Basso (B)

source: Device Settings
fi: Laiteasetukset
it: Impostazione dispositivo

source: Network Monitor Module
it: Modulo monitoraggio rete

source: Module to monitor network traffic
it: Modulo per monitorare il traffico di rete.
