Repository: kakaroto/e17
Catalog: empower/po/*.po
Languages: cs, de, fr, he, hr, hu, it, tr, uk, zh_cn

source: Failed to create regular expression
cs: Nepodařilo se vytvořit regulární výraz
de: Konnte regulären Ausdruck nicht erstellen
fr: La création de l'expression régulière a échoué
he: כשל ביצירת ביטוי רגולארי
hr: Neuspjelo kreiranje regularnog izraza
hu: Nem tudtam létrehozni szabályos kifejezést
it: Impossibile creare espressione regolare
tr: Düzenli ifade oluşturulamadı
uk: Помилка створення регулярного виразу
zh_cn: 创建正则表达式失败

source: Unable to init ecore
cs: Nepodařilo se načíst ecore
de: Konnte ecore nicht initialisieren
fr: Impossible d'initialiser ecore
he: לא ניתן להפעיל את ליבת ה־ecore
hr: Nemoguće inicijalizirati ecore
hu: Nem tudom az ecore-t azonosítani
it: Impossibile inizializzare ecore
tr: ecore başlatılamadı
uk: Помилка ініціалізації ecore
zh_cn: 无法初始化 ecore

source: -=Usage=-
cs: -=Použití=-
de: Benutzung
he: -=שימוש=-
hr: -=Upotreba=-
hu: -=Használat=-
it: -=Uso=-
tr: _=Kullanım=_
uk: -=Використання=-
zh_cn: -=用法=-

source: Sudo: empower [SUDO OPTIONS] [PROGRAM] [PROGRAM OPTIONS] [ELEMENTARY OPTIONS]
cs: Sudo: empower [VOLBY SUDO] [PROGRAM] [VOLBY PROGRAMU] [VOLBY ELEMENTARY]
de: Sudo: empower [SUDO-OPTIONEN] [PROGRAMM] [PROGRAMM-OPTIONEN] [ELEMENTARY-OPTIONEN]
fr: Sudo : empower [OPTIONS SUDO] [PROGRAMME] [OPTIONS PROGRAMME] [OPTIONS ELEMENTARY]
he: Sudo: empower [אפשרויות ה־SUDO] [תוכנית] [אפשרויות התוכנית] [אפשרויות בסיסיות]
hr: Sudo: ovlasti [SUDO OPCIJE] [PROGRAM] [PROGRAMSKE OPCIJE] [ELEMENTARNE OPCIJE]
hu: Sudo: empower [SUDO OPCIÓK] [PROGRAM] [PROGRAM OPCIÓK] [ÁLTALÁNOS OPCIÓK]
it: Sudo: empower [OPZIONI SUDO] [PROGRAMMA] [OPZIONI PROGRAMMA] [OPZIONI ELEMENTARY]
tr: Sudo: empower [SUDO SEÇENEKLERİ] [PROGRAM] [PROGRAM SEÇENEKLERİ] [TEMEL SEÇENEKLER]
uk: Sudo: empower [ПАРАМЕТРИ SUDO] [ПРОГРАМА] [ПАРАМЕТРИ ПРОГРАМИ] [ПОЧАТКОВІ ПАРАМЕТРИ]
zh_cn: Sudo: empower [SUDO 选项] [程序] [程序选项] [基本选项]

source: AskPass: empower-askpass [ELEMENTARY OPTIONS] or empower -p [ELEMENTARY OPTIONS]
cs: AskPass: empower-askpass [VOLBY ELEMENTARY] nebo empower -p [VOLBY ELEMENTARY]
de: AskPass: empower-askpass [ELEMTARY-OPTIONEN] oder empower -p [ELEMENTARY-OPTIONEN]
fr: AskPass : empower-askpass [OPTIONS ELEMENTARY] ou empower -p [OPTIONS ELEMENTARY]
he: AskPass: empower-askpass [אפשרויות בסיסיות] או empower -p [אפשרויות בסיסיות]
hr: AskPass: ovlasti-askpass [ELEMENTARNE OPCIJE] ili ovlasti -p [ELEMENTARNE OPCIJE]
hu: Műveletkérés: ampower-askpass [ÁLTALÁNOS OPCIÓK] vagy empower -p [ÁLTALÁNOS OPCIÓK]
it: AskPass: empower-askpass [OPZIONI ELEMENTARY] oppure empower -p [OPZIONI ELEMENTARY]
tr: AskPass: empower-askpass [TEMELS SEÇENEKLER] veya empower -p [TEMEL SEÇENEKLER]
uk: AskPass: empower-askpass [ПОЧАТКОВІ ПАРАМЕТРИ] або empower -p [ПОЧАТКОВІ ПАРАМЕТРИ]
zh_cn: AskPass: empower-askpass [基本选项] 或 empower -p [基本选项]

source: Execute
cs: Spustit
de: Ausführen
fr: Exécuter
he: הפעלה
hr: Izvrši
hu: Végrehajt
it: Esegui
tr: Çalıştır
uk: Виконати
zh_cn: 执行

source: Password
cs: Heslo
de: Passwort
fr: Mot de passe
he: סיסמה
hr: Lozinka
hu: Jelszó
tr: Şifre
uk: Пароль
zh_cn: 密码

source: Unable to grab keyboard, exiting...
cs: Nepodařilo se získat klávesnici, vypínám...
de: Kann Tastatur nicht erfassen, beende...
fr: Impossible d'accaparer le clavier, fermeture...
he: לא ניתן ללכוד את המקלדת, מתבצעת יציאה...
hr: Nemoguće uspostaviti tipkovnicu, izlaz...
hu: Nem lehetséges a billentyűelkapás, kilépés...
it: Impossibile ricevere dalla tastiera, in uscita...
tr: Klavyeye erişilemedi, çıkılıyor...
uk: Помилка захвату клавіатури, вихід...
zh_cn: 无法捕捉键盘，退出...

source: Unable to init ewl
cs: Nepodařilo se načíst ewl
de: Kann ewl nicht initialisieren
fr: Impossible d'initialiser ewl
he: לא ניתן להפעיל את ewl
hr: Nemoguće inicijalizirati ewl
hu: ewl folyamat nem lehetséges
it: Impossibile inizializzare ewl
tr: ewl başlatılamadı
uk: Помилка ініціалізації ewl
zh_cn: 无法初始化 ewl

source: Sudo: empower [SUDO OPTIONS] [PROGRAM] [PROGRAM OPTIONS] [EWL OPTIONS]
cs: Sudo: empower [VOLBY SUDO] [PROGRAM] [VOLBY PROGRAMU] [VOLBY EWL]
de: Sudo: empower [SUDO-OPTIONEN] [PROGRAMM] [PROGRAMM-OPTIONEN] [EWL-OPTIONEN]
fr: Sudo : empower [OPTIONS SUDO] [PROGRAMME] [OPTIONS PROGRAMME] [OPTIONS EWL]
he: Sudo: empower [אפשרויות SUDO] [תוכנית] [אפשרויות התוכנית] [אפשרויות EWL]
hr: Sudo: ovlasti [SUDO OPCIJE] [PROGRAM] [PROGRAMSKE OPCIJE] [EWL OPCIJE]
hu: Sudo: empower [SUDO OPCIÓK] [PROGRAM] [PROGRAM OPCIÓK] [EWL OPCIÓK]
it: Sudo: empower [OPZIONI SUDO] [PROGRAMMA] [OPZIONI PROGRAMMA] [OPZIONI EWL]
tr: Sudo: empower [SUDO SEÇENEKLERİ] [PROGRAM] [PROGRAM SEÇENEKLERİ] [EWL SEÇENEKLERİ]
uk: Sudo: empower [ПАРАМЕТРИ SUDO] [ПРОГРАМА] [ПАРАМЕТРИ ПРОГРАМИ] [ПАРАМЕТРИ EWL]
zh_cn: Sudo: empower [SUDO 选项] [程序] [程序选项] [EWL 选项]

source: AskPass: empower-askpass [EWL OPTIONS] or empower -p [EWL OPTIONS]
cs: AskPass: empower-askpass [VOLBY EWL] nebo empower -p [VOLBY EWL]
de: AskPass: empower-askpass [EWL-OPTIONEN] oder empower -p [EWL-OPTIONEN]
fr: AskPass : empower-askpass [OPTIONS EWL] ou empower -p [OPTIONS EWL]
he: AskPass: empower-askpass [אפשרויות EWL] או empower -p [אפשרויות EWL]
hr: AskPass: ovlasti-askpass [EWL OPCIJE] ili ovlasti -p [EWL OPCIJE]
hu: Engedélykérés: empower-askpass [EWL OPCIÓ] vagy empower -p [EWL OPCIÓ]
it: AskPass: empower-askpass [OPZIONI EWL] oppure empower -p [OPZIONI EWL]
tr: AskPass: empower-askpass [EWL SEÇENEKLERİ] veya empower -p [EWL SEÇENEKLERİ]
uk: AskPass: empower-askpass [ПАРАМЕТРИ EWL] або empower -p [ПАРАМЕТРИ EWL]
zh_cn: AskPass: empower-askpass [EWL 选项] 或 empower -p [EWL 选项]
