Repository: kakaroto/e17
Catalog: E-MODULES-EXTRA/news/po/*.po
Languages: ar, cs, eo, es, fi, fr, hr, it, uk

source: Config init failed
ar: فشلت تهيئة التكوينات
cs: Načtení nastavení selhalo
eo: Pravalorizado de agordo malsukcesis
es: ¡Ha fallado la inicialización de configuración!
fi: Asetusten asetus epäonnistui
fr: L'initialisation de la configuration du module a échoué
hr: Config init neuspješan
it: Inizializzazione configurazione fallita
uk: Не вдалось запустити налаштування

source: Parser init failed
ar: فشلت تهيئة المحلل
cs: Načtení parseru selhalo
eo: Pravalorizado de sintaksa analizilo malsukcesis
es: Falló la inicialización del analizador
fi: Parsimen käynnistys epäonnistui
fr: L'initialisation de l'analyseur syntaxique a échoué
hr: Analizator init neuspješan
it: Inizializzazione parser fallita
uk: Не вдалось запустити аналізатор

source: Feeds init failed
ar: فشلت تهيئة الخلاصات
cs: Načtení čteček selhalo
eo: Pravalorizado de abonfluoj malsukcesis
es: Falló la inicialización de los canales de noticias
fi: Syötteen avaaminen epäonnistui
fr: L'initialisation des flux a échoué
hr: Izvori init neuspješan
it: Inizializzazione feed fallita
uk: Не вдалось запустити новинтарі

source: Viewer init failed
ar: فشلت تهيئة العارض
cs: Načtení zobrazovače selhalo
eo: Pravalorizado de legilo malsukcesis
es: Fallón la inicialización del visor
fi: Katselimen käynnistys epäonnistui
fr: L'initialisation du lecteur a échoué
hr: Preglednik init neuspješan
it: Inizializzazione visualizzatore fallita
uk: Не вдалось запустити програму перегляду

source: Popup subsystem init failed
cs: Načtení popup subsystému selhalo
eo: Pravalorizado de subsistemo de spruĉfenestro malsukcesis
es: Fallón la inicializaciónd el subsistema de emergentes
fi: Ponnahdusalijärjestelmän käynnistys epäonnistui
fr: L'initialisation du sous-système de pop-up a échoué
hr: Pop-up podsustav init neuspješan
it: Inizializzazione sottosistema popup fallita
uk: Не вдалось запустити підсистему виринань

source: News
ar: اﻷخبار
cs: Novinky
eo: Novajxoj
fi: Uutiset
fr: Nouvelles
hr: Vijesti
uk: Новини

source: <hilight>News module : Configuration Upgraded</hilight><br><br>Your configuration of news module<br>has been upgraded<br>Your settings were removed<br>Sorry for the inconvenience<br><br>(%d -> %d)
ar: <hilight>وحدة اﻷخبار : التكوينات رُقيت</hilight><br><br>تكويناتك لوحدة اﻷخبار<br>رُقيت<br>و إعداداتك أُزيلت<br>نأسف ﻹزعاجك<br><br>(%d -> %d)
cs: <hilight>Modul Novinky : Nastavení aktualizováno</hilight><br><br>Bylo načteno nové nastavení<br>tohoto modulu.<br>Staré nastavení bylo odstraněno.<br>Omlouváme se za vzniklé potíže.<br><br>(%d -> %d)
eo: <hilight>Modulo de novaĵoj: ĝisdatigita agordo</hilight><br><br>Viaagordo de modulo de novaĵoj<br>estis ĝisdatigita<br>Viaj agordoj estis forviŝitaj<br>Pardonu por la ĝenoj<br><br>(%d -> %d)
es: <hilight>Módulo de News : Actualización de configuración</hilight><br><br>Laconfiguración del módulo News<br>fue actualizada<br>Sus preferencias fueron eliminadas.<br>Lamentamos las incoveniencias<br><br>(%d -> %d)
fi: <hilight>Uutismoduuli : Asetukset päivitetty</hilight><br><br>Uutismoduulisi asetukset<br>on päivitetty<br>Asetuksesi poistettiin<br>Pahoittelut aiheutetusta vaivasta<br><br>(%d -> %d)
fr: <hilight>Module de nouvelles: Configuration actualisée</hilight><br><br>La configuration du module de nouvelles<br>a été mise à jour<br>Vos réglages ont dû être supprimés<br>Désolé pour le désagrément<br><br>(%d ->%d)
hr: <hilight>Modul Vijesti : Konfiguracija Unaprijeđena</hilight><br><br>Vaša konfiguracija modula vijesti<br>je unaprijeđena.<br>Vaše postavke su uklonjene.<br>Žalimo zbog neugodnosti.<br><br>(%d -> %d)
it: <hilight>Modulo News: aggiornamento configurazione</hilight><br><br>La vostra configurazione del modulo News è stata<br>aggiornata. Le vostre impostazioni sono state<br>cancellate. Ci scusiamo per l'inconveniente<br><br>(%d -> %d)
uk: <hilight>Новини : налаштування оновлено</hilight><br><br>Ваші налаштування новин<br>оновлено<br>Ваші налаштування вилучено <br>Вибачте за незручності<br><br>(%d -> %d)

source: <hilight>News module : Configuration Downgraded</hilight><br><br>Your configuration of News module<br>has been downgraded<br>Your settings were removed<br>Sorry for the inconvenience<br><br>(%d ->%d)
ar: <hilight>وحدة اﻷخبار : تم تخفيض التكوينات</hilight><br><br>تكويناتك لوحدة اﻷخبار<br>تم تخفيضها<br>و إعداداتك أُزيلت<br>نأسف ﻹزعاجك<br><br>(%d ->%d)
cs: <hilight>Modul Novinky : Nastavení degradováno</hilight><br><br>Vaše nastavení modulu<br>bylo degradováno.<br>Stará konfigurace byla odstraněna.<br>Omlouváme se za vzniklé potíže.<br><br>(%d ->%d)
eo: <hilight>Modulo de novaĵoj: Agordo malpromociita</hilight><br><br>Via agordo de modulo de novaĵoj<br>estis malpromociita.<br>Viaj agordoj estis forviŝitaj.<br>Pardonu por la ĝenoj<br><br>(%d ->%d)
es: <hilight>Módulo de noticias: configuración revertida</hilight><br><br>Tu configuración del módulo de noticias<br>ha sido revertida<br>Tus preferencias se han eliminado<br>Lamentamos el problema<br><br>(%d ->%d)
fi: <hilight>Uutismoduuli : Asetukset alipäivitetty</hilight><br><br>Uutismoduulisi asetukset<br>on alipäivitetty<br>Asetuksesi poistettiin<br>Pahoittelut aiheutetusta vaivasta<br><br>(%d -> %d)
fr: <hilight>Module de nouvelles: Configuration rétrogradée</hilight><br><br>La configuration du module de nouvelles<br>a été ramenée à un état antérieur<br>Vos réglages ont dû être supprimés<br>Désolé pour le désagrément<br><br>(%d ->%d)
hr: <hilight>Modul Vijesti : Konfiguracija Unazađena</hilight><br><br>Vaša konfiguracija Modula Vijesti<br>je unazađena.<br>Vaše postavke su uklonjene.<br>Žalimo zbog neugodnosti.<br><br>(%d ->%d)
it: <hilight>Modulo News: ripristino configurazione</hilight><br><br>La vostra configurazione del modulo News è stata<br>ripristinata. Le vostre impostazioni sono state<br>cancellate. Ci scusiamo per l'inconveniente<br><br>(%d -> %d)
uk: <hilight>Новини : налаштування понижено версії</hilight><br><br>Ваші налаштуванння новин<br>понижено версією<br>Ваші налаштування вилучено<br>Вибачте за незручності<br><br>(%d ->%d)

source: News Main Configuration
ar: إعدادات اﻷخبار الرئيسية
cs: Hlavní nastavení modulu
eo: Ĉefa agordo de la novaĵoj
es: Configuración principal de noticia
fi: Uutisten pääasetukset
fr: Configuration principale du module de nouvelles
hr: Konfiguracija Glavnih Vijesti
it: Configurazione principale di News
uk: Головні налаштування новин

source: Feeds
ar: الخلاصات
cs: Čtečky
eo: Abonfluoj
es: Canales de noticias
fi: Syötteet
fr: Flux
hr: Izvori
it: Feed
uk: Новинтарі

source: Sort lists by name (disable Move action)
ar: رتب القوائم حسب اﻹسم (عطل إجراء التحريك)
cs: Seřadit seznam podle jména (zakázat akci Pohyb)
eo: Ordigi listojn laŭ nomo (malebligas agadon de movado)
es: Organizar listas por nombre (deshabilitar Mover)
fi: Lajittele listat nimen perusteella (poista siirtotoiminto käytöstä)
fr: Classer les listes par ordre alphabétique (désactive l'action déplacer)
hr: Svrstaj liste po imenu (onemogući Move akciju)
it: Ordina lista per nome (disabilita spostamento)
uk: Впорядкувати за назвою (вимкнути дію переміщення)

source: News Viewer
ar: عارض اﻷخبار
cs: Zobrazovač novinek
eo: Novaĵlegilo
es: Visor de noticias
fi: Uutiskatselin
fr: Lecteur de nouvelles
hr: Preglednik Vijesti
it: Visualizzatore di News
uk: Переглядач новин

source: Font size
ar: حجم الخطّ
cs: Velikost písma
eo: Tipara grado
es: Tamaño del tipo de letra
fi: Fontin koko
fr: Taille de la police
hr: Veličina pisma
it: Dimensione font
uk: Розмір шрифта

source: Font color
ar: لون الخط
cs: Barva písma
eo: Tiparkoloro
es: Color del tipo de letra
fi: Fontin väri
fr: Couleur de la police
hr: Boja pisma
it: Colore font
uk: Колір шрифта

source: Timer
ar: المؤقت
cs: Časovač
eo: Horloĝo
es: Temporizador
fi: Ajastin
fr: Minuteur
hr: Brojač vremena
uk: Таймер

source: %1.0f min
ar: %1.0f دقيقة
uk: %1.0f хв.

source: Browser
ar: المتصفح
cs: Prohlížeč
eo: Retumilo
es: Navegador
fi: Selain
fr: Navigateur
hr: Preglednik
uk: Навігатор тенет

source: Uses xdg-open script, from freedesktop.org
ar: يستخدم سكربت "xdg-ope", من freedektop.org
cs: Používá xdg-open skript, z freedesktop.org
eo: Uzas la skripton xdg-open, el freedesktop.org
es: Usar script xdg-open, de freedesktop.org
fi: Käyttää xdg-open -skriptiä freedesktop.org-sivustolta
fr: Utilise le script xdg-open, de freedesktop.org
hr: Koristi xdg-open script, od freedesktop.org
it: Usa script xdg-open da freedesktop.org
uk: Використовує скрипт xdg-open, який взято з freedesktop.org

source: Popup On News
ar: نافذة منبثقة عند توافر اﻷخبار
cs: Upozornění při nové zprávě
eo: Spruĉfenestro post apero de novaĵoj
es: Mostrar emergentes en noticias
fi: Ponnahdus Uutisille
fr: Pop-up à la réception
hr: Pop-up na Vijestima
it: Popup al ricevimento
uk: Виринання новин

source: Never
ar: أبداً
cs: Nikdy
eo: Neniam
es: Nunca
fi: Ei koskaan
fr: Jamais
hr: Nikad
it: Mai
uk: Ніколи

source: Only on urgent feeds
ar: فقط على الخلاصات العاجلة
cs: Jenom na naléhavých čtečkách
eo: Nur sur urĝaj abonfluoj
es: Sólo en canales urgentes
fi: Vain huomiota vaativille syötteille
fr: Uniquement pour les flux urgents
hr: Samo na hitnim izvorima
it: Solo per feed urgenti
uk: Тільки важливі новинтарі

source: On all feeds
ar: على كل الخلاصات
cs: Na všech čtečkách
eo: Sur ĉiuj abonfluoj
es: Sobre todos los suministros
fi: Kaikille syötteille
fr: Pour tous les flux
hr: Na svim izvorima
it: Per tutti i feed
uk: Усі новинтарі

source: %1.0f s
ar: %1.0f ثانية
uk: %1.0f сек.

source: Popup On Warning / Error
ar: نافذة منبثقة عند وجود تحذر\خلل
cs: Upozornění při varování / chybě
eo: Spruĉfenestro post averto / eraro
es: Mostrar emergentes en avisos/errores
fi: Ponnahdus varoitukselle / virheelle
fr: Pop-up pour Avertissement / Erreur
hr: Pop-up Na Upozorenje / Greška
it: Popup per avvertimenti/errori
uk: Помилка виринання

source: Show on timeout ?
ar: أعرض بعد مهلة ؟
cs: Zobrazit při vypršení času ?
eo: Vidigi post tempolimi?
es: ¿Mostrar al vencer tiempo?
fi: Näytä timeoutille?
fr: Afficher pour délai d'attente dépassé ?
hr: Prikaži na pauzi ?
it: Mostrare al timeout?
uk: Показувати час роботи ?

source: Unread feeds first
ar: علم الخلاصات كغير مقروءة أولاً
cs: Nepřečtené čtečky první
eo: Ne legitaj abonfluoj unue
es: Primero canales sin leer
fi: Ei-luetut syötteet ensin
fr: FLux non lus d'abord
hr: Prvo nepročitani Izvori
it: Prima i feed non letti
uk: Спочатку непрочитані новинтарі

source: Unread articles first
ar: علم المقالات كغير مقروءة أولاً
cs: Nepřečtené články první
eo: Ne legitaj artikoloj unue
es: Primero artículos no leídos
fi: Ei-luetut artikkelit ensin
fr: Articles non lus d'abord
hr: Prvo nepročitani artikli
it: Prima gli articoli non letti
uk: Спочатку непрочитанні статті

source: Sort articles by date
ar: رتب المقالات حسب التاريخ
cs: Řadit články podle data
eo: Ordigi artkilojn laŭ dato
es: Organizar artículos por fecha
fi: Lajittele artikkelit päivämäärän mukaan
fr: Classer les articles par ordre chronologique
hr: Svrstaj artikle po datumima
it: Ordina articoli per data
uk: Впорядкувати статі за датою

source: Font
ar: الخط
cs: Písmo
eo: Tiparo
es: Tipo de letra
fi: Fontti
fr: Police
hr: Pismo
uk: Шрифт

source: Font Shadow
ar: ضل النص
cs: Stín písma
eo: Tipara ombro
es: Sombra de fuente
fi: Fontin varjo
fr: Ombre de la police
hr: Sjenčenje Pisma
it: Ombreggiatura font
uk: Тінь шрифта

source: Proxy
ar: بروكسي
eo: Prokurilo
fi: Välityspalvelin
hr: Proksi
uk: Проксі

source: Enable
ar: فعّل
cs: Povolit
eo: Ebligi
es: Habilitar
fi: Ota käyttöön
fr: Activer
hr: Omogući
it: Abilita
uk: Увімкнути

source: Host
ar: المستضيف
cs: Hostitel
eo: Gastiga komputilo
es: Servidor
fi: Isäntä
fr: Hôte
hr: Domaćin
uk: Вузол

source: Port
ar: المَنْفذ
eo: Pordo
es: Puerto
fi: Portti
hr: Ulaz
it: Porta
uk: Порт

source: News Category Configuration
ar: إعدادات قسم اﻷخبار
cs: Nastavení kategorií
eo: Agordo de la kategorioj de novaĵoj
es: Configuración de categoría de noticias
fi: Uutiskategorian asetukset
fr: Configuration de la catégorie des nouvelles
hr: Konfiguracija Kategorija Vijesti
it: Configurazione categorie di News
uk: Налаштування категорій новин

source: Icon
ar: اﻷيقونة
cs: Ikona
eo: Piktogramo
es: Icono
fi: Kuvake
fr: Icone
hr: Ikona
it: Icona
uk: Піктограма

source: Name
ar: اﻹسم
cs: Jméno
eo: Nomo
es: Nombre
fi: Nimi
fr: Nom
hr: Ime
it: Nome
uk: Назва

source: Select an Icon
ar: إختر أيقونة
cs: Vyberte ikonu
eo: Elekti piktogramon
es: Seleccionar un icono
fi: Valitse kuvake
fr: Sélectionner un icone
hr: Odaberi ikonu
it: Seleziona un'icona
uk: Вибрати піктограму

source: OK
ar: حسنا
eo: Konfirmi
es: Aceptar
hr: U redu
uk: Гаразд

source: Cancel
ar: ألغ
cs: Zrušit
eo: Rezigni
es: Cancelar
fi: Peruuta
fr: Annuler
hr: Poništi
it: Annulla
uk: Скасувати

source: You need to <hilight>create a category</hilight> first
ar: يجب أن <hilight>تنشئ قسم</hilight> أولاً
cs: Musíte <hilight>první vytvořit</hilight> kategorii
eo: Vi devas <hilight>krei kategorion</hilight> unue
es: Primero necesitas <hilight>crear una categoría</hilight>
fi: Sinun täytyy <hilight>luoda kategoria</hilight> ensin
fr: Vous devez d'abord <hilight>créer une catégorie</hilight>
hr: Morate <hilight>kreirati kategoriju</hilight>prije svega.
it: Occorre prima <hilight>creare una categoria</hilight>
uk: Спочатку вам потрібно <hilight>створити категорію</hilight>

source: News Feed Configuration
ar: إعدادات خلاصات اﻷخبار
cs: Nastavení čtečky
eo: Agordo de la abonfluo
es: Configuración de canal de noticias
fi: Uutissyötteen asetukset
fr: Configuration du flux de nouvelles
hr: Konfiguracija Izvora Vijesti
it: Configurazione feed di News
uk: Налаштування новинтаря

source: Basic informations
ar: المعلومات اﻷساسية
cs: Základní informace
eo: Bazaj informoj
es: Información básica
fi: Perustiedot
fr: Informations basiques
hr: Osnovne informacije
it: Informazioni di base
uk: Основна інформація

source: Name :
ar: الاسم :
cs: Jméno :
eo: Nomo:
es: Nombre :
fi: Nimi:
fr: Nom:
hr: Naziv :
it: Nome:
uk: Назва :

source: Feed url :
ar: رابط الخلاصة :
cs: URL čtečky :
eo: Abonflua adreso:
es: URL del canal:
fi: Syötteen url:
fr: Url du flux:
hr: Url Izvora :
it: Url del feed:
uk: Посилання новинтаря :

source: Mark as important feed
ar: علم كخلاصة مهمة
cs: Označit jako důležitou
eo: Marki kiel grava abonfluo
es: Marcar como canal importante
fi: Merkitse tärkeäksi syötteeksi
fr: Marquer comme important
hr: Označi kao važan izvor
it: Segna come feed importante
uk: Позначити як важливий новинтар

source: Category
ar: القسم
cs: Kategorie
eo: Kategorio
es: Categoría
fi: kategoria
fr: Catégorie
hr: Kategorija
it: Categoria
uk: Категорія

source: Language
ar: اللغة
cs: Jazyk
eo: Lingvo
es: Idioma
fi: Kieli
fr: Langue
hr: Jezik
it: Lingua
uk: Мова

source: Advanced informations
ar: معلومات متقدمة
cs: Pokročilé informace
eo: Plidetalaj informoj
es: Informaciones avanzadas
fi: Lisätiedot
fr: Informations avancées
hr: Napredne informacije
it: Informazioni avanzate
uk: Додаткова інформація

source: Description
ar: الوصف
cs: Popis
eo: Priskribo
es: Descripción
fi: Kuvaus
hr: Opis
it: Descrizione
uk: Опис

source: Home url
ar: رابط المنزل
cs: Domovská URL
eo: Ĉefpaĝa adreso
es: Dirección de inicio
fi: Koti-url
fr: Url de démarrage
hr: Glavni url
it: Url di partenza
uk: Домашня сторінка

source: Server informations
ar: معلومات الخادم
cs: Serverové informace
eo: Servilaj informoj
es: Información del servidor
fi: Palvelimen tiedot
fr: Informations du serveur
hr: Informacije o poslužitelju
it: Informazioni server
uk: Інформація про сервер

source: Do allow the server to overwrite the informations you entered ?
ar: اسمح للخادم بإعادة كتابة المعلومات اللتي ادخلتها ؟
cs: Povolit serveru přepsat zadané informace ?
eo: Ĉu permesi la servilon anstataŭigi la informojn kiujn vi entajpis?
es: ¿Permitir al servidor sobrescribir la información que has introducido?
fi: Anna palvelimen ylikirjoittaa antamasi tiedot?
fr: Autoriser le serveur à modifier les informations choisies ?
hr: Dozvoli poslužitelju da prepiše preko informacija koje ste unijeli ?
it: Consentire al server di sovrascrivere le informazioni inserite?
uk: Дозволяти серверу перезаписувати інформацію, яку ви ввели?

source: News Feeds Configuration
ar: إعدادات خلاصات اﻷخبار
cs: Nastavení čteček
eo: Agordo de la abonfluoj
es: Configuración de canales de noticias
fi: Uutissyötteiden asetukset
fr: Configuration des flux de nouvelles
hr: Konfiguration Izvora Vijesti
it: Configurazione feed di News
uk: Налаштування новинтарів

source: Categories
ar: اﻷقسام
cs: KAtegorie
eo: Kategorioj
es: Categorías
fi: Kategoriat
fr: Catégories
hr: Kategorije
it: Categorie
uk: Категорії

source: Add
ar: إضافة
cs: Přidat
eo: Aldoni
es: Añadir
fi: Lisää
fr: Ajouter
hr: Dodaj
it: Aggiungi
uk: Створити

source: Delete
ar: حذف
cs: Smazat
eo: Forigi
es: Eliminar
fi: Poista
fr: Supprimer
hr: Izbriši
it: Rimuovi
uk: Вилучити

source: Configure
ar: إضبط
cs: Konfigurovat
eo: Konfiguri
es: Configurar
fi: Muokkaa
fr: Configurer
hr: Konfiguriraj
it: Configura
uk: Налаштувати

source: Languages
ar: اللغات
cs: Jazyky
eo: Lingvoj
es: Idiomas
fi: Kielet
fr: Langues
hr: Jezici
it: Lingue
uk: Мови

source: All
ar: الكلّ
cs: Vše
eo: Ĉiuj
es: Todos
fi: Kaikki
fr: Tout
hr: Sve
it: Tutto
uk: Усі

source: Select
ar: اختر
cs: Vybrat
eo: Elekti
es: Seleccionar
fi: Valitse
fr: Sélectionner
hr: Odaberi
it: Seleziona
uk: Вибрати

source: Empty the lists
ar: افرغ القوائم
cs: Vymazat seznamy
eo: Vakuigi la listojn
es: Vaciar las listas
fi: Tyhjennä listat
fr: Vider les listes
hr: Isprazni liste
it: Svuota le liste
uk: Спорожнити списки

source: Restore default lists
ar: استعد القوائم اﻹفتراضية
cs: Obnovit výchozí seznamy
eo: Restarigu la apriorajn listojn
es: Restaurar listas predeterminadas
fi: Palauta oletuslistat
fr: Restaurer les listes par défaut
hr: Obnovi zadane liste
it: Ripristina liste predefinite
uk: Відновити типові списки

source: There are <hilight>feeds</hilight> in this category.<br>You have to <hilight>remove them first</hilight>
ar: توجد <hilight>خلاصات</hilight> في هذا القسم.<br>عليك أن <hilight>تحذفهم أولاً</hilight>
cs: V této kategorii jsou<hilight>čtečky</hilight>.<br>Musíte je <hilight>nejdříve odebrat.</hilight>
eo: Ĉeestas <hilight>abonfluoj</hilight> en tiu kategorio.<br>Vi devas <hilight>forigi ilin unue</hilight>
es: Hay <hilight>canales</hilight> en esta categoría.<br>Primero tiene que <hilight>eliminarlos</hilight>
fi: Tässä kategoriassa on <hilight>syötteitä</hilight>.<br>Sinun täytyy <hilight>poistaa ne ensin</hilight>
fr: Il y a des <hilight>flux</hilight> dans cette catégorie.<br>Vous devez <hilight>d'abord les supprimer</hilight>
hr: U ovoj kategoriji se nalaze <hilight>izvori.</hilight><br>Morate ih <hilight>prvo ukloniti</hilight>
it: Ci sono dei <hilight>feed</hilight> in questa categoria.<br>Dovrete <hilight>prima rimuoverli</hilight>.
uk: У цій категорії є <hilight>новинтарі</hilight>.<br>Спочатку ви повинні <hilight>вилучити їх</hilight>

source: News Module - Are you sure ?
ar: وحدة اﻷخبار - هل أنت متأكد ؟
cs: Modul Novinky - Jste si jistí ?
eo: Modulo de novaĵoj - Ĉu vi certas?
es: Módulo de noticias - ¿Éstas seguro?
fi: Uutismoduuli - Oletko varma?
fr: Modules de nouvelles: Êtes-vous sûr ?
hr: Modul Vijesti - Jeste li sigurni ?
it: Modulo News - Siete sicuri?
uk: Новини — Ви впевнені ?

source: News Gadget Configuration
ar: إعدادات أداة اﻷخبار
cs: Nastavení gadgetu
eo: Agordo de la vanaĵo de novaĵoj
es: Configuración de nuevo gadget
fi: Uutisvempaimen asetukset
fr: Configuration du gadget de nouvelles
hr: Konfiguracija Naprave za Vijesti
it: Configurazione modulo News
uk: Налаштування ґаджета новин

source: View Mode
ar: أسلوب العرض
cs: Mód zobrazení
eo: Vidigo Modo
es: Modo de visualización
fi: Näyttötila
fr: Mode d'affichage
hr: Pregled
it: Modalità vista
uk: Режим перегляду

source: Show one icon for all feeds
ar: اعرض أيقونة وحدة لكل الخلاصات
cs: Zobrazit jednu ikonu pro všechny čtečky
eo: Vidigi unu piktogramon por ĉiuj abonfluoj
es: Mostrar un icono para todos los canales
fi: Näytä yksi kuvake kaikille syötteille
fr: Afficher un seul icone pour tous les flux
hr: Prikaži jednu ikonu za sve izvore
it: Mostra un'icona per tutti i feed
uk: Показати одну піктограму на всі новинтарі

source: Show all feeds
ar: اعرض كل الخلاصات
cs: Zobrazit všechny čtečky
eo: Vidigi ĉiujn abonfluojn
es: Mostrar todos los canales
fi: Näytä kaikki syötteet
fr: Afficher tous les flux
hr: Prikaži sve izvore
it: Mostra tutti i feed
uk: Показати всі новинтарі

source: Show unread feeds
ar: اعرض الخلاصات غير المفروءة
cs: Zobrazit nepřečtené čtečky
eo: Vidigi nelegitajn abonfluojn
es: Mostrar canales no leídos
fi: Näytä ei-luetut syötteet
fr: Afficher les flux non lus
hr: Prikaži nepročitane izvore
it: Mostra feed non letti
uk: Показати непрочитані новинтарі

source: Show all feeds marked as important
ar: اعرض كل الخلاصات اللتي تم تعليمها كمهمة
cs: Zobrazit všechny čtečky označené jako důležité
eo: Vidigi ĉiujn abonfluojn indikitajn kiel gravaj
es: Mostrar todos los canales marcados como importantes
fi: Näytä kaikki tärkeäksi merkityt syötteet
fr: Afficher tous les flux marqués comme importants
hr: Prikaži sve izvore označene kao važne
it: Mostra tutti i feed importanti
uk: Показати всі новинтарі, які позначені важливими

source: Show unread feeds marked as important
ar: اعرض الخلاصات غير المقروءة والمعلمة كمهمة
cs: Zobrazit nepřečtené čtečky označené jako důležité
eo: Vidigi nelegitajn abonfluojn indikitajn kiel gravaj
es: Mostrar canales sin leer marcados como importantes
fi: Näytä tärkeäksi merkityt, ei-luetut syötteet
fr: Afficher les flux non lus marqués comme importants
hr: Prikaži nepročitane izvore označene kao važne
it: Mostra i feed importanti non letti
uk: Показати непрочитані новинтарі, які позначені важливими

source: Feed open in
ar: فتح الخلاصة في
cs: Otevřít čtečku v
eo: Malfermo de abonfluo per
es: Abrir canal en
fi: Syöte avautuu
fr: Ouvir le flux dans
hr: Izvor otvoren u
it: Apri i feed in
uk: Новинтар відкривати в

source: the feed viewer
ar: عارض الخلاصة
cs: prohlížeči čteček
eo: la abonfluo-legilo
es: visor del canal
fi: syötteenkatselimessa
fr: Le lecteur de flux
hr: preglednik izvora
it: visualizzatore feed
uk: переглядачі новинтаря

source: my favorite browser
ar: متصفحي المفضل
cs: mém oblíbeném prohlížeči
eo: mia preferata ttt-legilo
es: mi navegador favorito
fi: suosikkiselaimessani
fr: Mon navigateur préféré
hr: moj omiljeni pretraživač
it: browser preferito
uk: улюбленому навігаторі тенет

source: Browser opens home url
ar: فتح المتصفح الصفحة الرئيسية لشبكة اﻹنترنت
cs: Prohlížeč otevře domovskou URL
eo: TTT-legilo malfermas la adreson de la ĉefpaĝo
es: Abrir navegador en dirección de inicio
fi: Selain avaa koti-url:n
fr: Le navigateur ouvre l'url de démarrage
hr: Pretraživač otvara glavni url
it: Il browser apre la url di partenza
uk: Навігатор відкриває домашню сторінку

source: instead of feed url
ar: بدلاً من رابط الخلاصة
cs: místo URL čtečky
eo: anstataŭ la abonfluan adreson
es: en lugar de la dirección del canal
fi: syötteen url:n asemesta
fr: à la place de l'url du flux
hr: umjesto url izvora
it: invece della url del feed
uk: замість посилання на новинтар

source: Apply this to all News gadgets
ar: طبق هذا لى كل أدوات اﻷخبار
cs: Aplikovat toto na všechny gadgety
eo: Apliki tion al ĉiuj novaĵo-vanaĵoj
es: Aplicar a todos los gadgets nuevos
fi: Käytä tätä kaikille Uutisvempaimille
fr: Appliquer à tous les gadgets de nouvelles
hr: Primijeni ovo na sve aparate Vijesti
it: Applica a tutti i moduli News
uk: Застосувати це на всі ґаджети новин

source: News Gadget Content Configuration
ar: إعدادات محتوى أداة اﻷخبار
cs: Nastavení obsahu gadgetu
eo: Agordo de la enhavo de novaĵo-vanaĵo
es: Configuración de contenido de nuevo gadget
fi: Uutisvempaimen sisällön asetukset
fr: Configuration du contenu du gadget de nouvelles
hr: Konfiguracija Sadržaja Aparata Vijesti
it: Configurazione contenuto modulo News
uk: Налаштування вмісту ґаджета новин
