Repository: kakaroto/e17
Catalog: E-MODULES-EXTRA/news/po/*.po
Languages: ar, cs, eo, es, fi, fr, hr, it, uk

source: Avalaible Feeds
ar: الخلاصات المتوفرة
cs: Dostupné čtečky
eo: Disponeblaj abonfluoj
es: Canales disponibles
fi: Käytettävissä olevat syötteet
fr: Flux disponibles
hr: Raspoloživi Izvori
it: Feed disponibili
uk: Доступні новинтарі

source: Add this Feed
ar: أضِف هذه الخلاصة
cs: Přidat tuto čtečku
eo: Aldoni tiun abonfluon
es: Añadir este canal
fi: Lisää tämä syöte
fr: Ajouter ce flux
hr: dodaj ovaj Izvor
it: Aggiungi questo feed
uk: Додати цей новинтар

source: Selected Feeds
ar: اختر خلاصات
cs: Vybrané čtečky
eo: Elektitaj abonfluoj
es: Canales seleccionados
fi: Valitut syötteet
fr: Flux sélectionnés
hr: Odabrani Izvori
it: Feed selezionati
uk: Вибрані новинтарі

source: Remove this Feed
ar: أزِل هذه الخلاصة
cs: Odebrat tuto čtečku
eo: Forviŝi tiun abonfluon
es: Eliminar este canal
fi: Poista tämä syöte
fr: Supprimer ce flux
hr: Ukloni ovaj Izvor
it: Elimina questo feed
uk: Вилучити цей новинтар

source: News Feeds Language Configuration
ar: إعدادات خلاصات اﻷخبار
cs: Nastavení jazyka čteček
eo: Agordo de lingvo de la abonfluoj
es: Configuración de idioma de canales de noticias
fi: Uutissyötteiden kielen asetukset
fr: Configuration de la langue des flux de nouvelles
hr: Konfiguracija Jezika Izvora Vijesti
it: Configurazione lingua feed di News
uk: Налаштування мови новинтарів

source: Welcome to News Module !
ar: أهلاً بك في وحدة اﻷخبار !
cs: Vítejte v modulu Novinky !
eo: Bonvenon en la modulo de novaĵoj!
es: ¡Bienvenido al módulo de noticias!
fi: Tervetuloa Uutismoduuliin!
fr: Bienvenue dans le module des nouvelles !
hr: Dobrodošli u Modul Vijesti
it: Benvenuti nel modulo News!
uk: Ласкаво просимо до новин !

source: Please select the languages that you are able to read
ar: يرجى تحديد اللغات اللتي بإمكانك قراءتها
cs: Prosím vyberte jazyky, které ovládáte
eo: Bonvolu elekti la lingvojn kiujn vi povas legi
es: Selecciona los idiomas que sabe leer
fi: Valitse kielet, joita pystyt lukemaan, kiitos
fr: Veuillez sélectionner les langues que vous pouvez lire
hr: Molimo odaberite jezik koji možete čitati
it: Selezionate la lingua che volete leggere
uk: Будь ласка, виберіть мови, котрими ви бажаєте читати

source: The <hilight>name</hilight> you entered is not correct
ar: <hilight>الاسم</hilight> اللذي ادخلتها غير صحيح
cs: Zadané <hilight>jméno</hilight> není správné
eo: La <hilight>nomo</hilight> kiun vi entajpis ne estas korekta
es: El <hilight>nombre</hilight> que has introducido no es correcto
fi: <hilight>Nimi</hilight>, jonka annoit, ei ole sopiva
fr: Le <hilight>nom</hilight> que vous avez choisi est incorrect
hr: Unešeni <hilight>naziv</hilight> je neispravan.
it: Il <hilight>nome</hilight> inserito non è corretto
uk: Ви ввели неправильну <hilight>назву</hilight>

source: The need to <hilight>select a category</hilight>.
ar: الحاجة لـ<hilight>تحديد قسم</hilight>.
cs: Musíte <hilight>vybrat kategorii</hilight>.
eo: La bezono de <hilight>elekti kategorion</hilight>.
es: Se necesita <hilight>seleccionar una categoría</hilight>.
fi: Tarve <hilight>kategorian valitsemiselle</hilight>.
fr: Il est nécessaire de <hilight>sélectioner une catégorie</hilight>.
hr: Treba <hilight>odabrati kategoriju</hilight>.
it: Occorre <hilight>selezionare una categoria</hilight>.
uk: Потрібно <hilight>вибрати категорію</hilight>.

source: A feed with the <hilight>name</hilight> %s <hilight>already exists</hilight><br>in the %s category<br><br>Its not possible to have feeds with the same name<br>in one category.
ar: خلاصة <hilight>باﻹسم </hilight> %s <hilight> موجودة سلفا </hilight><br> في القسم %s <br><br> من غير الممكن أن تكون هناك أكثر من خلاصة بنفس الاسم<br>في نفس القسم
cs: Čtečka se <hilight>jménem</hilight> %s <hilight>už existuje</hilight><br>v kategorii %s .<br><br>Není možné mít čtečky se stejným jménem<br>v jedné kategorii.
eo: Abonfluo kun la <hilight>nomo</hilight> %s <hilight>jam ĉeestas</hilight><br>en la kategorio %s<br><br>Ne eblas nomigi same abonfluojn<br>en unu kategorio.
es: Un canal de noticias con el <hilight>nombre</hilight> %s <hilight>ya existe</hilighit><br> en la categoría %s<br><br>No es posible tener alimentadores con el mismo nombre<br>en una categoría.
fi: Syöte, jonka <hilight>nimi</hilight> on %s, <hilight>on jo olemassa</hilight><br>kategoriassa %s<br><br>Yhdessä kategoriassa ei voi olla useita<br>samannimisiä syötteitä.
fr: Un flux du <hilight>nom</hilight> %s <hilight>existe déjà</hilight><br>dans la catégorie %s<br><br>Il n'est pas possible d'avoir deux flux de même nom<br>dans une catégorie.
hr: Izvor sa <hilight>nazivom</hilight> %s <hilight>već postoji</hilight><br>u %s kategoriji<br><br>Nije moguće imati izvore sa istim nazivom<br>u jednoj kategoriji.
it: <hilight>Esiste già</hilight> un feed di <hilight>nome</hilight> %s<br>nella categoria %s<br><br>Non è possibile avere feed con lo stesso<br>nome nella stessa categoria.
uk: Новинтар з <hilight>назвою</hilight> %s <hilight>вже існує</hilight><br>в категорії %s<br><br>Неможливо мати два новинтарі з однаковою назвою<br>в одній категорії.

source: You need to select a <hilight>language</hilight>.
ar: يجب أن تحدد <hilight>لغة</hilight>.
cs: Musíte vybrat <hilight>jazyk</hilight>.
eo: Ve devas elekti <hilight>lingvon</hilight>.
es: Es necesario seleccionar un <hilight>idioma</hilight>.
fi: Sinun täytyy valita <hilight>kieli</hilight>.
fr: Vous devez sélectionner une <hilight>langue</hilight>.
hr: Trebate odabrati <hilight>jezik</hilight>.
it: Occorre selezionare una <hilight>lingua</hilight>!
uk: Вам потрібно вибрати <hilight>мову</hilight>.

source: The <hilight>url</hilight> you specified is not correct
ar: <hilight>الراط</hilight> اللذي كتبته غير صحيح
cs: Zadaná <hilight>URL</hilight> není správná
eo: La <hilight>URL-adreso</hilight> kiun vi tajpis ne estas korekta
es: La <hilight>dirección</hilight> especificada es incorrecta
fi: <hilight>url</hilight>, jonka valitsit, ei ole sopiva
fr: L' <hilight>url</hilight> spécifiée est incorrecte
hr: Specificirani<hilight>url</hilight> je neisrpavan
it: La <hilight>url</hilight> specificata non è corretta
uk: <hilight>Посилання</hilight>, яке ви вказали, неправильне

source: You need to enter a <hilight>name</hilight> !
ar: يجب أن تدخل <hilight>إسم</hilight> !
cs: Musíte zadat <hilight>jméno</hilight> !
eo: Vi bezonas entajpi <hilight>nomon</hilight>!
es: ¡Es necesario introducir un <hilight>nombre</hilight> !
fi: Sinun täytyy antaa <hilight>nimi</hilight>!
fr: Vous devez entrer un <hilight>nom</hilight> !
hr: Morate unijeti <hilight>naziv</hilight> !
it: Occorre inserire un <hilight>nome</hilight>!
uk: Вам потрібно ввести <hilight>назву</hilight> !

source: The <hilight>name</hilight> you entered is <hilight>already used</hilight><br>by another category
ar: <hilight>اﻹسم</hilight> الذي ادخلته <hilight>مستخدم سلفا </hilight><br> بواسطة قسم آخر
cs: Zadané <hilight>jméno</hilight> je už <hilight>použité</hilight><br>jinou kategorií
eo: La <hilight>nomo</hilight> kiun vi tajpis <hilight>jam estis uzita</hilight><br> de alia kategorio
es: El <hilight>nombre</hilight> introducido <hilight>ya existe</hilight><br>en otra categoría
fi: <hilight>Nimi</hilight>, jonka annoit, on jo toisen kategorian <hilight>käytössä</hilight>
fr: Le <hilight>nom</hilight> que vous avez choisi est <hilight>déjà utilisé</hilight>par une autre catégorie
hr: Unešeni <hilight>naziv</hilight> je <hilight> već u upotrebi </hilight><br>u drugoj kategoriji
it: Il <hilight>nome</hilight> inserito è <hilight>già usato<hilight><br>da un'altra categoria
uk: <hilight>Назву</hilight>, яку ви ввели, <hilight>вже використовується</hilight><br>іншою категорією

source: Set all as read
ar: علم الكل كمقروءة
it: Segna tutti come letti
uk: Встановити всі як прочитані

source: Update
ar: تحديث
it: Aggiorna
uk: Оновити

source: Settings
ar: اﻹعدادات
it: Impostazioni
uk: Налаштування

source: Newsfeeds
uk: Новини

source: Contents
uk: Вміст

source: Gadget
ar: أداة/إضافة
uk: Ґаджет

source: Main
ar: الرئيسية
it: Principale
uk: Головне

source: News Module DEBUG DEBUG DEBUG DEBUG
ar: وحدة اﻷخبار إزالة علة إزالة علة إزالة علة إزالة علة
cs: Modul Novinky DEBUG DEBUG DEBUG DEBUG
eo: Modulo de novaĵoj DEBUG DEBUG DEBUG DEBUG
es: Módulo de noticias DEBUG DEBUG DEBUG DEBUG
fi: Uutismoduulin DEBUG DEBUG DEBUG
fr: Module des nouvelles DÉBOGAGE DÉBOGAGE DÉBOGAGE
hr: Modul Vijesti DEBUG DEBUG DEBUG DEBUG
it: Modulo News DEBUG DEBUG DEBUG DEBUG
uk: Новини

source: News Module
ar: وحدة اﻷخبار
cs: Modul Novinky
eo: Modulo de novaĵoj
es: Módulo de noticias
fi: Uutismoduuli
fr: Module de nouvelles
hr: Modul Vijesti
it: Modulo News
uk: Новини

source: News Module Error
ar: خلل في وحدة اﻷخبار
cs: Chyba modulu
eo: Eraro de la modulo de novaĵoj
es: Error del módulo de noticias
fi: Uutismoduulin virhe
fr: Erreur du module de nouvelles
hr: Greška u Modulu Vijesti
it: Errore del modulo News
uk: Помилка новин

source: Feeds in this gadget
ar: الخلاصات في هذه اﻷداة
cs: Čtečky v tomto gadgetu
eo: Abonfluoj en tiu vanaĵo
es: Canales en este gadget
fi: Tämän vempaimen syötteet
fr: Flux dans ce gadget
hr: Izvori u ovom aparatu
it: Feed in questo modulo
uk: Новинтарі в цьому ґаджеті

source: Articles in selected feed
ar: المقالات في الخلاصة المحددة
cs: Články ve vybrané čtečce
eo: Artikoloj en la elektita abonfluo
es: Artículos en el canal seleccionado
fi: Artikkelit valitussa syötteessä
fr: Articles du flux sélectionné
hr: Artikli u odabranom izvoru
it: Articoli nel feed selezionato
uk: Статті у вибраному новинтарі

source: Configure this feed
cs: Konfigurovat čtečku
eo: Agordi tiun abonfluon
es: Configurar este canal
fi: Muokkaa tätä syötettä
fr: Configurer ce flux
hr: Konfiguriraj ovaj izvor

source: Set all feeds as read
cs: Označit všechny jako přečtené
eo: Difini ĉiujn abonfluojn kiel legitaj
es: Marcar todos los canales como leídos
fi: Merkitse kaikki syötteet luetuksi
fr: Marquer tous les flux comme lus
hr: Postavi sve izvore kao pročitane

source: Update all feeds
cs: Aktualizovat všechny
eo: Ĝisdatigi ĉiujn abonfluojn
es: Actualizar todos los canales
fi: Päivitä kaikki syötteet
fr: Actualiser tous les flux
hr: Osvježi sve izvore

source: Configure gadget
cs: Konfigurovat gadget
eo: Agordi la vanaĵon
es: Configurar gadget
fi: Muokkaa vempainta
fr: Configurer le gadget
hr: Konfiguriraj aparat

source: Configure gadget content
cs: Konfigurovat obsah gadgetu
eo: Agordi la enhavon de la vanaĵo
es: Configurar el contenido del gadget
fi: Muokkaa vempaimen sisältöä
fr: Configurer le contenu du gadget
hr: Konfiguriraj sadržaj aparata

source: Main Configuration
cs: Hlavní nastavení
eo: Ĉefa konfiguraĵo
es: Configuración principal
fi: Pääasetukset
fr: Configuration principale
hr: Konfiguracija Glavnog

source: Feeds Configuration
cs: Nastavení čteček
eo: Konfiguraĵo de abonfluoj
es: Configuración de canales
fi: Syötteiden asetukset
fr: Configuration des flux
hr: Konfiguracija Izvora

source: Configuration
cs: Nastavení
eo: Konfiguraĵo
es: Configuración
fi: Asetukset
hr: Konfiguracija

source: Gadget Contents
ar: تحرير محتوى اﻷداة
it: Contenuti del gadget
