Repository: kakaroto/e17
Catalog: elitaire/po/*.po
Languages: sk

source: Elitaire Error in %s: missing element_value part!
sk: Chyba Elitaire v %s: chýba časť element_value!

source: Elitaire Error in %s: missing element group!
sk: Chyba Elitaire v %s: chýba skupina element!

source: You win!
sk: Vyhrali ste!

source: You lose!
sk: Prehrali ste!

source: Game Over
sk: Koniec hry

source: Elitaire Error: cards file %s not found!
sk: Chyba Elitaire: súbor s kartami %s nebol nájdený!

source: Elitaire Error in %s: elitaire_card_field does not exist!
sk: Chyba Elitaire v %s: pole elitaire_card_field neexistuje!

source: Elitaire Error: unable to find %s theme!
sk: Chyba Elitaire: nepodarilo sa nájsť tému vzhľadu %s!

source: Games
sk: Hry

source: Themes
sk: Témy vzhľadu

source: Cards
sk: Karty

source: CONTEXT|Undo
sk: CONTEXT|Vrátiť

source: CONTEXT|Highscore
sk: CONTEXT|Najlepšie skóre

source: CONTEXT|Preferences
sk: CONTEXT|Nastavenia

source: CONTEXT|About
sk: CONTEXT|O aplikácii

source: CONTEXT|Help
sk: CONTEXT|Pomocník

source: CONTEXT|New
sk: CONTEXT|Nová

source: Elitaire Error: No theme file in %s!
sk: Chyba Elitaire: V %s nie je žiadny súbor témy vzhľadu!

source: Elitaire Error: No cards file in %s!
sk: Chyba Elitaire: V %s nie je žiadny súbor s kartami!

source: Elitaire Error: Card %s is missed!
sk: Chyba Elitaire: Chýba karta %s!

source: Elitaire Error: The bg pic is missed!
sk: Chyba Elitaire: Chýba obrázok pozadia!

source: Elitaire Error: The shadow pic is missed!
sk: Chyba Elitaire: Chýba obrázok tieňa!

source: Elitaire Error: unknown game %s
sk: Chyba Elitaire: neznáma hra %s!

source: Elitaire Error: Callback registering failed!
sk: Chyba Elitaire: Chyba pri registrácii spätného volania!

source: About
sk: O aplikácii

source: %s version %s Author: %s %s %s Thanks to: %s %s
sk: %s verzia %s Autor: %s %s %s Poďakovanie: %s %s

source: Configuration
sk: Konfigurácia

source: Graphic
sk: Grafika

source: animated movements
sk: animované pohyby

source: shadows
sk: tiene

source: velocity:
sk: rýchlosť:

source: frame rate:
sk: rýchlosť v rámcoch:

source: Laziness
sk: Lenivosť

source: normal mode
sk: normálny režim

source: lazy mode
sk: lenivý režim

source: Render Engine
sk: Vykresľovacie jadro

source: Changes only affect after new start
sk: Zmeny sa prejavia iba po opätovnom spustení

source: Software
sk: Softvér

source: OpenGL (testing)
sk: OpenGL (experimentálne)

source: Elitaire Error: Could not save configuration.
sk: Chyba Elitaire: nepodarilo sa uložiť konfiguráciu!

source: Highscore
sk: Najlepšie skóre

source: Name
sk: Meno

source: Please insert your name
sk: Prosím, zadajte svoje meno

source: Won Games:
sk: Vyhraných hier:

source: Lost Games:
sk: Prehraných hier:

source: relative Quote:
sk: relatívne:

source: Elitaire Error: Cannot init Ecore
sk: Chyba Elitaire: Nemožno inicializovať Ecore

source: Elitaire Error: Cannot init Ecore File
sk: Chyba Elitaire: Nemožno inicializovať Ecore File

source: Elitaire Error: Cannot init Edje
sk: Chyba Elitaire: Nemožno inicializovať Edje

source: Elitaire Error: Cannot init Ecore Config
sk: Chyba Elitaire: Nemožno inicializovať Ecore Config

source: Elitaire Error: Cannot init Ewl
sk: Chyba Elitaire: Nemožno inicializovať Ewl
