Repository: kakaroto/e17
Catalog: E-MODULES-EXTRA/drawer/po/*.po
Languages: cs, el, eo, es, fr, pt, sl, uk

source: Drawer Module
cs: Modul Drawer
el: Άρθρωμα
eo: Modulo Entenilo
es: Modulo cajón
fr: Module Tiroir
pt: Módulo Drawer
sl: Modul Predalnik
uk: Шухляда

source: Plugins selection
cs: Výběr modulů
el: Επιλογή επεκτάσεων
eo: Elekto de kromaĵoj
es: Selección de complementos
fr: Sélection des greffons
pt: Seleção de "plugins"
sl: Izbira vtičnikov
uk: Виділення

source: Plugins settings
cs: Nastavení modulů
el: Ρυθμίσεις επεκτάσεων
eo: Agordoj de kromaĵoj
es: Configuración de complementos
fr: Configuration des greffons
pt: Definições dos "plugins"
sl: Nastavitev vtičnikov
uk: Налаштування

source: Source plugins
cs: Zdrojové moduly
eo: Fonto-kromaĵoj
es: Complementos de fuente
fr: Source des greffons
pt: "Plugins" fonte
sl: Izvorni vtičniki
uk: Джерело

source: View plugins
cs: Zobrazovací moduly
eo: Vidigi kromaĵojn
es: Complementos de vista
fr: Affichage des greffons
pt: Ver "plugins"
sl: Ogled vtičnikov
uk: Переглянути

source: Description: Unavailable
cs: Popis: Nedostupný
el: Περιγραφή: Μη διαθέσιμη
eo: Priskribo: Nedisponebla
es: Descripción: no disponible
fr: Description : non disponible
pt: Descrição: indisponível
sl: Opisa ni
uk: Опис: недоступний

source: Source settings
cs: Nastavení zdroje
el: Ρυθμίσεις πηγής
eo: Agordo de fonto
es: Configuración de fuente
fr: Paramétrage de la source
pt: Definições de fonte
sl: Nastavitev virov
uk: Налаштування джерела

source: View settings
cs: Nastavení zobrazení
el: Ρυθμίσεις προβολής
eo: Agordoj de vidigo
es: Configuración de vista
fr: Paramètres de l'affichage
pt: Definições de visualização
sl: Ogled nastavitev
uk: Переглянути налаштування

source: Drawer Module Configuration data needed upgrading. Your old configuration<br> has been wiped and a new set of defaults initialized. This<br>will happen regularly during development, so don't report a<br>bug. This simply means the module needs new configuration<br>data by default for usable functionality that your old<br>configuration simply lacks. This new set of defaults will fix<br>that by adding it in. You can re-configure things now to your<br>liking. Sorry for the inconvenience.<br>
cs: Nastavení drawer modulu potřebuje aktualizaci. Vaše staré nastavení<br> bylo nahrazeno novým výchozím. Toto<br>se bude stávat často během vývoje, takže nereportujte<br>bug. Prostě to znamená, že modul potřebuje nová data<br>nastavení pro funkce, které vaše staré<br>nastavení neobsahuje. Nové nastavení<br>to spraví. Nyní si můžete modul nastavit, jak<br>chcete. Omlouváme se za vzniklé potíže.<br>
eo: La agordo de la modulo Desegnilo bezonas ĝisdatigon. Via malnova agordo<br> estis viŝita kaj nova aro da defaŭltoj estis pravalorizitaj. Tio okazos ofte dum<br> la programado, do ne raportu cimon. Tio simple signifas ke la modulo<br> Skeleto bezonas novajn datumojn de agordo defaŭlte por uzebla funkcieco<br> kiuj viaj agordoj mankas. Tiu nova aro da defaŭltoj korektos tion aldoniĝante<br> Vi povas de nove agordi nun kiel vi volas. Bonvolu pardoni por la malagrablaĵoj.<br>
es: La Configuración de Modulo Cajón necesita actualizarse. Su antigua configuración <br> ha sido eliminada y un nueva configuración predeterminada se ha establecido, lo que <br> sucederá regularmente durante el desarrollo, así que no informe del <br> error. Esto simplemente significa que el modulo necesita nuevos datos de <br> configuración predeterminados para la funcionalidad que su antigua configuración <br> no posee. Este nuevo conjunto de configuraciones las arreglará <br> agregando las configuraciones que faltan. Ahora puede reconfigurar los ajustes a su <br> gusto. Lamentamos los inconvenientes.<br>
fr: Les données de configuration du module Tiroir ont dû être mises à jour. Votre ancienne<br>configuration a été supprimée et de nouveaux paramètres par<br>défaut sont en place. Cela risque d'arriver en phase de<br>développement, aussi est-il inutile de faire un rapport de bogue.<br>Cela signifie simplement que le module a besoin<br>de cette mise à niveau pour être à nouveau fonctionnel.<br>Vous pouvez maintenant tout reconfigurer selon votre goût.<br>Désolé pour la gêne occasionnée.<br>
pt: A configuração do Drawer tem de ser atualizada. A sua configuração será removida e ser iniciada uma nova.<br>Isto irá acontecer recorrentemente durante o ciclo de desenvolvimento e não deve reportar qualquer erro.<br>O módulo precisava de novos dados para funcionar corretamente e a sua antiga configuração não os possuia.<br>Este conjunto de valores corrige a configuração e posteriormente pode configurar o módulo ao seu gosto.<br>Desculpe qualquer inconveniente.<br>
sl: Nastavitve za modul Predalnik·so potrebovale posodobitev.·Vaše stare nastavitve so<br>·bile zamenjane z novimi privzetimi.·To<br>se bo med razvojem vedno dogajalo, tako da ne poročajte o hrošču<br>To preprosto pomeni, da je·module·potreboval nove nastavitve<br>za uporabnejše delovanje<br>ki jih v starih ni bilo·Te nove privzete nastavitve bodo to popravile<br>Sedaj lahko nastavite svoje nastavitve<br>Opravičujemo se za neprijetnosti.<br>
uk: Дані налаштування шухляди вимушено оновлюються. Ваші старі налаштування<br> вилучено і встановлено типові. Це<br> буде траплятися регулярно протягом розробки, тому не доповідайте про цю<br>ваду. Іншими словами, шухляда потребує нові дані<br> налаштувань встановити типовими для додаткових функцій, котрих у ваших старих<br>налаштуваннях бракує. Оновлення до типових налаштувань виправить<br>це. Ви можете знову все переналаштувати на ваше<br>вподобання. Вибачте за незручності.<br>

source: Your Drawer Module configuration is NEWER than the module version. This is very<br>strange. This should not happen unless you downgraded<br>the module or copied the configuration from a place where<br>a newer version of the module was running. This is bad and<br>as a precaution your configuration has been now restored to<br>defaults. Sorry for the inconvenience.<br>
cs: Vaše nastavení je NOVĚJŠÍ než verze modulu. Je to velmi<br>divné. Toto by se nemělo stát, pokud jste ovšem nedowngradovali<br>modul nebo nezkopírovali nastavení odněkud,<br>kde běžela novější verze modulu. Jako protiopatření<br>bylo vaše nastavení obnoveno na<br>výchozí. Omlouváme se za vzniklé potíže.<br>
eo: Via agordo de la modulo Desegnilo estas PLI NOVA ol la modulo Skeleto. Tio estas<br> strangega. Tio ne devus okazi almenaŭ vi malĝisdatigis<br>Enlightenement aŭ kopiis la agordon el ejo kie pli nova<br>versio de la Modulo Skeleto estis funciinta. Tio estas malbona kaj<br>kiel antaŭzorgo via agordo estis restaŭrita per defaŭltaĵoj.<br>Bonvolu pardoni por la ĝeno.<br>
es: Su configuración del módulo cajón es más reciente que la versión del propio módulo. Esto es muy <br> extraño y no debería pasar a menos que haya desactualizado <br> el módulo o haya copiado la configuración de otro lugar en donde <br> se está ejecutando una versión más reciente del módulo cajón. Esto no es bueno, y <br> como medida de precaución, su configuración ha sido restaurada a los ajustes predeterminados. Lamentamos los inconvenientes. <br>
fr: Votre configuration du module Tiroir est PLUS RÉCENTE que la version<br>actuelle du module. C'est vraiment étonnant. Cela ne devrait pas se produire, à moins<br>que vous n'ayez installé une version antérieure ou copié la configuration du module<br>depuis une machine sur laquelle une version plus récente était en cours. Ce n'est<br>pas bon et, par mesure de précaution, les valeurs par défaut de votre configuration<br>ont été restaurées.<br>Désolé pour le désagrément.<br>
pt: A sua versão do Drawer é mais recente do que a do módulo<br>Esta situação é estranha e não deveria acontecer a menos que você tivesse revertido o módulo para uma versão inferior ou tenha copiado a configuração de um local em que esteja a ser executada uma versão mais recente do módulo.<br>Isto é mau e por precaução, a sua configuração foi reiniciada.<br>Desculpe qualquer inconveniente.<br>
sl: Vaše nastavitve za modul Predalnik so novejše od različice modula.·To je zelo čudno<br>in se ne bi smelo zgoditi, razen če ste namestili starejši modul<br>ali kopirali nastavitve od nekje<br>kjer teče novejši modul.·To je slabo in<br>za preprečitev napak, so bile obnovljene privzete nastavitve·<br>Opravičujemo se za neprijetnosti.<br>
uk: Налаштування шухляди — новіші за версію самої шухляди. Це дуже<br>дивно. Цьому не слід траплятися, якщо ви не понизили версію<br>шухляди або не скопіювали налаштування з<br>новішої версії. Це недобре<br>, тому ваші налаштування відновлені до<br>типових. Вибачте за незручності.<br>

source: The plugin is not configurable
cs: Modul nelze nastavovat
el: Η επέκταση δεν ρυθμίζεται
eo: Ne eblas agordi tiun kromaĵon
es: El complemento no es configurable
fr: Le greffon n'est pas configurable
pt: Não pode configurar o "plugin"
sl: Vtičnika ni mogoče nastavljati
uk: Не налаштовано

source: Drawer Plugins
cs: Moduly pro Drawer
el: Επεκτάσεις συρταριού
eo: Kromajoj por Entenilo
es: Complementos de cajón
fr: Greffons de Tiroir
pt: "Plugins" do Drawer
sl: Vtičniki predalnika
uk: Шухляда

source: The plugin '%s' was not found.
cs: Modul '%s' nebyl nalezen.
el: Η επέκταση '%s' δεν βρέθηκε.
eo: La kromaĵo '%s' ne estis trovita.
es: No se encontró el complemento «%s»
fr: Le greffon « %s » est introuvable.
pt: O "plugin" %s não foi encontrado.
sl: Vtičnik·'%s'·ni bil najden.
uk: Не знайдено «%s»

source: The plugin '%s' could not be opened.
cs: Modul '%s' nemůže být otevřen.
el: Η επέκταση '%s' δεν μπόρεσε να ανοιχθεί.
eo: La kromaĵo '%s' ne malfermeblas
es: No se pudo abrir el complemento «%s»
fr: Impossible d'ouvrir le greffon « %s ».
pt: O "plugin" %s não foi iniciado.
sl: Vtičnika·'%s'·ni bilo mogoče odpreti.
uk: Неможливо відкрити «%s»

source: The plugin '%s' does not contain all required functions.
cs: Modul '%s' neobsahuje všechny důležité funkce.
el: Η επέκταση '%s' δεν περιέχει όλες τις απαιτούμενες λειτουργίες.
eo: La kromaĵo '%s' ne enhavas ĉiujn bezonatajn funkciojn
es: El complemento «%sx no contiene todas las funciones requeridas.
fr: Le greffon « %s » ne contient pas toutes les fonctions nécessaires.
pt: O "plugin" %s não possui as funções necessárias.
sl: Vtičnik·'%s'·ne vsebuje vseh zahtevanih funkcij.
uk: «%s» не містить потрібних функцій

source: The plugin '%s' does not have the required API version.
cs: Modul '%s' nemá vyžadovanou verzi API.
el: Η επέκταση '%s' δεν έχει την απαιτούμενη έκδοση ΑΡΙ
eo: La kromaĵo '%s' ne enhavas necesan versio de API.
es: El complemento «%s» no tiene la versión API requerida.
fr: Le greffon « %s » n'utilise pas la bonne version de l'API.
pt: O "plugin" %s não possui a versão API necessária.
sl: Vtičnik·'%s'·ne vsebuje zahtevane različice·API.
uk: «%s» не має потрібної версії API

source: Drawer
el: Συρτάρι
eo: Entenilo
es: Cajón
fr: Tiroir
sl: Predalnik
uk: Шухляда

source: Drawer Configuration Updated
cs: Drawer konfigurace aktualizována
el: Ρύθμιση συρταριού ανανεώθηκε
eo: Agordo de Entenilo aktualigita.
es: Actualizar la configuración del cajón
fr: Configuration de Tiroir actualisée
pt: A configuração do Drawer foi atualizada
sl: Nastavitve predalnika posodobljene
uk: Налаштування оновлено

source: Settings
cs: Nastavení
el: Ρυθμίσεις
eo: Agordoj
es: Configuración
fr: Configuration
pt: Definições
sl: Nastavitve
uk: Налаштування

source: Open Containing Directory
cs: Otevřít obsahující adresář
el: Άνοιγμα περιεχόμενου καταλόγου
es: Abrir la carpeta contenedora
fr: Ouvrir le dossier conteneur
pt: Abrir diretório
sl: Odpri vsebujoči imenik
uk: Відкрити вміст теки

source: Directory Watcher settings
cs: Nastavení hlídače složek
fr: Configuration de la surveillance de dossier
pt: Definições do monitorizador de diretórios
sl: Nastavitev opazovalca map
uk: Налаштування спостерігача за теками

source: Home
cs: Domov
el: Αρχικό
eo: Hejmo
es: Inicio
fr: Dossier personnel
pt: Pasta pessoal
sl: Dom
uk: Домівка

source: Directory (%s)
cs: Adresář (%s)
el: Κατάλογος (%s)
es: Directorio (%s)
fr: Dossier (%s)
pt: Diretório (%s)
sl: Mapa·(%s)
uk: Тека (%s)

source: Drawer Plugin : Directory Watcher
cs: Drawer modul: hlídač složek
fr: Greffon de Tiroir : surveillance de dossier
pt: "Plugin" Drawer: Monitorizador de diretórios
sl: Vtičnik predalnika·:·Opazovalec map
uk: Шухляда : спостерігач за теками

source: Watch path
cs: Cesta
es: Ver ruta
fr: Chemin
pt: Monitorizar caminhos
sl: Pot opazovanja
uk: Дивитись за шляхом

source: Custom file manager
cs: Vlastní správce souborů
el: Προσαρμοσμένος διαχειριστής αρχείων
es: Gestor de archivos personalizado
fr: Gestionnaire de fichiers personnalisé
pt: Gestor de ficheiros personalizado
sl: Uporabniško določen upravitelj datotek
uk: Звичайний файловий менеджер

source: Sort Options
cs: Nastavení řazení
el: Επιλογές ταξινόμησης
es: Opciones de clasificación
fr: Options de tri
pt: Opções de organização
sl: Možnosti razvrščanja
uk: Параметри впорядкування

source: Sort directories first
cs: Seřadit první adresáře
el: Ταξινόμηση των καταλόγων πρώτα
es: Ordenar los directorios primero
fr: Afficher les dossiers en premier
pt: Ordenar por diretórios
sl: Razvrsti najprej mape
uk: Спочатку впорядковувати теки

source: Sort by name
cs: Seřadit podle jména
el: Ταξινόμηση κατά όνομα
eo: Ordigi laŭ nomo
es: Ordenar por nombre
fr: Trier par nom
pt: Ordenar por nome
sl: Razvrsti po imenu
uk: Впорядкувати за назвою

source: Sort by access time
cs: Seřadit podle času přístupu
el: Ταξινόμηση κατά ώρα πρόσβασης
es: Ordenar por hora de acceso
fr: Trier par dernier accès
pt: Ordenar por data de acesso
sl: Razvrsti po času dostopanja
uk: Впорядкувати за часом доступу

source: Sort by modification time
cs: Seřadit podle času úpravy
el: Ταξινόμηση κατά ώρα τροποποίησης
es: Ordenar por hora de modificación
fr: Trier par dernière modification
pt: Ordenar por data de modificação
sl: Razvrsti po času spreminjanja
uk: Впорядкувати за часом модифікації

source: Sort by change time
cs: Seřadit podle času změny
el: Ταξινόμηση κατά ώρα αλλαγής
es: Ordenar por hora de cambio
fr: Trier par dernier changement
pt: Ordenar por data de alteração
sl: Razvrsti po času spremembe
uk: Впорядкувати за часом зміни

source: Sort by size
cs: Seřadit podle velikosti
el: Ταξινόμηση κατά μέγεθος
eo: Ordigi laŭ grando
es: Ordenar por tamaño
fr: Trier par la taille
pt: Ordenar por tamanho
sl: Razvrsti po velikosti
uk: Впорядкувати за розміром

source: Launcher settings
cs: Nastavení spouštěče
el: Ρυθμίσεις εκκινητή
eo: Agordoj de lanĉilo
es: Configuración del lanzador
fr: Paramétrage du lanceur
pt: Definições do lançador
sl: Nastavitev zaganjalnika
uk: Налаштування пускача

source: Change Item Properties
cs: Změnit vlastnosti
el: Αλλαγή ιδιοτήτων αντικειμένου
eo: Ŝanĝi ecojn de eroj
es: Cambiar propiedades del elemento
fr: Changer les propriétés de l'élément
pt: Alterar propriedades do item
sl: Spremeni lastnosti predmeta
uk: Змінити властивості пункту

source: Remove Item
cs: Vymazat
el: Αφαίρεση αντικειμένου
eo: Forigu eron
es: Eliminar el elemento
fr: Retirer l'élément
pt: Remover item
sl: Odstrani predmet
uk: Вилучити пункт

source: %s source
cs: %s zdroj
el: %s πηγή
es: %s fuente
pt: Fonte de %s
sl: %s·vir
uk: Джерело %s

source: Drawer Plugin : Launcher
cs: Drawer Modul : Spouštěč
el: Συρτάρι: Εκκινητής
es: Complemento cajón : Lanzador
fr: Greffon de Tiroir : lanceur
pt: "Plugin" Drawer: Lançador
sl: Vtičnik predalnika·:·Zaganjalnik
uk: Шухляда : пускач

source: Selected Bar Source
cs: Vybraný zdroj lišty
eo: Fonto de Elektita Listelo
es: Fuente de la barra seleccionada
fr: Sélection de la source
pt: Fonte da barra selecionada
sl: Izbrani vir vrstice
uk: Вибране джерело панелі

source: Add
cs: Přidat
el: Προσθήκη
eo: Aldoni
es: Añadir
fr: Ajouter
pt: Adicionar
sl: Dodaj
uk: Додати

source: Delete
cs: Smazat
el: Διαγραφή
eo: Forigi
es: Borrar
fr: Supprimer
pt: Apagar
sl: Izbriši
uk: Вилучити

source: Configure
cs: Nastavit
el: Ρύθμιση
eo: Agordi
es: Configurar
fr: Configurer
pt: Configurar
sl: Nastavi
uk: Налаштувати

source: Sorting options
cs: Nastavení řazení
el: Επιλογές ταξινόμησης
es: Opciones de clasificación
fr: Options de classement
pt: Opções de organização
sl: Možnosti razvrščanja
uk: Параметри впорядкування

source: Unsorted
cs: Neseřazeno
el: Αταξινόμητο
es: Sin ordenar
fr: Aucun classement
pt: Não ordenar
sl: Nerazvrščeno
uk: Невпорядковано

source: Sort applications by local rating
cs: Seřadit podle lokální oblíbenosti
el: Ταξινόμηση εφαρμογών κατά τοπική εκτίμηση
es: Clasificar aplicaciones por índice local
fr: Classer les applications selon l'évaluation locale
pt: Ordenar aplicações por avaliação
sl: Razvrsti programe po krajevni oceni
uk: Впорядкувати програми за рейтингом

source: Sort applications by overall popularity
cs: Seřadit podle celkové oblíbenosti
el: Ταξινόμηση εφαρμογών κατά γενική δημοτικότητα
es: Clasificar aplicaciones por popularidad total
fr: Classer les applications selon la popularité générale
pt: Ordenar aplicações por popularidade
sl: Razvrsti programe po splošni priljubljenosti
uk: Впорядкувати програми за використанням

source: Create new Launcher source
cs: Vytvořit nový zdroj spouštěče
el: Δημιουργία νέας πηγής εκκινητή
fr: Créer une nouvelle source pour le lanceur
pt: Criar nova fonte do Lançador
sl: Ustvari nov vir zaganjalnika
uk: Додати нове джерело пускача

source: Enter a name for this new source:
cs: Zadejte jméno pro tento zdroj:
el: Εισάγετε όνομα για τη νέα πηγή:
eo: Enigi nomon por tiu nova fonto:
es: Escriba un nombre para este nuevo origen:
fr: Entrer un nom pour cette nouvelle source :
pt: Indique o nome para esta fonte:
sl: Vnesi ime za ta novi vir:
uk: Уведіть назву нового джерела:

source: You requested to delete "%s".<br><br>Are you sure you want to delete this bar source?
cs: Zadali jste smazat "%s".<br><br>Opravdu to chcete udělat?
eo: Vi petis forviŝi "%s".<br><br>Ĉu vi certas ke vi volas forviŝi tiun bar-fonton ?
es: Ha seleccionado borrar «%s».<br><br>¿Está seguro de querer borrar la fuente de esta barra?
fr: Vous avez demandé à supprimer « %s ».<br><br>Voulez-vous vraiment supprimer cette source ?
pt: Solicitou a eliminação de "%s".<br><br>Tem a certeza que quer apagar esta fonte?
sl: Zahtevali ste izbris:·"%s".<br><br>Ali ste prepričani da hočete izbrisati ta vir vrstice?
uk: Вам потрібно вилучити «%s».<br><br>Вилучити це джерело панелі?

source: Are you sure you want to delete this bar source?
cs: Opravdu chcete smazat tento zdroj lišty?
el: Είστε σίγουροι για τη διαγραφή αυτής της πηγής μπάρας
eo: Ĉu vi certas, ke vi deziras forviŝi tiun bar-fonton ?
es: ¿Está seguro de querer borrar la fuente de esta barra?
fr: Voulez-vous vraiment supprimer cette source ?
pt: Tem a certeza que quer apagar esta fonte?
sl: Ali ste prepričani da hočete izbrisati ta vir vrstice
uk: Вилучити це джерело панелі?

source: List settings
cs: Nastavení seznamu
es: Configuraciones de la lista
fr: Paramétrage de la liste
pt: Definições da lista
sl: Nastavitev seznamov
uk: Перелік налаштувань

source: Drawer Plugin : List
cs: Drawer Modul : Seznam
es: Complemento cajón: Lista
fr: Greffon de Tiroir : liste
pt: "Plugin" Drawer: Lista
sl: Vtičnik predalnika·:·Seznam
uk: Шухляда : перелік

source: Item size options
cs: Možnosti velikosti položky
es: Opciones de tamaño de elemento
fr: Taille de l'élément
pt: Opções do tamanho do item
sl: Nastavitev velikosti predmetov
uk: Параметри розміру пунктів

source: Large
cs: Velký
es: Grande
fr: Grand
pt: Grande
sl: Široko
uk: Великий

source: Medium
cs: Střední
es: Medio
fr: Moyen
pt: Médio
sl: Srednje
uk: Середній

source: Small
cs: Malý
es: Pequeño
fr: Petit
pt: Pequeno
sl: Majhno
uk: Маленький
