Repository: kakaroto/e17
Catalog: E-MODULES-EXTRA/wlan/po/*.po
Languages: ar, uk

source: Wlan Settings
ar: إعدادات الشبكة اللاسلكية
uk: Налаштування

source: General Settings
ar: اﻹعدادات العامة
uk: Загальні налаштування

source: Always Show Text
ar: اعرض النص دائماً
uk: Постійно показувати текст

source: Show Text On Mouse Over
ar: اعرض النص عند مرور الفأرة
uk: Показувати текст лише при піднесенні курсора миші

source: Show Text As Percent
ar: أعرض النص كنسبة
uk: Показувати текст у відсотках

source: Check Interval:
ar: الفاصل الزمني للفحص :
uk: Проміжок перевірки:

source: %1.0f seconds
ar: %1.0f ثوان
uk: %1.0f секунд

source: Device Settings
ar: إعدادات الجهاز
uk: Налаштування пристрою

source: Wlan
ar: الشبكة اللاسلكية (Wlan)
uk: Локальна мережа

source: Settings
ar: اﻹعدادات
uk: Налаштування
