Repository: kakaroto/e17
Catalog: E-MODULES-EXTRA/alarm/po/*.po
Languages: ar, cs, de, he, it, ja, ko, pl, zh_cn

source: Alarm Configuration
ar: إعدادات المنبه
cs: Nastavení alarmu
de: Alarm Konfiguration
he: תצורת התזכורות
it: Configurazione di Alarm
ja: アラームの設定
ko: 알람 구성
pl: Konfiguracja alarmu
zh_cn: 闹钟配置

source: Alarm
ar: المنبه
he: תזכורת
ja: アラーム
ko: 알람
zh_cn: 闹钟

source: Active
ar: نشيط
cs: Aktivní
de: Aktive
he: פעיל
it: Attiva
ja: 作動
ko: 활성
pl: Aktywny
zh_cn: 启用

source: Add
ar: إضافة
cs: Přidat
de: Hinzufügen
he: הוסף
it: Aggiungi
ja: 追加
ko: 추가
pl: Dodaj
zh_cn: 添加

source: Delete
ar: حذف
cs: Smazat
de: Entfernen
he: מחק
it: Cancella
ja: 削除
ko: 삭제
pl: Usuń
zh_cn: 删除

source: Configure
ar: إضبط
cs: Konfigurovat
de: Konfigurieren
he: הגדר
it: Configura
ja: 設定
ko: 구성
pl: Konfiguruj
zh_cn: 配置

source: Duplicate
ar: كرر
cs: Duplikovat
de: Vervielfältigen
he: שכפל
it: Duplica
ja: コピー
ko: 복제
pl: Zduplikuj
zh_cn: 创建副本

source: Alarm Options
ar: إعدادات المنبه
cs: Volby alarmu
de: Alarm Optionen
he: אפשרויות התזכורת
it: Opzioni di Alarm
ja: アラームオプション
ko: 알람 옵션
pl: Ustawienia alarmu
zh_cn: 闹钟选项

source: Show next alarm
ar: اعرض المنبه التالي
cs: Zobrazit další alarm
de: Nächsten Alarm zeigen
he: הצגת התזכורת הבאה
it: Mostra prossimo allarme
ja: 次のアラームを表示
ko: 다음 알람 보이기
pl: Pokaż dalszy alarm
zh_cn: 显示下一个闹钟

source: Alarms Defaults
ar: إفتراضيات المنبه
cs: Výchozí alarmy
de: Standart Alarm
he: ברירות המחדל של התזכורות
it: Valori predefiniti opzioni
ja: アラームのデフォルト
ko: 알람 기본값
zh_cn: 闹钟默认设置

source: Open popup
ar: افتحت نافذة منبثقة
cs: Otevřít popup
de: Ein Popup öffnen
he: פתח חלונית מוקפצת
it: Apri popup
ja: ポップアップを表示する
ko: 팝업 열기
pl: Otwórz okno
zh_cn: 打开气泡

source: Run program
ar: شغّل برنامج
cs: Spustit program
de: Program starten
he: הפעל תוכנית
it: Avvia programma
ja: プログラムを実行する
ko: 프로그램 실행
pl: Uruchom program
zh_cn: 运行程序

source: Auto-Remove alarms
ar: إزالة تلقائية للمنبهات
cs: Automaticky smazat alarmy
de: Alarm automatisch wiederholen
he: הסר תזכורות אוטומטית
it: Rimuovi allarmi automaticamente
ja: アラームを自動削除する
ko: 자동으로 알람 제거
pl: Automatycznie usuwaj alarmy
zh_cn: 自动移除闹钟

source: Alarm Configuration : Setup an alarm
ar: تكوينات المنبه : اضبط منبها
cs: Nastavení alarmu: Nastavit alarm
de: Alarm konfigurieren: Einen Alarm einrichten
he: תצורת התזכורות : הגדרת תזכורת
it: Configurazione di Alarm: impostare un allarme
ja: アラームの設定: アラームを指定する
ko: 알람 구성 : 알람을 설정
pl: Konfiguracja alarmu: włącz alarm
zh_cn: 闹钟设置：设定一个闹铃

source: Informations
ar: معلومات
cs: Informace
de: Informationen
he: פריטי מידע
it: Informazioni
ja: 情報
ko: 정보
pl: Informacje
zh_cn: 提示信息

source: Name
ar: اﻹسم
cs: Jméno
he: שם
it: Nome
ja: 名称
ko: 이름
pl: Nazwa
zh_cn: 名称

source: Description
ar: الوصف
cs: Popis
de: Beschreibung
he: תיאור
it: Descrizione
ja: 説明
ko: 설명
pl: Opis
zh_cn: 描述

source: Schedule
ar: جدول
cs: Rozvrh
de: Anhang
he: תזמון
it: Programmazione
ja: スケジュール
ko: 일정
pl: Harmonogram
zh_cn: 日程表

source: %1.0f hour
ar: %1.0f ساعة
cs: %1.0f hodin
de: %1.0f Stunden
he: שעה %1.0f
it: Ore %1.0f
ja: %1.0f 時
ko: %1.0f 시
pl: %1.0f godzina
zh_cn: %1.0f 小时

source: %1.0f minute
ar: %1.0f ثانية
cs: %1.0f minut
de: %1.0f Minuten
he: דקה %1.0f
it: Minuti %1.0f
ja: %1.0f 分
ko: %1.0f 분
pl: %1.0f minuta
zh_cn: %1.0f 分钟

source: Days of the week
ar: أيام اﻷسبوع
cs: Dny v týdnu
de: Wochentage
he: ימי השבוע
it: Giorni della settimana
ja: 毎週
ko: 주의 첫날
pl: Dni tygodnia
zh_cn: 每周天数

source: Monday
ar: الاثنين
cs: Pondělí
de: Montag
he: יום שני
it: Lunedì
ja: 月曜日
ko: 월요일
pl: Poniedziałek
zh_cn: 星期一

source: Tuesday
ar: الثلاثاء
cs: Úterý
de: Dienstag
he: יום שלישי
it: Martedì
ja: 火曜日
ko: 화요일
pl: Wtorek
zh_cn: 星期二

source: Wenesday
ar: اﻷربعاء
cs: Středa
de: Mittwoch
he: יום רביעי
it: Mercoledì
ja: 水曜日
ko: 수요일
pl: Środa
zh_cn: 星期三

source: Thursday
ar: الخميس
cs: Čtvrtek
de: Donnerstag
he: יום חמישי
it: Giovedì
ja: 木曜日
ko: 목요일
pl: Czwartek
zh_cn: 星期四

source: Friday
ar: الجمعة
cs: Pátek
de: Freitag
he: יום שישי
it: Venerdì
ja: 金曜日
ko: 금요일
pl: Piątek
zh_cn: 星期五

source: Saturday
ar: السبت
cs: Sobota
de: Samstag
he: יום שבת
it: Sabato
ja: 土曜日
ko: 토요일
pl: Sobota
zh_cn: 星期六

source: Sunday
ar: اﻷحد
cs: Neděle
de: Sonntag
he: יום ראשון
it: Domenica
ja: 日曜日
ko: 일요일
pl: Niedziela
zh_cn: 星期日

source: One day
ar: يوم واحد
cs: Jeden den
de: Ein Tag
he: יום אחד
it: Giornata singola
ja: 指定日のみ
ko: 하루
pl: Jeden dzień
zh_cn: 一天

source: Date (YYYY/MM/DD)
ar: التاريخ (YYYY/MM/DD)
cs: Datum (RRRR/MM/DD)
de: Datum (JJJJ/MM/TT)
he: תאריך (YYYY/MM/DD)
it: Data (AAAA/MM/GG)
ja: 日付 (年/月/日)
ko: 날짜(YYYY/MM/DD)
pl: Data (RRRR/MM/DD)
zh_cn: 日期(年年年年/月月/日日)

source: Today
ar: اليوم
cs: Dnes
de: Heute
he: היום
it: Oggi
ja: 今日
ko: 오늘
pl: Dzisiaj
zh_cn: 今日

source: Tomorrow
ar: غدًا
cs: Zítra
de: Morgen
he: מחר
it: Domani
ja: 明日
ko: 내일
pl: Jutro
zh_cn: 明天

source: <hilight>Error, The alarm was not added !</hilight><br><br>There is an error in the informations / schedule of your alarm
ar: <hilight>خطأ ، المنبه لم يضف !</hilight><br><br>كن هنالك خطأ في معلومات / جدولة المنبه
cs: <hilight>Chyba, alarm nebyl přidán !</hilight><br><br>Máte chybu v informacích / rozvrhu vašeho alarmu
de: <hilight>Fehler, der Alarm konnte nicht hinzugefügt werden!</hilight><br><br>Es gibt einen Fehler in den Details / im Termin des Alarmes
he: <hilight>שגיאה, התזכורת לא נוספה !</hilight><br><br>ישנה שגיאה בפרטי המידע / תזמון התזכורת שלך
it: <hilight>Errore, l'allarme non è stato aggiunto!</hilight><br><br>C'è un errore nelle informazioni/scadenze del vostro allarme.
ja: <hilight>エラーのため, アラームは追加されません.</hilight><br><br>アラームの情報かスケジュールにエラーがあります.
ko: <hilight>오류, 알람이 추가되지 못했습니다 !</hilight><br><br>정보에 오류가 있습니다 / 알람의 일정
pl: <hilight>Błąd, alarm nie był dodany !</hilight><br><br>Wystąpił błąd w informacjach / harmonogramu twojego alarmu
zh_cn: <hilight>错误，没有添加此闹铃！</hilight><br><br>你提供的信息或者计划有误。

source: <hilight>Error, The alarm was not added !</hilight><br><br>You have to enter a name for the alarm
ar: <hilight>خطأ ، المنبه لي يضف !</hilight><br><br>يتوجب عليك إدخال إسم للمنبه
cs: <hilight>Chyba, alarm nebyl přidán !</hilight><br><br>Musíte zadat jméno.
de: <hilight>Fehler, der Alarm konnte nicht hinzugefügt werden!</hilight><br><br>Bitte geben Sie einen Namen für den Alarm an
he: <hilight>שגיאה, התזכורת לא נוספה !</hilight><br><br>עליך להזין שם לתזכורת
it: <hilight>Errore, l'allarme non è stato aggiunto!</hilight><br><br>Occorre inserire un nome per l'allarme.
ja: <hilight>エラーのため, アラームは追加されません.</hilight><br><br>アラームには名前を付けてください.
ko: <hilight>오류, 알람이 추가되지 못했습니다 !</hilight><br><br>알람의 이름을 입력하십시오
pl: <hilight>Błąd, alarm nie był dodany !</hilight><br><br>Musisz podać nazwę alarmu
zh_cn: <hilight>错误，没有添加此闹铃！</hilight><br><br>你必须设定一个名称

source: <hilight>Error, The alarm was not added !</hilight><br><br>You have to select at least one day in the week
ar: <hilight>خطأ ، المنبه لم يضف !</hilight><br><br>يتوجب عليك إختيار يوم في اﻷسبوع على اﻷقل
cs: <hilight>Chyba, alarm nebyl přidán !</hilight><br><br>Musíte vybrat alespoň jeden den z týdnu
de: <hilight>Fehler, der Alarm konnte nicht hinzugefügt werden!</hilight><br><br>Sie müssen mindestens einen Wochentag auswählen
he: <hilight>שגיאה, התזכורת לא נוספה !</hilight><br><br>יהיה עליך לבחור לפחות יום אחד בשבוע
it: <hilight>Errore, l'allarme non è stato aggiunto!</hilight><br><br>Occorre selezionare almeno un giorno della settimana.
ja: <hilight>エラーのため, アラームは追加されません.</hilight><br><br>週のうち、少なくとも一日は指定してください.
ko: <hilight>오류, 알람이 추가되지 못했습니다 !</hilight><br><br>주중 하루 이상을 선택하십시오
pl: <hilight>Błąd, alarm nie był dodany !</hilight><br><br>Musizs wybrać przynajmniej jeden dzień tygodnia
zh_cn: <hilight>错误，没有添加此闹铃！</hilight><br><br>你必须选择响铃的日子

source: <hilight>Error, The alarm was not added !</hilight><br><br>The date you entered for the alarm has incorrect syntax<br><br>You have to respect this format :<br> YYYY/MM/DD<br>YYYY is the year on 4 numbers<br>MM is the month on 2 numbers<br>DD is the day on 2 numbers<br>
ar: <hilight>خطأ ،المنبه لم يضف !</hilight><br><br>التاريخ الذي أدخلته للمنبه يخالف النسق المتبع<br><br>يجب أن تتبع هذه الصيغة :<br> سنة/شهر/يوم<br>حيث ( سنة ) تتكون من 4 أرقام<br>( شهر ) يتكون من رقمين<br>( يوم ) كذلك يتكون من رقمين<br>
cs: <hilight>Chyba, alarm nebyl přidán !</hilight><br><br>Datum má špatnou syntaxi.<br><br>Musíte dodržovat tento formát :<br> RRRR/MM/DD<br>RRRR je rok o čtyřech číslech.<br>MM měsíc o dvou číslech.<br>DD je den také o dvou číslech.<br>
de: <hilight>Fehler, der Alarm konnte nicht hinzugefügt werden!</hilight><br><br>Fehlerhafte Syntax des eingegeben Alarms<br><br>Sie müssen folgendes Format benutzen:<br> JJJJ/MM/TT<br>JJJJ ist das Jahr in vier Ziffern<br>MM ist der Monat in vier Ziffern<br>TT ist der Tag in zwei Ziffern<br>
he: <hilight>שגיאה, התזכורת לא נוספה!</hilight><br><br>מבנה התאריך שהזנת שגוי<br><br>עליך לכבד את צורת הכתיבה :<br> YYYY/MM/DD<br>YYYY מייצג את השנה ב־4 ספרות <br>MM מייצג את החודש ב־2 ספרות<br>DD מייצג את היום ב־2 ספרות<br>
it: <hilight>Errore, l'allarme non è stato aggiunto!</hilight><br><br>La data inserita per l'allarme ha la sintassi sbagliata<br><br>Occorre rispettare questo formato:<br> AAAA/MM/GG<br>AAAA è l'anno in 4 cifre<br>MM è il mese in 2 cifre<br>DD è il giorno in 2 cifre<br>
ja: <hilight>エラーのため、アラームは追加されません.</hilight><br><br>指定したアラームの日付は書式に誤りがあります.<br><br>以下の書式に合わせてください.<br> YYYY/MM/DD<br>YYYYは西暦年4桁<br>MMは月2桁,<br>DDは日2桁
ko: <hilight>오류, 알람이 추가되지 못했습니다 !</hilight><br><br>입력된 날짜에 잘못된 문법이 있습니다<br><br>다음과 같은 형식임을 주의하십시오 :<br> YYYY/MM/DD<br>YYYY는 4자리 년도입니다<br>MM은 2자리 월입니다<br>DD는 2자리 일입니다<br>
zh_cn: <hilight>错误，提醒没有被添加！</hilight><br><br>你输入的日期格式有误<br><br>请按以下格式输入：br> 年年年年/月月/日日<br>4位年<br>2位月<br>2位日<br>

source: <hilight>Error, The alarm was not added !</hilight><br><br>The date you entered is before now
ar: <hilight>خطأ ، المنبه لم يضف !</hilight><br><br>التاريخ الذي أدخلته يسبق تاريخ اليوم
cs: <hilight>Chyba, alarm nebyl přidán !</hilight><br><br>Datum je menší než je aktuální datum.
de: Copy text <hilight>Fehler, der Alarm wurde nicht gestellt !</hilight><br><br>Das eingegebene Datum ist vergangen.
he: <hilight>שגיאה, התזכורת לא נוספה !</hilight><br><br>התאריך שהזנת כבר חלף
it: <hilight>Errore, l'allarme non è stato aggiunto!</hilight><br><br>La data inserita è nel passato.
ja: <hilight>エラーのため、アラームは追加されません.</hilight>過去の日時が指定されています.
ko: <hilight>오류, 알람이 추가되지 못했습니다 !</hilight><br><br>입력된 날짜는 과거입니다
pl: <hilight>Błąd, alarm nie był dodany !</hilight><br><br>Data którą podałeś już minęła
zh_cn: <hilight>错误，提醒没有被添加！</hilight><br><br>你输入的是过去的日期

source: Alarm Module Error
ar: خطأ وحدة المنبة
cs: Chyba modulu Alarm
de: Fehler des Alarm Modules
he: שגיאה במודול התזכורות
it: Errore del modulo Alarm
ja: アラームモジュールエラー
ko: 알람 모듈 오륲
pl: Błąd modułu alarmu
zh_cn: 提醒模块错误

source: Test this alarm
ar: إفحص هذا المنبه
cs: Testovat
de: Diesen Alarm testen
he: בדוק תזכורת זו
it: Prova quest'allarme
ja: このアラームを試す
ko: 알람 검사
pl: Przetestuj ten alarm
zh_cn: 对当前的提醒进行测试

source: Ring Options
ar: إعدادات الرنين
cs: Nastavení zvuku
he: אפשרויות צלצול
it: Opzioni dell'allarme
ja: 通知オプション
ko: 울림 옵션
pl: Opcje dzwonka
zh_cn: 铃声选项

source: Remove alarm
ar: إزالة المنبه
cs: Odstranit
de: Alarm löschen
he: הסר תזכורת
it: Rimuovi allarme
ja: アラームを削除する
ko: 알람 제거
pl: Usuń alarm
zh_cn: 删除提醒

source: No [default]
ar: لا [افتراضي]
cs: Ne [výchozí]
de: Nein (Vorgabe)
he: לא [ברירת מחדל]
it: No [predefinito]
ja: いいえ [デフォルト]
ko: 아니오 [기본값]
pl: Nie [standardowo]
zh_cn: 无[默认值]

source: Yes
ar: نعم
cs: Ano
de: Ja
he: כן
it: Sì
ja: はい
ko: 예
pl: Tak
zh_cn: 是

source: No
ar: لا
cs: Ano
de: Nein
he: לא
ja: いいえ
ko: 아니오
pl: Nie
zh_cn: 否

source: Yes [default]
ar: نعم [افتراضي]
cs: Ne [výchozí]
de: Ja (Vorgabe)
he: כן [ברירת מחדל]
it: Sì [predefinito]
ja: はい [デフォルト]
ko: 예 [기본값]
pl: Tak [standardowo]
zh_cn: 是[默认值]

source: Run a program
ar: شغل برنامجا
cs: Spustit program
de: Ein Programm ausführen
he: הפעל תוכנית
it: Avvia un programma
ja: プログラムを実行する
ko: 프로그램 실행
pl: Uruchom program
zh_cn: 运行程序

source: Run default one
ar: شغل اﻹفتراضي
cs: Spustit výchozí
he: הפעל את תוכנית ברירת המחדל
it: Avvia il predefinito
ja: デフォルトのプログラムを実行する
ko: 기본값 실행
pl: Uruchom standardowy
zh_cn: 运行默认的

source: Run this program
ar: شغل هذا البرنامج
cs: Spustit tento program
de: Diesen Program ausführen
he: הפעל תוכנית זו
it: Avvia questo programma
ja: プログラムを実行する
ko: 이 프로그램 실행
pl: Uruchom ten program
zh_cn: 运行这个程序

source: <hilight>Alarm test SUCCEED !</hilight><br><br>But DONT FORGET to ACTIVATE the alarms<br>via the 'Active' check button on the<br>main Alarm configuration panel.
ar: <hilight>نجح اختبار المنبه !</hilight><br><br>لكن لا تنسَ تفعيل المنبه<br>عبر زر خانة تحديد 'تفعيل' المتواجد<br>بلوحة التكوينات الرئيسية للمنبه
cs: <hilight>Test byl ÚSPĚŠNÝ !</hilight><br><br>Ale NEZAPOMEŇTE AKTIVOVAT alarmy<br>přes 'Aktivní' checkbox v<br>hlavním konfiguračním panelu alarmu.
de: <hilight>Alarmtest erfolgreich!</hilight><br><br>Vergessen Sie bitte nicht, die Alarme<br>trotzdem über den 'Aktiv' Knopf im<br>Haupteingabefeld für Alarme zu aktivieren.
he: <hilight>התזכורת הנסיונית הצליחה !</hilight><br><br>אך לבל תשכח להפעיל את התזכורות<br>דרך לחצן הסימון 'פעיל' תחת לוח<br>תצורת התזכורות הראשי.
it: <hilight>Test allarme RIUSCITO!</hilight><br><br>Ma NON DIMENTICATE di ATTIVARE gli allarmi<br>tramite la casella di opzione "Attiva" nel<br>pannello di configurazione di Alarm.
ja: <hilight>アラームテスト成功</hilight><br><br>アラームを作動させるのを忘れずに！<br>アラームのメイン設定パネルにある<br>「作動」チェックボタンをチェックしてください.
ko: <hilight>알람 검사 성공 !</hilight><br><br>그러나 절대로 알람을 활성화하는 것을 잊지 마십시오!<br>주 알람 구성 패널의<br>'활성' 체크 바튼을 사용하십시오.
pl: <hilight>Test alarm się UDAŁ !</hilight><br><br> Ale NIE ZAPOMNIJ AKTYWOWAĆ alarmy<br>poprzez przycisk 'Aktywuj' w<br>głównym panelu konfiguracji alarmu.
zh_cn: <hilight>提醒测试 成功！</hilight><br><br>请不要忘记开启提醒<br>操作方法：在主提醒配置面板里<br>选中“开启”选框。

source: <hilight>Alarm test SUCCEED !</hilight>
ar: <hilight>نجح اختبار المنبه !</hilight>
cs: <hilight>Test byl ÚSPĚŠNÝ !</hilight>
de: <hilight>Alarmtest erfolgreich !</hilight>
he: <hilight>התזכורת הנסיונית הצליחה!</hilight>
it: <hilight>Test allarme RIUSCITO!</hilight>
ja: <hilight>アラームテスト成功</hilight>
ko: <hilight>알람 검사 성공 !</hilight>
pl: <hilight>Test alarm się UDAŁ !</hilight>
zh_cn: <hilight>提醒测试 成功！</hilight>

source: <hilight>Alarm test FAILED !</hilight>
ar: <hilight>فشل اختبار المنبه !</hilight>
cs: <hilight>Test SELHAL !</hilight>
de: <hilight>Alarmtest fehlgeschlagen !</hilight>
he: <hilight>התזכורת הנסיונית נכשלה !</hilight>
it: <hilight>Test allarme FALLITO!</hilight>
ja: <hilight>アラームテスト失敗</hilight>
ko: <hilight>알람 검사 실패 !</hilight>
pl: <hilight>Test alarm się NIEUDAŁ !</hilight>
zh_cn: <hilight>提醒测试 失败！</hilight>

source: Alarm Module Test Report
ar: تقرير اختبار وحدة المنبه
cs: Testovací report modulu
de: Alarm Modul Testbericht
he: רישום נסיונות מודול התזכורות
it: Rapporto test modulo Alarm
ja: eveilモジュールテスト結果
ko: 알람 모듈 검사 보고서
pl: Raport test modułu alarmu
zh_cn: 提醒模块测试报告

source: <hilight>Alarm : %s</hilight><br><br>%s
ar: <hilight>المنبه : %s</hilight><br><br>%s
he: <hilight>תזכורת : %s</hilight><br><br>%s
it: <hilight>Allarme: %s</hilight><br><br>%s
ja: <hilight>アラーム: %s</hilight><br><br>%s
ko: <hilight>알람 : %s</hilight><br><br>%s

source: Alarm Module Popup
ar: منبثقة وحدة المنبه
cs: Popup alarm modulu
he: חלונית מוקפצת של מודול התזכורות
it: Popup modulo Alarm
ja: アラームモジュールポップアップ
ko: 알람 모듈 팝업
pl: Okno modułu alarmu
zh_cn: 提醒模块弹出框

source: <hilight>Failed !</hilight><br><br>Alarm couln't launch the program you specified
ar: <hilight>فشل !</hilight><br><br>لا يستطيع المنبه بدء البرنامج الذي حددته
cs: <hilight>Chyba !</hilight><br><br>Nemůžu spustit zadaný program.
de: <hilight>Fehler !</hilight><br><br>Alarm konnte das ausgewählte Program nicht starten
he: <hilight>נכשלה !</hilight><br><br>התזכורת לא הצליחה להפעיל את התוכנה שציינת
it: <hilight>Fallito!</hilight><br><br>L'allarme non ha potuto lanciare il comando specificato.
ja: <hilight>失敗</hilight><br><br>指定されたプログラムが起動できませんでした.
ko: <hilight>실패 !</hilight><br><br>알람은 지정된 프로그램을 실행시킬 수 없었습니다.
zh_cn: <hilight>失败！</hilight><br><br>提醒不能启动你指定的程序

source: Snooze %s
ar: غفوة %s
cs: Dřímat %s
de: Schlummern %s
he: השהיית %s
it: Rinvia %s
ja: スヌーズ %s
ko: 스누즈 %s
pl: Wyciszenie %s

source: %1.0f hours
ar: %1.0f ساعة/ساعات
cs: %1.0f hodin
de: %1.0f Stunde(n)
he: %1.0f שעות
it: %1.0f ore
ja: %1.0f 時間
ko: %1.0f 시간
pl: %1.0f godzin

source: %1.0f minutes
ar: %1.0f دقيقة/دقائق
cs: %1.0f minut
he: %1.0f דקות
it: %1.0f minuti
ja: %1.0f 分
ko: %1.0f 분
pl: %1.0f minut
zh_cn: %1.0f 分钟

source: Ok
ar: حسناً
he: אישור
ko: 확인
zh_cn: 确定

source: Close
ar: إغلاق
cs: Zavřít
he: סגור
it: Chiudi
ja: 閉じる
ko: 닫기
pl: Zamknij
zh_cn: 关闭

source: Snooze %.14s of %.2d:%.2d
ar: غفوة %.14s من %.2d:%.2d
cs: Dřímat %.14s z %.2d:%.2d
de: Schlummern %.14s of %.2d:%.2d
he: השהיית %.14s מתוך %.2d:%.2d
it: Rinvia %.14s di %.2d:%.2d
ja: スヌーズ: %.14s (%.2d:%.2d)
ko: 스누즈 %.14s - %.2d:%.2d
pl: Wyciszenie %.14s z %.2d:%.2d

source: Snooze (No alarm to delay)
ar: الغفوة ( دون تنبيه للتأخير )
cs: Dřímat (žádný alarm)
de: Schlummern (kein Alarm zum Verschieben)
he: השהייה (אין תזכורות להשהייה)
it: Rinvio (nulla da rinviare)
ja: スヌーズ (遅らせるアラーム無し)
ko: 스누즈 (더 이상 연기할 수 없음)
pl: Wyciszenie (żaden alarm do przesunięcia)
zh_cn: 打盹（没有提醒需要延迟）

source: Add an alarm
ar: أضف منبه
cs: Přidat alarm
de: Einen Alarm hinzufügen
he: הוסף תזכורת
it: Aggiungi allarme
ja: アラームを追加する
ko: 알람 추가
pl: Dodaj alarm
zh_cn: 添加提醒

source: Settings
ar: اﻹعدادات

source: <hilight>Alarm module : Configuration Upgraded</hilight><br><br>Your configuration of alarm module<br>has been upgraded<br>Your settings and alarms were removed<br>Sorry for the inconvenience<br><br>(%d -> %d)
ar: <hilight>وحدة المنبه : رُقيت التكوينات</hilight><br><br>تكويناتك لوحدة المنبه<br>رُقيت<br>إعداداتك و كذلك المنبهات أُزيلت<br>نأسف ﻹزعاجك<br><br>(%d -> %d)
cs: <hilight>Alarm modul : Konfigurace aktualizována</hilight><br><br>Vaše konfigurace<br>byla aktualizována.<br>Vaše nastavení bylo odebráno.<br>Omlouváme se za vzniklé potíže.<br><br>(%d -> %d)
he: <hilight>מודול התזכורות : התצורה שודרגה</hilight><br><br>תצורת מודול התזכורות שלך<br>שודרגה<br>ההגדרות והתזכורות שלך הוסרו<br>סליחה על אי הנעימות<br><br>(%d -> %d)
it: <hilight>Modulo Alarm: aggiornamento configurazione</hilight><br><br>La vostra configurazione del modulo Alarm è<br>stata aggiornata. Le vostre impostazioni e i<br>vostri allarmi sono stati cancellati. Ci scusiamo<br>per l'inconveniente<br><br>(%d -> %d)
ja: <hilight>アラームモジュール: 設定が更新されました.</hilight><br><br>アラームモジュールの設定が更新されました.<br>そのため設定内容とアラームは削除されました.<br>ご了承下さい.<br><br>(%d -> %d)
ko: <hilight>알람 모듈 : 구성 업그레이드됨</hilight><br><br>알람 모듈의 구성이<br>업그레이드되었습니다<br>설정과 알람이 모두 제거되었습니다<br>불편을 드려 죄송합니다<br><br>(%d -> %d)
pl: <hilight>Moduł alarmu : konfiguracja zaktualizowana</hilight><br><br>Twoja konfiguracja modułu alarmu<br>była zaktualizowana<br>Twoje ustawienia i alarmy były usunięte<br>Przeprasamy za niedogodności<br><br>(%d -> %d)
zh_cn: <hilight>提醒模块：配置已升级</hilight><br><br>你的提醒模块的配置<br>已升级<br>你的设置和提醒已被删除<br>很抱歉给您带来不便<br><br>(%d ->%d)

source: Alarm Module version
ar: إصدارة وحدة المنبه
cs: Verze modulu
de: Version des Alarm Moduls
he: מודול התזכורות גירסה
it: Modulo Alarm versione
ja: アラームモジュールのバージョン
ko: 알람 모듈 버전
pl: Wersja modułu alarmu
zh_cn: 提醒模块版本

source: <hilight>Alarm module : Configuration Downgraded</hilight><br><br>Your configuration of Alarm module<br>has been downgraded<br>Your settings and alarms were removed<br>Sorry for the inconvenience<br><br>(%d ->%d)
ar: <hilight>وحدة المنبه : التكوينات تم خفضها</hilight><br><br>تكويناتك لوحدة المنبه<br>تم خفضها<br>إعداداتك و كذلك المنبهات أُزيلت<br>نأسف ﻹزعاجك<br><br>(%d ->%d)
cs: <hilight>Alarm modul : Konfigurace degradována</hilight><br><br>Vaše konfigurace modulu<br>byla degradována.<br>Vaše nastavení a alarmy byly smazány.<br>Omlováme se za vzniklé potíže.<br><br>(%d ->%d)
he: <hilight>מודול התזכורות : גירסת התצורה נסוגה</hilight><br><br>גרסת תצורת מודול התזכורות שלך<br>נסוגה<br>ההגדרות והתזכורות שלך הוסרו<br>סליחה על אי הנעימות<br><br>(%d ->%d)
it: <hilight>Modulo Alarm: ripristino configurazione</hilight><br><br>La vostra configurazione del modulo Alarm è<br>stata ripristinata. Le vostre impostazioni e i<br>vostri allarmi sono stati cancellati. Ci scusiamo<br>per l'inconveniente<br><br>(%d -> %d)
ja: <hilight>アラームモジュール: 古い設定に戻っています.</hilight><br><br>アラームモジュールの設定が古い設定に戻っています.<br>そのため設定内容とアラームは削除されました.<br>ご了承下さい.<br><br>(%d ->%d)
ko: <hilight>알람 모듈 : 구성 다운그레이드됨</hilight><br><br>알람 모듈의 구성이<br>업그레이드되었습니다<br>설정과 알람이 모두 제거되었습니다<br>불편을 드려 죄송합니다<br><br>(%d -> %d)
pl: <hilight>Moduł alarmu : konfiguracja dezaktualizowana</hilight><br><br>Twoja konfiguracja modułu alarmu<br>była dezaktualizowana<br>Twoje ustawienia i alarmy były usunięte<br>Przeprasamy za niedogodności<br><br>(%d -> %d)
zh_cn: <hilight>提醒模块：配置已降级</hilight><br><br>你的提醒模块的配置<br>已降级<br>你的设置和提醒已被删除<br>很抱歉给您带来不便<br><br>(%d ->%d)

source: Configuration
cs: Konfigurace
de: Einstellungen
he: תצורה
it: Configurazione di Alarm
ja: 設定
ko: 구성
pl: Konfiguracja
zh_cn: 配置
