Repository: kakaroto/e17
Catalog: E-MODULES-EXTRA/comp-scale/po/*.po
Languages: fr, it, pt, sl

source: Scale Windows Module
fr: Module Comp-scale
it: Modulo Scale
pt: Módulo de escala das janelas
sl: Modul Spremeni merilo okna

source: Current Desktop
fr: Bureau actuel
it: Desktop attuale
pt: Área de trabalho atual
sl: Trenutno namizje

source: Minimum space between windows
fr: Espace minimum entre les fenêtres
it: Spazio minimo tra le finestre
pt: O espaço mínimo entre as janelas
sl: Najmanjši prostor med okni

source: Scale duration
fr: Durée de la réduction
it: Durata scalatura
pt: Duração
sl: Trajanje spremembe merila

source: Slotted Layout
fr: Disposition contrainte
it: Disposizione in griglia
pt: Disposição em ranhuras
sl: Režasti iygled

source: Natural Layout
fr: Disposition naturelle
it: Disposizione naturale
pt: Disposição normal

source: Grow more!
fr: Plus d'ampleur !
it: Espandi
pt: Ampliar!
sl: Zrasti!

source: Keep it tight!
fr: Bien resserré !
it: Mantieni compatte
pt: Ajustar!
sl: Ohrani tesno!

source: Show iconified windows
fr: Afficher les fenêtres minimisées
it: Mostra finestre iconificate
pt: Mostrar janelas minimizadas

source: Show All Desktops
fr: Afficher tous les bureaux
it: Mostra tutti i desktop
pt: Mostrar todas as áreas de trabalho
sl: Prikaži vsa namizja

source: Fade in windows
fr: Ouverture en fondu des fenêtres
it: Apri finestre in dissolvenza
pt: Janelas aparecem gradualmente
sl: Pojavljajoča okna

source: Fade out shelves and popups
fr: Fermeture en fondu des racks et pop-up
it: Chiudi mensole e popup in dissolvenza
pt: Painéis e alertas desaparecem gradualmente
sl: Pojemanje polic in pojavnih oken

source: Darken desktop
fr: Assombrir le bureau
it: Oscura desktop
pt: Área de trabalho mais escura
sl: Zatemni namizje

source: Pager Settings
fr: Paramétrage du Pager
it: Impostazioni del pager
pt: Definições do paginador

source: Zoom duration
fr: Durée du zoom
it: Durata dello zoom
pt: Duração da ampliação

source: Overlap Shelves
it: Sovrapponi alle mensole
pt: Cobrir painéis

source: Look
fr: Aspect
it: Aspetto
pt: Aspeto
sl: Videz

source: Composite Scale Windows
fr: Réduction composite
it: Composite - Scalatura finestre
pt: Escala de janelas compostas
sl: Kompozitiraj okna ki spreminjajo merilo

source: Scale Windows
fr: Réduction des fenêtres
it: Scala finestre
pt: Ajustar janelas
sl: Spremeni merilo okna

source: Scale Windows (All Desktops)
fr: Réduction des fenêtres (tous les bureaux)
it: Scala finestre (tutti i desktop)
pt: Ajustar janelas (todas as áreas de trabalho)

source: Scale Windows (By Class)
fr: Réduction des fenêtres (par classe)
it: Scala finestre (per classe)
pt: Ajustar janelas (por classe)

source: Select Next
fr: Sélectionner le (la) suivant(e)
it: Seleziona successiva
pt: Selecionar seguinte

source: Select Previous
fr: Sélectionner le (la) précédent(e)
it: Seleziona precedente
pt: Selecionar anterior

source: Select Next (All)
fr: Sélectionner toutes les suivantes
it: Seleziona successiva (tutte)
pt: Selecionar seguinte (tudo)

source: Select Previous (All)
fr: Sélectionner toutes les précédentes
it: Seleziona precedente (tutte)
pt: Selecionar anterior (tudo)

source: Scale Pager
fr: Réduction du Pager
it: Scala pager
pt: Escala do paginador

source: Select Left
fr: Sélection vers la gauche
it: Seleziona a sinistra
pt: Selecionar à esquerda

source: Select Right
fr: Sélection vers la droite
it: Seleziona a destra
pt: Selecionar à direita

source: Select Up
fr: Sélection vers le haut
it: Seleziona sopra
pt: Selecionar acima

source: Select Down
fr: Sélection vers le bas
it: Seleziona sotto
pt: Selecionar abaixo

source: Scale all Windows
it: Scala tutte le finestre
pt: Ajustar todas as janelas

source: Settings
fr: Configuration
it: Impostazioni
pt: Definições
sl: Nastavitve

source: Scale
fr: Comp-scale
sl: Spremeni merilo

source: Layout Options
sl: Možnosti izgleda

source: Test
sl: Testiraj

source: Desktop
sl: Namizje

source: Scale Windows / All Desktops
sl: Spremeni merilo okna·/·Vsa namizja
