Repository: kakaroto/e17
Catalog: e_modules/forecasts/po/*.po
Languages: it

source: Weather Configuration
it: Configurazione di Weather

source: Display Settings
it: Visualizzazione

source: Simple
it: Semplice

source: Detailed
it: Dettagliata

source: Poll Time
it: Tempo di campionamento

source: %2.0f minutes
it: %2.0f minuti

source: Degree Settings
it: Scala temperatura

source: Celsius
it: Centigrada

source: ICAO Code
it: Codice ICAO

source: Get your ICAO code at:
it: Ottenete il codice ICAO da:

source: Configuration
it: Configurazione

source: Enlightenment Weather Module
it: Modulo Weather di Enlightenment

source: A weather forecast module for Enlightenment
it: Un modulo per le previsioni del tempo per Enlightenment.
