Repository: kakaroto/e17
Catalog: E-MODULES-EXTRA/emu/po/*.po
Languages: el, es, hr, it, nl, pl

source: Window properties
el: Ιδιότητες παραθύρου
es: Propiedades de la ventana
hr: Svojstva prozora
it: Proprietà finestra
nl: Venster eigenschappen
pl: Właściwości okna

source: Window identification
el: Αναγνώριση παραθύρου
es: Identificación de la ventana
hr: Identifikacija prozora
it: Identificazione finestra
nl: Venster identificatie
pl: Identyfikacja okna

source: Title (%T)
el: Τίτλος (%T)
es: Título (%T)
hr: Naslov (%T)
it: Titolo (%T)
nl: Titel (%T)
pl: Tytuł (%T)

source: Properties
el: Ιδιότητες
es: Propiedades
hr: Svojstva
it: Proprietà
nl: Eigenschappen
pl: Właściwości

source: Position (%p)
el: Θέση (%p)
es: Posición (%p)
hr: Pozicija (%p)
it: Posizione (%p)
nl: Positie (%p)
pl: Pozycja (%p)

source: Size (%s)
el: Μέγεθος (%s)
es: Tamaño (%s)
hr: Veličina (%s)
it: Dimensione (%s)
nl: Grootte (%s)
pl: Romiar (%s)

source: Border style (%b)
el: Στύλ περιγράμματος (%b)
es: Estilo del borde (%b)
hr: Stil obruba (%b)
it: Stile del bordo (%b)
nl: Randstijl (%b)
pl: Styl obramowania (%b)

source: Stickiness (%p)
el: (%p)
es: Pegocidad (%p)
hr: Ljepljivost (%p)
it: Appiccicata (%p)
nl: Plakkerigheid (%p)
pl: Przyklejalność (%p)

source: Virtual desktop (%d)
el: Εικονική επιφάνεια εργασίας (%d)
es: Escritorio virtual (%d)
hr: Virtualni desktop (%d)
it: Desktop virtuale (%d)
nl: Virtueel bureaublad (%d)
pl: Wirtualny pulpit (%d)

source: Shaded state (%r)
el: Σκιασμένη κατάσταση (%r)
es: Estado sombreado (%r)
hr: Sjenčeno stanje (%r)
it: Arrotolata (%r)
nl: Geschemerde Status (%r)
pl: Zacieniowany stan (%r)

source: Fullscreen (%f)
el: Πλήρης Οθόνη (%f)
es: Pantalla completa (%f)
hr: Cijeli ekran (%f)
it: A schermo pieno (%f)
nl: Volledig Scherm (%f)
pl: Pełny ekran (%f)

source: Iconified (%i)
el: Εικονιδιοποιημένο (%i)
es: Iconificar (%i)
hr: Ikonizirano (%i)
it: Iconificata (%i)
nl: Icoonachtig (%i)

source: Window ID (%I)
el: ID Παραθύρου (%I)
es: ID de la ventana (%I)
hr: ID prozora (%l)
it: ID finestra (%I)
nl: Venster ID (%I)
pl: ID okna (%I)

source: Window name (%N)
el: Όνομα παραθύρου (%N)
es: Nombre de la ventana (%N)
hr: Naziv prozora (%N)
it: Nome finestra (%N)
nl: Venster naam (%N)
pl: Nazwa okna (%N)

source: Window class (%C)
el: Κλάση παραθύρου (%C)
es: Clase de la ventana (%C)
hr: Klasa prozora (%C)
it: Classe finestra (%C)
nl: Venster klasse (%C)
pl: Klasa okna (%C)

source: Window role (%R)
el: Ρόλος παραθύρου (%R)
es: Papel de la ventana (%R)
hr: Uloga prozora (%R)
it: Ruolo finestra (%R)
nl: Venster rol (%R)
pl: Rola okna (%R)

source: Window type (%S)
el: Τύπος παραθύρου (%S)
es: Tipo de la ventana (%S)
hr: Vrsta prozora (%S)
it: Tipo finestra (%S)
nl: Venster type (%S)
pl: Typ okna (%S)

source: Transient (%H)
es: Transitorio (%H)
hr: Privremen (%H)
it: Transitoria (%H)
nl: Vergankelijkheid (%H)
pl: Przejście (%H)

source: Layer (%l)
el: Στρώμα (%l)
es: Capa (%I)
hr: Sloj (%I)
it: Livello (%l)
nl: Laag (%I)
pl: Warstwa (%l)

source: Stickiness (%y)
el: (%y)
es: Pegocidad (%y)
hr: Ljepljivost (%y)
it: Appiccicata (%y)
nl: Plakkerigheid (%y)
pl: Przyklejalność (%y)

source: Screen zone (%z)
el: Ζώνη οθόνης (%z)
es: Zona de la pantalla (%z)
hr: Zona ekrana (%z)
it: Zona schermo (%z)
nl: Scherm zone (%z)
pl: Strefa ekranu (%z)

source: Window list skip (%w)
el: Παράκαμψη λίστας παραθύρων (%w)
es: Saltar lista de la ventana (%w)
hr: Preskok liste prozora (%w)
it: Fuori lista finestre (%w)
nl: Venster lijst overslaan (%w)
pl: Pomiń listę okien (%w)

source: Emu Configuration
el: Ρύθμιση Emu
es: Configuración de Emu
hr: Emu Konfiguracija
it: Configurazione di Emu
nl: Emu Configuratie
pl: Konfiguracja emu

source: Enlightenment Emu Module - error
el: Σφάλμα αρθρώματος Enlightenment Emu
es: Error - Modulo Emu de Enlightenement
hr: Enlightenment Emu Modul - greška
it: Modulo Emu di Enlightenment - errore
nl: Enlightenment Emu Module - fout
pl: Moduł Enlightenment Emu - błąd

source: There is no emu.
el: Δεν υπάρχει emu.
es: No hay emu.
hr: Emu ne postoji.
it: Non ci sono emu
nl: Er is geen emu.
pl: Żadne emu nie istnieje.
