Repository: kakaroto/e17
Catalog: e16/e/po/*.po
Languages: pl, tr

source: %u references remain
pl: pozostaje %u odwo³añ
tr: %u bað geriye kaldý

source: ActionClass Error!
pl: B³±d ActionClass!
tr: ActionClass hatasý!

source: There was an error running the program: %s This program could not be executed. This is because the file does not exist.
pl: Nast±pi³ b³±d przy uruchamianiu programu: %s Nie mo¿na uruchomiæ programu. Nie istnieje taki plik wykonywalny.
tr: %s uygulamasýný çalýþtýrýrken bir hata oluþtu . Bu uygulama çalýþtýrýlamadý . Zira , bu dosya yok .

source: There was an error running the program: %s This program could not be executed. This is most probably because this program is not in the path for your shell which is %s. I suggest you read the manual page for that shell and read up how to change or add to your execution path.
pl: Nast±pi³ b³±d przy uruchamianiu programu: %s Nie mo¿na uruchomiæ programu. Najprawdopodobniej program nie znajduje siê w ¿adnym z katalogów domy¶lnej ¶ciêzki wykonywalnej, która jest nastêpuj±ca: %s. Proponujê przeczytaæ stronê podrêcznika towjej pow³oki (shell), gdzie dowiesz siê, jak dodaæ katalogi do ¶cie¿ki wykonywalnej
tr: %s uygulamasýný çalýþtýrýrken bir hata oluþtu . Bu uygulama çalýþtýrýlamadý . Çoðunlukla bu hata yetersiz verilmiþ bir ´path´ veriminden dolayýdýr . Bu ´path´ þu an %s idir . Kullandýðýn komutanýn rehberine (man ..) bakýp o ´path´ verimini geniþlet .

source: There was an error running the program: %s This program could not be executed. I am unsure as to why you could not do this. The file exists, is a file, and you are allowed to execute it. I suggest you look into this.
pl: Nie mo¿na uruchomiæ programu. %s Nie jestem pewien, dlaczego nie da siê tego zrobiæ. Plik istnieje, jest plikiem i masz prawa do uruchomienia go. Proponujê zbadanie problemu.
tr: %s uygulamasýný çalýþtýrýrken bir hata oluþtu . Bu uygulama çalýþtýrýlamadý . Neden yapmadýðýmý da kestiremiyorum ! Bu dosya var ve senin çalýþtýrma hakkýn da var ?! ..

source: There was an error running the program: %s This program could not be executed. This is because the file exists, is a file, but you are unable to execute it because you do not have execute access to this file.
pl: Nast±pi³ b³±d przy uruchamianiu programu: %s Nie mo¿na uruchomiæ programu. Plik istnieje, jest plikiem, ale nie mo¿na go uruchomiæ, gdy¿ nie masz do niego praw wykonywania.
tr: %s uygulamasýný çalýþtýrýrken bir hata oluþtu . Bu uygulama çalýþtýrýlamadý . Bu uygulama var , ama senin bu uyulamayý çalýþtýrma hakkýn yok .

source: There was an error running the program: %s This program could not be executed. This is because the file is in fact a directory.
pl: Nast±pi³ b³±d przy uruchamianiu programu: %s Nie mo¿na uruchomiæ programu. Ten plik jest katalogiem.
tr: %s uygulamasýný çalýþtýrýrken bir hata oluþtu . Bu uygulama çalýþtýrýlamadý . O dosya gercek'te bir dizin .

source: There was an error running the program: %s This program could not be executed. This is because the file is not a regular file.
pl: Nast±pi³ b³±d przy uruchamianiu programu: %s Nie mo¿na uruchomiæ programu. Ten plik nie jest plikiem zwyk³ym.
tr: %s uygulamasýný çalýþtýrýrken bir hata oluþtu . Bu uygulama çalýþtýrýlamadý . Zira bu normal bir dosya deðil .

source: About Enlightenment %s
pl: O Enlightenment %s
tr: Enlightenment %s hakkýnda bilgi

source: Welcome to the
pl: Witamy w
tr: Hoþgeldin

source: OK
tr: Oldu

source: Pick the group the window will belong to:
pl: Wybierz grupê, do której bêdzie nale¿eæ okno:
tr: Pencerenin eklencek olduðu kitleyi seç :

source: There's no current group at the moment. The current group is the last one you created, and it exists until you create a new one or break the latest one. Pick another group that the window will belong to here:
pl: Nie ma w tej chwili grupy aktualnej. Ostatnio stworzona grupa jest grup± aktualn±. Istnieje ona dopóki nie stworzysz nowej, albo nie rozbijesz ostatniej. Wybierz inn± grupê, do której bêdzie nale¿eæ okno:
tr: Þu an etken olan bir kitle yok . Etken olan bit kitle son yarattýðýn kitle oluyor ve senin yeni bir kitle yaratana yada o kileyi silene kadar vardýr . Pencerenin eklenecek olduðu baþka bir kitle seç :

source: Select the group to remove the window from.
pl: Wybierz grupê, z której mam usun±æ okno.
tr: Pencerenin silnecek olduðu kitleyi seç .

source: Select the group to break
pl: Wybierz grupê, któr± mam rozbiæ
tr: Kýrýlacak kitleyi seç

source: You have been warned about the dangers of Zoom mode
pl: Ostrze¿ono Ciê przed niebezpieczeñstwami trybu Powiêkszenia
tr: Büyütme teþkilinin tehlikesine sana anlattýk gibi geliyor bana ...

source: Warning !!!
pl: Ostrze¿enie !
tr: IKAZ !!!

source: This feature is heavily reliant on a feature of your X Server called the Vid Mode Extension. This feature exists in XFree86 Servers, but is not a heavily used part of the Server and thus isn't tested much. It is possible your X Server does not deal well with being asked to switch modes quickly and it may hang, glitch, display artefacts or perhaps simply refuse to work. This is a warning and will only be displayed this one time. If your Server does not behave well then you will probably have to avoid using this feature.
pl: Ta funkcja jest jest ¶ci¶le powi±zana z funkcj± twojego X Serwera nazywan± Vid Mode Extension. Funkcja ta istnieje w serwerach XFree86, ale nie jest czêsto u¿ywana, st±d nie jest te¿ dobrze przetestowana Mo¿liwe, ¿e twój X Serwer niezbyt dobrze radzi sobie z szybkim zmienianiem trybów wy¶wietlania i mo¿e siê zawiesiæ, spowodowaæ rozb³yski ekranu, wy¶wietliæ ¶mieci, albo po prostu odmówiæ wspó³pracy To jest ostrze¿enie i zostanie ono wy¶wietlone tylko raz. Je¿eli twój serwer nie bêdzie siê dobrze zachowywa³, bêdzie prawdopodobnie trzeba zrezygnowaæ z tej funkcji
tr: Bu özellik maalessef kullanýlan XSunucusuna çok baðlýdýr ( bu özelliðin adý : "Vid Mode Extension" ) . XFree86 sunucularýnda bu özellik vardýr , ama sunucunun bu özelliði çok kullanýlmadýðý için çok fazla denetlenmemiþtir . Ihtimalen , XSunucun ekran çözümünü çabukca deðiþtirmeyi sevmez , çökebilir yada daha nice komik olaylar olabilir ( uh , ekraným Tetris'e benzedi ...) . Bu ikaz sadece tek bir def'a gösterilecektir . XSunucun bu özelliði iyice desteklemiyorsa , bu özelliði kullanmadan kaçýn !

source: Enlightenment Error
pl: B³±d Enlightenment
tr: Enlightenment hatasý

source: Ignore
pl: Zignoruj
tr: Unut

source: Restart
pl: Uruchom ponownie
tr: Yeniden baþla

source: Exit
pl: Wyj¶cie
tr: Çýk

source: Border Error!
pl: B³±d sekcji Border
tr: Kenar hatasý!

source: Button Error!
pl: B³±d sekcji Button
tr: Basma hatasý!

source: ColorModClass Error!
pl: B³±d sekcjiColorModClass
tr: ColorModClass hatasý!

source: Received Unknown Client Message. Client Name: %s Client Version: %s Message Contents: %s
pl: Odebrano nieznan± Wiadomo¶æ Klienta. Nazwa klienta: %s Wersja klienta: %s Zawarto¶æ wiadomo¶ci: %s
tr: Tanýnmayan kullanýcý iletisini aldým . Müþteri : %s Numara : %s Ileti içeriði : %s

source: E IPC Error
pl: B³±d Enlightenment IPC
tr: E IPC hatasý

source: CONFIG: ignoring extra data in "%s"
pl: Konfiguracja : pomijam nadmiarowe dane w "%s"
tr: CONFIG : "%s"'nin ekstra bilgilerini gözardý ediyorum .

source: CONFIG: missing required data in "%s"
pl: Konfiguracja : Brak wymaganych danych w "%s"
tr: CONFIG : "%s"'de gerekli bilgi yok

source: Warning: unable to determine what to do with the following text in the middle of current Text definition: %s Will ignore and continue...
pl: Ostrze¿enie: nie wiadomo, co pocz±æ z nastêpujacym tekstem wewn±trz aktualnej definicji sekcji Text: %s Zignorujê to i bêdê kontynuowaæ...
tr: Ikaz : geçerli metin anlatýmýnda bu metin bulundu : %s Bunla ne edeceðimi anlamadýðým için,bunu geçeceðim ..

source: Warning: Configuration appears to have ended before we were Done loading a text block. Outcome is likely not good.
pl: Ostrze¿enie: Wydaje siê, ¿e konfiguracja urwa³a siê zanim zakoñczono ³adowanie sekcji Text. Wynik pewnie nie jest dobry.
tr: Ikaz : Ayarlama metin bloðunun yükleminden önce bitmiþ . Sonuç hiç hoþ olmayabilir !

source: Warning: Configuration appears to have ended before we were Done loading a Slideout block. Outcome is likely not good.
pl: Ostrze¿enie: Wydaje siê, ¿e konfiguracja urwa³a siê zanim zakoñczono ³adowanie sekcji Slideout. Wynik pewnie nie jest dobry.
tr: Ikaz : Ayarlama kaydýrma bloðunun yükleminden önce bitmiþ . Sonuç hiç hoþ olmayabilir !

source: Warning: unable to determine what to do with the following text in the middle of current Control definition: %s Will ignore and continue...
pl: Ostrze¿enie: nie wiadomo, co pocz±æ z nastêpujacym tekstem wewn±trz aktualnej definicji sekcji Control: %s Zignorujê to i bêdê kontynuowaæ...
tr: Ikaz : geçerli komutanýn ortasýndaki ´%s´ metniyle alakalý ne yapacaðýmý bilmiyorum Gözardý edip , devam ediyorum ...

source: Warning: Configuration appears to have ended before we were Done loading a Control block. Outcome is likely not good.
pl: Ostrze¿enie: Wydaje siê, ¿e konfiguracja urwa³a siê zanim zakoñczono ³adowanie sekcji Control. Wynik pewnie nie jest dobry.
tr: Ikaz : Ayarlama ayar bloðunun yükleminin bitiminden önce bitirilmiþ . Sonuç iyi olmayabilir .

source: Warning: Configuration appears to have ended before we were Done loading a Menu block. Outcome is likely not good.
pl: Ostrze¿enie: Wydaje siê, ¿e konfiguracja urwa³a siê zanim zakoñczono ³adowanie sekcji Menu. Wynik pewnie nie jest dobry.
tr: Ikaz : Ayarlama mönü bloðunun yükleminin bitiminden önce bitirilmiþ . Sonuç iyi olmayabilir .

source: Warning: Configuration appears to have ended before we were Done loading a BorderPart block. Outcome is likely not good.
pl: Ostrze¿enie: Wydaje siê, ¿e konfiguracja urwa³a siê zanim zakoñczono ³adowanie sekcji BorderPart. Wynik pewnie nie jest dobry.
tr: Ikaz : Ayarlama kenar ayarlarý bloðunun yükleminin bitiminden önce bitirilmiþ . Sonuç iyi olmayabilir .

source: Warning: Configuration appears to have ended before we were Done loading a Main Border block. Outcome is likely not good.
pl: Ostrze¿enie: Wydaje siê, ¿e konfiguracja urwa³a siê zanim zakoñczono ³adowanie sekcji Main Border. Wynik pewnie nie jest dobry.
tr: Ikaz : Ayarlama ana kenarý bloðunun yükleminin bitiminden önce bitirilmiþ . Sonuç iyi olmayabilir .

source: Warning: Configuration appears to have ended before we were Done loading a Button block. Outcome is likely not good.
pl: Ostrze¿enie: Wydaje siê, ¿e konfiguracja urwa³a siê zanim zakoñczono ³adowanie sekcji Button. Wynik pewnie nie jest dobry.
tr: Ikaz : Ayarlama basma bloðunun yükleminin bitiminden önce bitirilmiþ . Sonuç iyi olmayabilir .

source: Warning: Configuration appears to have ended before we were Done loading a Desktop block. Outcome is likely not good.
pl: Ostrze¿enie: Wydaje siê, ¿e konfiguracja urwa³a siê zanim zakoñczono ³adowanie sekcji Desktop. Wynik pewnie nie jest dobry.
tr: Ikaz : Ayarlama masaüstü bloðunun yükleminin bitiminden önce bitirilmiþ . Sonuç iyi olmayabilir .

source: Easter Egg! Iconboxes aren't implemented yet.
pl: Easter Egg! Funckcja Iconbox nie jest jeszcze zaimplementowana.
tr: Nisan balýðý !!!!! Ikona kutusu þimdiye kadar yapýlmadý .

source: Warning: Configuration appears to have ended before we were Done loading an Iconbox block. Outcome is likely not good.
pl: Ostrze¿enie: Wydaje siê, ¿e konfiguracja urwa³a siê zanim zakoñczono ³adowanie sekcji Iconbox. Wynik pewnie nie jest dobry.
tr: Ikaz : Ayarlama simge kutusu bloðunun yükleminin bitiminden önce bitirilmiþ . Sonuç iyi olmayabilir .

source: Warning: Configuration appears to have ended before we were Done loading an Sound block. Outcome is likely not good.
pl: Ostrze¿enie: Wydaje siê, ¿e konfiguracja urwa³a siê zanim zakoñczono ³adowanie sekcji Sound. Wynik pewnie nie jest dobry.
tr: Ikaz : Ayarlama ses bloðunun yükleminin bitiminden önce bitirilmiþ . Sonuç iyi olmayabilir .

source: Warning: unable to determine what to do with the following text in the middle of current ActionClass definition: %s Will ignore and continue...
pl: Ostrze¿enie: nie wiadomo, co pocz±æ z nastêpujacym tekstem wewn±trz aktualnej definicji sekcji ActionClass: %s Zignorujê to i bêdê kontynuowaæ...
tr: Ikaz : Bunla ne yapacaðýmý bilemiyorum : ´%s´ Bu metine "ActionClass"ýnda rastlandý Gözardý edip, devam ediyorum ...

source: Warning: Configuration appears to have ended before we were Done loading an Action Class block. Outcome is likely not good.
pl: Ostrze¿enie: Wydaje siê, ¿e konfiguracja urwa³a siê zanim zakoñczono ³adowanie sekcji Action Class. Wynik pewnie nie jest dobry.
tr: Ikaz : Ayarlama eylemler bloðunun yükleminin bitiminden önce bitirilmiþ . Sonuç iyi olmayabilir .

source: Warning: unable to determine what to do with the following text in the middle of current ImageClass definition: %s Will ignore and continue...
pl: Ostrze¿enie: nie wiadomo, co pocz±æ z nastêpujacym tekstem wewn±trz aktualnej definicji sekcji ImageClass: %s Zignorujê to i bêdê kontynuowaæ...
tr: Ikaz : Bunla ne yapacaðýmý bilemiyorum : ´%s´ Bu metine "ImageClass"ýnda rastlandý Gözardý edip, devam ediyorum ...

source: Warning: Configuration appears to have ended before we were Done loading an ImageClass block. Outcome is likely not good.
pl: Ostrze¿enie: Wydaje siê, ¿e konfiguracja urwa³a siê zanim zakoñczono ³adowanie sekcji ImageClass. Wynik pewnie nie jest dobry.
tr: Ikaz : Ayarlama resim bloðunun yükleminin bitiminden önce bitirilmiþ . Sonuç iyi olmayabilir .

source: Warning: unable to determine what to do with the following text in the middle of current ColorModifier definition: %s Will ignore and continue...
pl: Ostrze¿enie: nie wiadomo, co pocz±æ z nastêpujacym tekstem wewn±trz aktualnej definicji sekcji Color Modifier: %s Zignorujê to i bêdê kontynuowaæ...
tr: Ikaz : Bunla ne yapacaðýmý bilemiyorum : ´%s´ Bu metine "ColorModifierClass"ýnda rastlandý Gözardý edip, devam ediyorum ...

source: Warning: Configuration appears to have ended before we were Done loading an ColorModifier block. Outcome is likely not good.
pl: Ostrze¿enie: Wydaje siê, ¿e konfiguracja urwa³a siê zanim zakoñczono ³adowanie sekcji ColorModifier. Wynik pewnie nie jest dobry.
tr: Ikaz : Ayarlama renk deðiþkenler bloðunun yükleminin bitiminden önce bitirilmiþ . Sonuç iyi olmayabilir .

source: Warning: unable to determine what to do with the following text in the middle of current ToolTip definition: %s Will ignore and continue...
pl: Ostrze¿enie: nie wiadomo, co pocz±æ z nastêpujacym tekstem wewn±trz aktualnej definicji sekcji Tooltip: %s Zignorujê to i bêdê kontynuowaæ...
tr: Ikaz : Bunla ne yapacaðýmý bilemiyorum : ´%s´ Bu metine "ToolTip"lerde rastlandý Gözardý edip, devam ediyorum ...

source: Warning: Configuration appears to have ended before we were Done loading an ToolTip block. Outcome is likely not good.
pl: Ostrze¿enie: Wydaje siê, ¿e konfiguracja urwa³a siê zanim zakoñczono ³adowanie sekcji Tooltip. Wynik pewnie nie jest dobry.
tr: Ikaz : Ayarlama balon yardým bloðunun yükleminin bitiminden önce bitirilmiþ . Sonuç iyi olmayabilir .

source: Warning: Configuration appears to have ended before we were Done loading an FX block. Outcome is likely not good.
pl: Ostrze¿enie: Wydaje siê, ¿e konfiguracja urwa³a siê zanim zakoñczono ³adowanie sekcji FX. Wynik pewnie nie jest dobry.
tr: Ikaz : Ayarlama efekler ("FX") bloðunun yükleminin bitiminden önce bitirilmiþ . Sonuç iyi olmayabilir .

source: Warning: unable to determine what to do with the following text in the middle of current Extras definition: %s Will ignore and continue...
pl: Ostrze¿enie: nie wiadomo, co pocz±æ z nastêpujacym tekstem wewn±trz aktualnej definicji sekcji Extras: %s Zignorujê to i bêdê kontynuowaæ...
tr: Ikaz : "Extras" bölümünde bu metinle : ´%s´ , ne yapýlacaðý bilinemiyor . Gözardý edip , devam ediyorum ...

source: Warning: Configuration appears to have ended before we were Done loading an Extras block. Outcome is likely not good.
pl: Ostrze¿enie: Wydaje siê, ¿e konfiguracja urwa³a siê zanim zakoñczono ³adowanie sekcji Extras. Wynik pewnie nie jest dobry.
tr: Ikaz : Ayarlama eklemler ("Extras") bloðunun yükleminin bitiminden önce bitirilmiþ . Sonuç iyi olmayabilir .

source: Warning: unable to determine what to do with the following text in the middle of current Iconbox definition: %s Will ignore and continue...
pl: Ostrze¿enie: nie wiadomo, co pocz±æ z nastêpujacym tekstem wewn±trz aktualnej definicji sekcji Iconbox: %s Zignorujê to i bêdê kontynuowaæ...
tr: Ikaz : "Iconbox" bölümünde bu metinle : ´%s´ , ne yapýlacaðý bilinemiyor . Gözardý edip , devam ediyorum ...

source: Warning: Configuration appears to have ended before we were Done loading an Iconbox block. Outcome is likely not good.
pl: Ostrze¿enie: Wydaje siê, ¿e konfiguracja urwa³a siê zanim zakoñczono ³adowanie sekcji Iconbox. Wynik pewnie nie jest dobry.
tr: Ikaz : Ayarlama simge kutusu ("Iconbox") bloðunun yükleminin bitiminden önce bitirilmiþ . Sonuç iyi olmayabilir .

source: Warning: unable to determine what to do with the following text in the middle of current WindowMatch definition: %s Will ignore and continue...
pl: Ostrze¿enie: nie wiadomo, co pocz±æ z nastêpujacym tekstem wewn±trz aktualnej definicji sekcji WindowMatch: %s Zignorujê to i bêdê kontynuowaæ...
tr: Ikaz : "WindowMatch" bölümünde bu metinle : ´%s´ , ne yapýlacaðý bilinemiyor . Gözardý edip , devam ediyorum ...

source: Warning: Configuration appears to have ended before we were Done loading an WindowMatch block. Outcome is likely not good.
pl: Ostrze¿enie: Wydaje siê, ¿e konfiguracja urwa³a siê zanim zakoñczono ³adowanie sekcji WindowMatch. Wynik pewnie nie jest dobry.
tr: Ikaz : Ayarlama pencere yakalamasý ("WindowMatch") bloðunun yükleminin bitiminden önce bitirilmiþ . Sonuç iyi olmayabilir .

source: Help! Cannot find epp! Enlightenment is looking for epp here: %s This is a FATAL ERROR. This is probably due to either the program not existing or it not being able to be executed by you.
pl: Pomocy! Nie mogê znale¼æ epp! %s To jest B£¡D KRYTYCZNY. Powodem jest prawdopodobnie albo to, ¿e program nie istnieje albo to, ¿e nie masz do niego praw wykonywania.
tr: Imdat ! ´epp´'yi bulamýyorum Enlightenment epp'yi burada aradý : ´%s´ Bu ölümsel bir hata idi . Bu ´epp´ uygulamasýnýn eksiðinden dolayý yada senin ´epp´ için çalýþtýrma hakkýn olmadýðý için olabilir .

source: error
pl: b³±d
tr: hata

source: Theme versioning ERROR
pl: B³±d w wersji wystroju.
tr: Görünüm nesilleme hatasý

source: Restart with Defaults
pl: Uruchom ponownie z warto¶ciami domy¶lnymi.
tr: Önayarlý deðerlerle yeniden baþla

source: Abort and Exit
pl: Zaniechaj i Wyjd¼
tr: Býrak ve Çýk

source: ERROR: The configuration for the theme you are running is incompatible. It's config revision is %i. It needs to be marked as being revision %i Please contact the theme author or maintainer and inform them that in order for their theme to function with this version of Enlightenment, they have to update it to the current settings, and then match the revision number. If the theme revision is higher than Enlightenment's it may be that you haven't upgraded Enlightenment for a while and this theme takes advantages of new features in Enlightenment in new versions.
pl: B£¡D: Konfiguracja wystroju, którego u¿ywasz jest niezgodna. Jego wersja to %i. Powinna byæ oznaczona jako %i Skontaktuj siê z autorem wystroju lub osob±, która siê nim opiekuje i poinformuj j±, ¿e jej wystrój bêdzie dzia³a³ z t± wersj± Enlightenment, tylko je¿eli zostanie on uaktualniony do obecnej wersji i bêdzie mia³ w³a¶ciw± wersjê. Je¿eli wersj± wystroju jest wiêksza ni¿ wersja Enlightenment to mo¿liwe, ¿e nie uaktualnia³e¶ ostatnio Enlightenment, za¶ ten wystrój korzysta z nowych funckji wprowadzonych w nowych wersjach Enlightenment.
tr: * HATA : Çalýþtýrdýðýn görünümün ("Theme") bazý ayar tipleri uygun deðil . Ayarlar %i nesle göre yapýlmýþ , bu ama %i neslidir . Lütfen görünümün yazarýyla/yöneticisiyle iletiþim kurup o görünümlerin ayar dosyalarýný Enlightenment'in bu nesline göre yenileyip , bu nesle göre de uygun yapmalarýný ric'a et . O zaman þu anki nesle uygun olunulur . Görünümün nesli Enlightenment'inkinden daha yeniyse , o zaman sen uzun bir süre için Enlightenment'ini yenilemedin ve bu görünüm yeni nesillerin bazý özelliklerinden faydalanýyor .

source: User Config Version ERROR
pl: B³±d wersji konfiguracji u¿ytkownika
tr: Kullanýcý Ayarlama Nesili hatasý

source: ERROR: The settings you are using are incompatible with this version of Enlightenment. It's revision is %i It needs to be revision %i to be compatible. If you just upgraded to a new version of E Restarting with Defaults will remove your current user preferences and start cleanly with system defaults. You can then modify your configuration to your liking again safely.
pl: B£¡D : Ustawienia, których u¿ywasz s± niezgodne z t± wersj± Enlightenment. S± one w wersji %i. Aby byc zgodne, musz± byæ w wersji %i. Je¿eli w³a¶nie zaktualizowa³e¶ E do nowej wersji, wybranie opcji Uruchom ponownie z warto¶ciami domy¶lnymi usunie twoje aktualne ustawienia i wystartuje z domy¶lymi ustawieniami. Mo¿esz potem bezpiecznie dostosowaæ ustawienia do swoich potrzeb.
tr: * HATA : Çalýþtýrdýðýn görünümün ("Theme") bazý ayar tipleri uygun deðil . Ayarlar %i nesle göre yapýlmýþ , bu ama %i neslidir . Son dakikarda/zamanda yeni bir Enlightenment nesline geçiþ yaptýysan , E'yi önayarlarýyla yeniden baþlatmak en temiz çözüm olup , doðru ayarlarý açacaktýr . O zaman yeterince bir güven seviyesine ulaþýlmýþ ise ayar dosyalarýný deðiþtirebilirsin .

source: WARNING! There was an error writing the file: %s This may be due to lack of disk space, quota or filesystem permissions.
pl: Ostrze¿enie ! Wyst±pi³ b³±d przy zapisie pliku: %s Mo¿e byæ to spowodowane brakiem miejsca na dysku przekroczeniem quoty lub prawami dostêpu.
tr: IKAZ ! ´%s´ dosyaný yazarken bir hata oluþtu ! Bu hata eksik boþ disk alaný, kota yada eksik olan ulaþým haklarýndan dolayý olabilir .
