Repository: kakaroto/e17
Catalog: e16/e/po/*.po
Languages: pl, tr

source: Enlightenment has just experienced some major problems in attempting to load the theme you specified or the default configuration directory: %s/config/ This will prevent Enlightenment from loading any configuration files at all. Since this couldn't be found Enlightenment is probably not going to find any configuration files anywhere on your system, and so it will have almost no configuration loaded when it starts up. This is most likely the sign of a bad installation of Enlightenment if this directory is missing. The likely causes are that the package was improperly built, if a binary package, or 'make install' hasn't been typed or during the installation the directory above was not able to be copied over for installation perhaps due to permissions or lack of disk space. It also could be that the config directory has been inadvertently deleted since installation. This is a serious problem and should be rectified immediately Please contact your system administrator or package maintainer. If you are the administrator of your own system please consult the documentation that came with Enlightenment for additional information.
pl: Enlightenment mia³ powa¿ne problemy przy próbie za³adowania wystroju, który zosta³ podany przez Ciebie jako domy¶lny katalog konfiguracyjny: %s/config/ W wyniku tego Enlightenment nie za³aduje ¿adnych plików konfiguracyjnych. Skoro nie uda³o siê tego znale¼æ, Enlightenment nie znajdzie prawdopodobnie ¿adnych plików konfiguracyjnych w twoim systemie, st±d nie bêdzi mia³ za³adowanej prawie ¿adnej konfiguracji, kiedy siê uruchomi. Brak tego katalogu najprawdopodobniej jest zankiem z³ej instalacji Enlightenment. Przyczynami mog± byæ: b³êdna kompilacja pakietów, nie wydanie komendy 'make install', lub brak mo¿liwo¶ci skopiowanie powy¿szego katalogu podczas instalacji z powodu braku miejsca lub niewystarcaj±cych praw dostêpu. Mo¿liwe te¿, ¿e skasowano ten katalog ju¿ po instalacji Enlightenment. Jest to powany problem, któremu nalezy natychmiast zaradziæ. Skontaktuj siê z administratorem twojego systemu. Je¿eli to ty jeste¶ administratorem systemu, dodatkowe informacje mo¿esz znale¼æ w dokumentacji, która zosta³a dostarczona wraz z Enlightenment.
tr: Enlightenment haþimdi belirttiðin görünümü yüklerken büyük bir sorunla karþýlaþtý yada önayarlý ayar dizininde bir hata oldu : %s/config Bu Enlightenment'in hiç bir ayar dosyasýný yüklememesine sebebiyet verecektir . Bunlar bulunamayýnca maallessef hiç bir ayar dosyasýn_i durumunun bir müþkili olabilir ve Enlightenment her baþladýðýnda yaklaþýk hiç bir ayarlamayý yüklemeyecek .

source: Enlightenment Starting...
pl: Uruchamianie Enlightenment...
tr: Enlightenment baþlýyor ....

source: Recover system config?
pl: Odtworzyæ konfiguracjê systemu?
tr: Sistem ayarlarýný yeniden kurayým mý ?

source: Yes, Attempt recovery
pl: Tak, spróbuj odtworzyæ
tr: Evet , kurmayý dene

source: Restart and try again
pl: Uruchom ponownie i spróbuj jeszcze raz
tr: Yeniden baþla ve bir daha dene

source: Quit and give up
tr: Çýk ve unut

source: Enlightenment has encountered parsing errors in your autosaved configuration. This may be due to filing system errors, Minor bugs or unforeseen system shutdowns. Do you wish Enlightenment to recover its original system configuration and try again?
pl: Enlightenemnt napotka³ b³êdy w twojej automatycznie zapisanej konfiguracji. Mo¿e to byæ spowodowane b³êdami w systemie plików, drobnymi b³êdami lub nieprzewidzianymi zamkniêiami systemu. Czy chcesz, aby Enlightenment odtworzy³ oryginalne ustawienia systemowe i spróbowa³ ponownie?
tr: Enlightenment otomatikman kaydedilen ayar dosyalarýnda hatalar buldu . Bunun nedenleri sistem hatalarý, ufak bozukluklar yada öngörülemeyen sistem kapatýlmasý olabilir . Enlightenment orjinal sistem ayarlarýný kurup , yeniden baþlamayý denesin mi ?

source: ECursor Error!
pl: B³±d w sekcji ECursor
tr: ECursor hatasý!

source: Background Error!
pl: B³±d w sekcji Background
tr: Background hatasý!

source: Hold down the mouse button and drag the mouse to be able to drag the desktop back and forth. Click right mouse button for a list of all Desktops and their applications. Click middle mouse button for a list of all applications currently running.
pl: Aby przeci±gn±æ pulpit, przytrzymaj przycisk myszy i przeci±gaj mysz w dowolnym kierunku. Aby otrzymaæ listê Pulpitów i aplikacji w nich uruchomianych naci¶nij prawy przycisk myszy. Aby otrzymaæ listê aktualnie dzia³aj±cych aplikacji nacisnij ¶rodkowy przycisk myszy.
tr: Fare tuþunu tut ve fareyi taþý ki , masaüstlerini ileri ve geri taþý . Saðla týklayýp yekin masaüstlerini ve yekin uygulamalarýn bir listesini görebilirsin . Orta fare tuþuyla yekin þu an çalýþan uygulamalarý görebilirsin .

source: This is the Root desktop. You cannot drag the root desktop around. Click right mouse button for a list of all Desktops and their applications. Click middle mouse button for a list of all applications currently running.
pl: To jest Pulpit g³ówny. Tego pulpitu nie mo¿na przeci±gaæ. Aby otrzymaæ listê Pulpitów i aplikacji w nich uruchomianych naci¶nij prawy przycisk myszy. Aby otrzymaæ listê aktualnie dzia³aj±cych aplikacji nacisnij ¶rodkowy przycisk myszy.
tr: Bu ana masaüstü idir. Ana masaüstünü etrafta taþýyamayabilirsin. Saðla týklayýp yekin masaüstlerini ve yekin uygulamalarýn bir listesini görebilirsin . Orta fare tuþuyla yekin þu an çalýþan uygulamalarý görebilirsin .

source: Click here to raise this desktop to the top.
pl: Aby podnie¶æ Pulpit na szczyt, kliknij tutaj.
tr: Bu masaüstünü baþa getirmek için buraya týkla .

source: Click here to lower this desktop to the bottom.
pl: Aby schowaæ ten Pulpit na dno, kliknij tutaj
tr: Bu masaüstünü en dibe göndermek için buraya týkla .

source: Attention !!!
pl: Uwaga !
tr: Dikkat !!!

source: Starting up Ripples FX...
pl: Uruchamianie efektu Ripples FX...
tr: Ripples FX baþlýyor ....

source: You have just started the Ripples Effect. If you look closely on your desktop background, and if it doesn't have a solid colour (i.e. has a background texture or image), you will see a pool of water at the bottom of your screen that reflects everything above it and "ripples". To disable this effect just select this option again to toggle it off.
pl: W³a¶nie uruchomi³e¶ efekt Ripples FX. Je¿ei przyjrzysz siê uwa¿nie t³u swojego Pulpitu, i je¿eli nie ma ono jednolitego koloru (tzn. t³em jest tekstura lub obrazek), zobaczysz u do³u ekranu powierzchniê wody, która odbija wszystko, co znajduje siê ponad ni±. Mo¿esz wy³±czyc ten efekt poprzez ponowne wybranie tej opcji
tr: Þu an titreþim efektini baþlattýn . Dikkatli bir þekilde masaüstü sonuna bakarsan ve ardalanýn bir resim yada bir desen ise , o zaman bir orada su titreþimine benzer hareketleri görebilirsin . Bu efekti kapatmak için sadece baþlamak için seçtiðin yerde , ayný efekti yeniden seç .

source: Unable to display raindrops
pl: Nie da siê wy¶wietliæ kropli deszczu
tr: Yaðmur damlalarýný gösteremiyorum

source: Enlightenment is unable to display raindrops on this display because Shared memory is not available on this X-Server. This may be due to Enlightenment being a remote client running over the network, a MIT-SHM incapable X-server, having run out of SHM ID's on the system or Shared Memory support being turned off in Imlib You may correct this by either running `imlib_config' or copying the system imrc (/usr/etc/imrc) to ~/.imrc and editing it, enabling shared memory.
pl: Enlightenment nie mo¿e wy¶wietliæ efektu 'Kropli Deszczu' na tym ekranie, gdy¿ ten X-Serwer nie wspiera rozszerzenia Shared memory Mo¿e byæ to spowodowane: albo tym, ¿e Enlightenment jest uruchomiony poprzez po³±czenie sieciowe, albo X-Serwer nie ma takiej opcji, albo wyczerpa³ siê zasób SHM iD w systemie, albo wy³±czono opcjê Shared Memory w konfiguracji Imlib Mo¿na temu zaradziæ przez uruchomienie 'imlib_config' lub skopiowanie systemowego pliku imrc (usr/etc/imrc) do ~/.imrc i w³±czenie obs³ugi Shared Memory prze jego edycjê
tr: Enlightenment bu ekranda yaðmur damlalarýný gösteremiyor , çünkü bu X-sunucusunda bölüþülebilinir hafýza imkaný yok . Bu Enlightenment'in uzaktan bir þebeke üzerinden sunucu'dan çalýþtýðýndan dolayý , bir MIT-SHM imkanýna sahip olmayan bir X-suncusu, SHM ID'lerin kalmamasý yada Imlib'de bölüþülebilinir hafýza üzelliði kapalý . Bunu ´imlib_config´'i çalýþtýrýp düzeltebilirsin yada sistem ´imrc´'sini (/usr/etc/imrc) ´~/.imrc´'ye taþýyýp , elle deðiþtirip , bölüþülebilinir hafýzayý açabilirsin .

source: Enlightenment is unable to display raindrops on this display because shared pixmaps are not available on this X-Server. This may be due to either the X-Server not implementing shared pixmaps, or shared pixmaps being disabled in Imlib's configuration. You may correct this by either running `imlib_config' or copying the system imrc (/usr/etc/imrc) to ~/.imrc and editing it, enabling shared pixmaps.
pl: Enlightenment nie mo¿e wy¶wietliæ efektu 'Kropli Deszczu' na tym ekranie, gdy¿ ten X-Serwer nie wspiera rozszerzenia Shared Pixmaps Mo¿e to byæ spowodowany tym, ¿e S-Serwer nie obs³uguje opcji 'Shared Pixmaps', lub tym, ¿e wy³±czono opcjê 'Shared Pixmaps' w konfiguracji Imlib Mo¿na temu zaradziæ przez uruchomienie 'imlib_config' lub skopiowanie systemowego pliku imrc (usr/etc/imrc) do ~/.imrc i w³±czenie obs³ugi Shared Pixmaps prze jego edycjê
tr: Enlightenment bu ekranda yaðmur damlalarýný gösteremiyor , çünkü bu X-sunucusunda bölüþülebilinir resim imkaný yok . Bu X-sunucusunun imkan eksikliðinden dolayý olabilir yada Imlib'de bu imkanýn kapalý olmasýndan olabilir ve ayarlar yoluyla deðiþtirilebilinir . Bunu ´imlib_config´'i çalýþtýrýp düzeltebilirsin yada sistem ´imrc´'sini (/usr/etc/imrc) ´~/.imrc´'ye taþýyýp , elle deðiþtirip , bölüþülebilinir resimleri açabilirsin .

source: Starting up Raindrops FX...
pl: W³±czanie efektu specjalnego 'Krople Deszczu'...
tr: Yaðmur damlalarý efekti baþlýyor ...

source: You have just started the Raindrops Effect. If you look closely on your desktop background, and if it doesn't have a solid colour (i.e. has a background texture or image), you will see "raindrops" hit the background and make little splashes. This Effect can be VERY CPU intensive. To disable this effect just select this option again to toggle it off.
pl: W³a¶nie uruchomi³es efekt specjalny 'Krople Deszczu' Je¿eli przyjrzysz siê t³u Pulpitu, i je¿eli nie ma ono jednolitego koloru (tzn. t³em jest tekstura lub obrazek) zobaczysz 'krople deszczu' uderzaj±ce w t³o i tworzace ma³e zaburzenia Ten efekt mo¿e BARDZO obci±¿yæ procesor Mo¿esz wy³±czyc ten efekt poprzez ponowne wybranie tej opcji
tr: Þu an Yaðmur damlalarýný baþlattýn . Dikkatli bir þekilde masaüstü sonuna bakarsan ve ardalanýn bir resim yada bir desen ise , o zaman deðiþik yerlerde su / yaðmur damlalarýnýn iz býraktýðýný göreceksin . (Hýzlý iþlemciyi bile terletir) Bu efekti kapatmak için sadece baþlamak için seçtiðin yerde , ayný efekti yeniden seç .

source: Starting up Waves FX...
pl: W³±czanie efektu specjalnego 'Fale'...
tr: Dalgalar efekti baþlýyor ...

source: You have just started the Waves Effect. If you look closely on your desktop background, and if it doesn't have a solid colour (i.e. has a background texture or image), you will see a pool of water at the bottom of your screen that reflects everything above it and "waves". To disable this effect just select this option again to toggle it off.
pl: W³a¶nie uruchomi³es efekt specjalny 'Fale' Je¿eli przyjrzysz siê t³u Pulpitu, i je¿eli nie ma ono jednolitego koloru (tzn. t³em jest tekstura lub obrazek) zobaczysz u do³u ekranu 'faluj±c±' powierzchniê wody, która odbija wszystko, co znajduje siê ponad ni±. Mo¿esz wy³±czyc ten efekt poprzez ponowne wybranie tej opcji
tr: Þu an dalgalar efektini baþlattýn . Dikkatli bir þekilde masaüstü sonuna bakarsan ve ardalanýn bir resim yada bir desen ise , o zaman deðiþik yerlerde su dalgalarýnýn iz býraktýðýný ve sallanýmýný göreceksin . Bu efekti kapatmak için sadece baþlamak için seçtiðin yerde , ayný efekti yeniden seç .

source: Starting up imagespinners FX...
pl: Uruchamianie efektu specjalnego imagespinners...
tr: Imagespinners FX baþlýyor ...

source: You have just started the imagespinners Effect. To disable this effect just select this option again to toggle it off.
pl: W³a¶nie uruchomi³es efekt specjalny imagespinners. Mo¿esz wy³±czyc ten efekt poprzez ponowne wybranie tej opcji
tr: Þu an resim delisi efektini baþlattýn . Bu efekti kapatmak için sadece baþlamak için seçtiðin yerde , ayný efekti yeniden seç .

source: Cannot comply
pl: Nie mo¿na wykonaæ
tr: Tamamlayamadým

source: Iconboxes and Pagers are disallowed from being members of a group. You cannot add these windows to a group.
pl: Pude³ka na Ikony i Podgl±dy Pulpitu nie mog± byc cz³onkami grup. Nie mo¿esz dodawaæ tych okien do grup
tr: Simge kutularý ve gözeyler bit kitlenin üyesi olmaktan mahrum . Bu pencereleri hiç bir kitleye ekleyemeyeceksin .

source: Window Group Error
pl: B³±d Grup Okien
tr: Pencere kitle hatasý

source: This window currently does not belong to any groups. You can only destroy groups or remove windows from groups through a window that actually belongs to at least one group.
pl: To okno nie nale¿y w tej chwili do ¿adnej grupy. Mo¿esz tylko rozbijaæ grupy lub usuwac okna z grup Poprzez okno, które nale¿y do przynajmniej jednej grupy.
tr: Bu pencere þu an hiç bir kitlenin üyesi deðil . Kitleleri silmek yada bit kitleden bir pencereyi silmek için en azýndan bir pencere bir kitlenin üyesi olmasý lazým .

source: Currently, no groups exist or this window already belongs to all existing groups. You have to start other groups first.
pl: W tej chwili nie istniej± ¿adne grupy, lub to okno nalezy ju¿ do wszystkich grup. Musisz najpierw utworzyæ now± grupê.
tr: Þu an , hiç bir kitle yok yada bu pencere her varolan kitlenin üyesidir . Ilken baþka bir kitleyi kurman lazým .

source: Currently, no groups exist. You have to start a group first.
pl: W tej chwili nie istniej± ¿adne grupy. Musisz najpierw jak±¶ utworzyæ.
tr: Þu an , hiç bir pencere kitlesi yok . Ilken bir kitle kur .

source: Window Group Selection
pl: Wybór Grupy Okien
tr: Pencere kitlesi seçimi

source: Enlightenment Window Group Selection Dialog
pl: Okno dialogowe Wyboru Grupy Okien Enlightenment
tr: Enlightenment pencere kitlesi seçim diyaloðu

source: Close
pl: Zamknij
tr: Kapat

source: Enlightenment performed an Illegal Instruction. This most likely is due to you having installed an run a binary of Enlightenment that was compiled for a make or model of CPU not 100%% identical or compatible with yours. Please either obtain the correct package for your system, or re-compile Enlightenment and possibly any support libraries that you got in binary format to run Enlightenment.
tr: Enlightenment geçersiz bir iþlem yaptý . Çoðu zaman bu Enlightenment'in pakajlardan yüklenip , bu pakajdaki biner uygulamasýnýn senin iþlemciyle %% 100 eþit olmayan bir iþlemcide denetlenmiþtir . Lütfen senin sistemin için doðru pakajý yükle , yada Enlightenment'i yeniden dentlet ve mümkün ise biner taban kitaplýklarý da yenile .

source: Enlightenment caused a Floating Point Exception. This means that Enlightenment or support library routines it calls have performed an illegal mathematical operation (most likely dividing a number by zero). This is most likely a bug. It is recommended to restart now. If you wish to help fix this please compile Enlightenment with debugging symbols in and run Enlightenment under gdb so you can backtrace for where it died and send in a useful bug report with backtrace information and variable dumps etc.
pl: Enlightenment spowodowa³ Wyj±tek w Dzia³aniach Zmienno-Przecinkowych Oznacza to, ¿e Enlightenment, lub funkcje z bibliotek pomocniczych wykona³y niedozwolon± operacjê matematyczn± (najprawdopodobniej dzielenie przez zero). Jest to prawdopodobnie b³±d w programie. Doradzamy ponowne uruchomienie. Je¿eli chcesz nam pomóc w usuniêciu tego b³êdu, zrekompiluj Enlightenment z u¿yciem symboli debuggera i uruchom Enlightenment pod kontrola gdb, tak, aby¶ móg³ wy¶ledziæ, gdzie powstaje b³±d i wy¶lij nam u¿yteczny 'Bug Report' z informacj± ¶ledz±c± i zrzutem warto¶ci zmiennych
tr: Enlightenment bir noksap ( noktalý hesap ) hatasýna yol açtý ! Bu , Enlightenment'in yada E'yi desktekleyen bir kütüphane'nin geçersiz bir matematiksel bir iþlem yaptýðýnýn bir belgesidir ( bu da , çoðunlukla bir sayýnýn sýfýr'a bölmesinden dolayýdýr . ) . Elhasýl, bu bir yazýlým hatasýdýr . Þimdi yeniden baþlamak iyi bir fikir'dir . Bu hatanýn düzeltilmesine katký saðlamak istiyorsan Enlightenment'i çözüm semboleriyle beraber ( -> debug ) denetlet ve Enlightenment'i gdb altýnda çalýþtýrýp gdb'nin verdiði verileri ve veri özellikleriyle beraber bir hata raporu gönder .

source: Enlightenment caused Segment Violation (Segfault) This means that Enlightenment or support library routines it calls have accessed areas of your system's memory that they are not allowed access to. This is most likely a bug. It is recommended to restart now. If you wish to help fix this please compile Enlightenment with debugging symbols in and run Enlightenment under gdb so you can backtrace for where it died and send in a useful bug report with backtrace information and variable dumps etc.
pl: Enlightenment spowodowal naruszenie ochrony pamiêci (Segfault) Oznacza to, ¿e Enlightenment, lub funkcje z bibliotek pomocniczych za¿±da³y dostêpu do obszarów pamiêci do któeych nie mia³y praw dostêpu. Jest to prawdopodobnie b³±d w programie. Doradzamy ponowne uruchomienie. Je¿eli chcesz nam pomóc w usuniêciu tego b³êdu, zrekompiluj Enlightenment z u¿yciem symboli debuggera i uruchom Enlightenment pod kontrola gdb, tak, aby¶ móg³ wy¶ledziæ, gdzie powstaje b³±d i wy¶lij nam u¿yteczny 'Bug Report' z informacj± ¶ledz±c± i zrzutem warto¶ci zmiennych
tr: Enlightenment bir bölge-hatasýna sebebiyet verdi ( -> Segfault ) Enlightenment veya Enlightenment'i destekleyen kütüphaneler bir iþlem'de kendisine kullanýlmaya verilmeyen bir hafýza parçasýný kullanmaya uðraþmasýnýn bir belgesidir . Eveet , bir hatayý buldun ! Elhasýl, bu bir yazýlým hatasýdýr . Þimdi yeniden baþlamak iyi bir fikir'dir . Bu hatanýn düzeltilmesine katký saðlamak istiyorsan Enlightenment'i çözüm semboleriyle beraber ( -> debug ) denetlet ve Enlightenment'i gdb altýnda çalýþtýrýp gdb'nin verdiði verileri ve veri özellikleriyle beraber bir hata raporu gönder .

source: Enlightenment caused Bus Error. It is suggested you check your hardware and OS installation. It is highly unusual to cause Bus Errors on operational hardware.
pl: Enlightenment spowodowa³ b³±d szyny Doradzamy sprawdzenie sprzêtu i instalacji systemu operacyjnego. Spowodowanie b³êdu szyny jest bardzo ma³o prawodpodobne przy dobrze dzia³aj±cym sprzêcie
tr: Enlightenment bir yuvalama hatasý yaptý . Lütfen iþletim sistemini ve donatýmýný gözden geçir . Çalýþan bir donatýmda yuvalama hatalarýnýn oluþmasý enderdir .

source: Another Window Manager is already running
pl: Inny Menad¼er Okien jest ju¿ uruchomiony
tr: Baþka bir pencere yöneticisi zaten çalýþýyor

source: OK (edit file)
pl: OK (modyfikuj plik)
tr: Evet ( dosyayý deðiþtir )

source: Cancel (do NOT edit)
pl: Zaniechaj (NIE modyfikuj)
tr: Iptal ( deðiþtirme )

source: Another Window Manager is already running. You will have to quit your current Window Manager first before you can successfully run Enlightenment. If you haven't edited your user start-up files, Enlightenment can do that now for you, so when you log in again after quitting your current window manager, you will have Enlightenment running. If you want to do this, click OK, otherwise hit cancel to abort this operation and edit the files by hand. WARNING WARNING WARNING WARNING! It is possible that this MAY not properly edit your files.
pl: Inny Menad¿er Okien jest ju¿ uruchomiony Musisz najpierw zamkn±æ ju¿ dzia³aj±cy Mened¿er Okien, zanim bêdziesz móg³ uruchomiæ Enlightenment. Je¿eli nie modyfikowa³e¶ dot±d twoich plików startowych u¿ytkownika, Enlightenment mo¿e to dla Ciebie zrobiæ, tak aby po ponownym zalogowaniu po zamkniêciu dzia³aj±cego Mened¼era Okien, uruchomi³ siê Enlightenment. Je¿eli chcesz to zrobiæ, naci¶nij OK; je¿eli chcesz anulowaæ t± operacjê i zmodyfikowaæ plik rêcznie naci¶nij Anuluj OSTRZE¯ENIE OSTRZE¯ENIE OSTRZE¯ENIE! Istnieje mo¿liwo¶æ b³êdnej modyfikacji plików.
tr: Baþka bir pencere yöneticisi zaten çalýþýyor . Ilkin þu ançalýþan pencere yöneticisini bitirip , ondan sonra Enlightenment'i baþlat . Baþlangýç dosyalarýný deðiþtirmediysen , Enlightenment senin için bu dosyalarý öylece deðiþtirebilir ki , þu anki pencere yöneticisinden çaktýktan sonra , her zaman direkmen Enlightenment baþlayacak . Bunlarý istiyorsan , þimdi "Oldu" de, yada iptal edip bu dosyalarý sen kendiliðinden deðiþtirebilirsin . IKAZ IKAZ IKAZ IKAZ Bir ihtimal , bu eylem dosyalarýný düzgün bir þekilde deðiþtirmeyebilir .

source: Are you sure?
pl: Na pewno?
tr: Emin misin ?

source: YES (edit file)
pl: TAK (modyfikuj plik)
tr: Evet ( dosyayý deðiþtir )

source: NO (do not edit)
pl: NIE (nie modyfikuj)
tr: Hayýr ( dosyayý deðiþtirme )

source: Are you absolutely sure you want to have Enlightenment edit your start-up files for you? If your start-up files are highly customised this may not work. Are you ABSOLUTELY sure?
pl: Czy Enlightenment ma na pewno zmodyfikowaæ twoje pliki startowe? Je¶li twoje pliki s± bardzo rozbudowane, ta opcja mo¿e nie zadzia³aæ. Czy NA PEWNO to zrobiæ?
tr: Enlightenment'in senin baþlangýç dosyalarýný deðiþtirmesini istiyormusun ? Baþlangýç dosyalarýný yüksek bir uðraþ ile deðiþtirdiysen, bu baþarýsýz olabilir . Vallahi emin misin ?

source: ImageClass Error!
pl: B³±d sekcji ImageClass
tr: ImageClass hatasý!

source: Iconbox Options
pl: Opcje Pude³ka na Ikony
tr: Simge kutusu ayarlarý

source: This Iconbox Settings...
pl: Ustawienia tego Pude³ka na Ikony...
tr: Bu simge kutusunun ayarlarý ...

source: Close Iconbox
pl: Zamknij Pude³ko na Ikony
tr: Simge kutusunu kapat

source: Create New Iconbox
pl: Stwórz nowe Pude³ko na Ikony
tr: Yeni simge kutusunu yarat

source: Message
pl: Wiadomo¶æ
tr: Ileti

source: Enlightenment IPC Commands Help
pl: Pomoc dla komend Enlightenmnet IPC
tr: Enlightenment IPC komuta yardýmý

source: commands currently available:
pl: Aktualnie dostêpne komendy :
tr: þu an mümkün olan komutalar :

source: use "help all" for descriptions of each command use "help <command>" for an individual description
pl: wpisz "help all" aby uzyskaæ opis ka¿dej z komend wpisz "help <komenda>" aby uzyskaæ opis pojedynczej komendy
tr: "help all" ile her komutanýn yardýmýný görebilirsin "help <komuta>" ile komutaya özgü bir yardým görebilirsin

source: use "help <command>" for an individual description
pl: wpisz "help <komenda>" aby uzyskaæ opis pojedynczej komendy
tr: "help <komuta>" ile komutaya özgü bir yardým görebilirsin

source: <command> : <description>
tr: <komuta> : <anlatým>

source: Enlightenment Version : %s code is current to : %s
pl: Wersja Enlightenment : %s kod jest aktualny na : %s
tr: Enlightenment nesli : %s kaynak tarihi : %s

source: Enlightenment Message Dialog
pl: Okno wiadomo¶ci Enlightenment
tr: Enlightenment ileti kutusu

source: Ignore this
pl: Zignoruj to
tr: Bunu geç

source: Restart Enlightenment
pl: Uruchom Enlightenment ponownie
tr: Enlightenment'i yeniden baþlat

source: Quit Enlightenment
pl: Wyjd¼ z Enlightenment
tr: Enlightenment'ten çýk

source: Enlightenment Version: %s Last updated on: %s
pl: Wersja Enlightenment : %s Ostatnia modyfikacja : %s
tr: Enlightenment Nesli : %s Son yenileme tarihi : %s

source: Cannot allocate enough memory
pl: Nie da siê przydzieliæ wystarczaj±cej ilo¶ci pamiêci
tr: Yeterince bellek ayýrtamadým
