Repository: kakaroto/e17
Catalog: e16/e/po/*.po
Languages: pl, tr

source: Resize Methods:
pl: Metody Zmiany rozmiaru
tr: Yeniden boyutlandýrma þekli :

source: Opaque
pl: Nieprzezroczysta
tr: Içli

source: Technical
pl: Techniczna
tr: Teknik

source: Box
pl: Pude³ko
tr: Kutu olarak

source: Shaded
pl: Zacieniowane
tr: Gölgeli

source: Semi-Solid
pl: Pó³-pe³ne
tr: Yarý-gözükür

source: Translucent
pl: Przezroczyste
tr: Transparan

source: Move/Resize Geometry Info Postion:
pl: Informacja o geometrii Przesuwania/Zmiany rozmiaru
tr: Taþýma/boyutlandýrma bilgisi yeri :

source: Window Center (O/T/B Methods)
pl: Centrum Okna (Metody N/Prz/Pud)
tr: Pencere ortasýnda ( O/T/B türleri )

source: Always Screen corner
pl: Zawsze w rogu ekranu
tr: Daima ekran köþesinde

source: Don't show
pl: Nie pokazuj
tr: Gösterme

source: %i Desktops
pl: %i Puplpitów
tr: %i masaüstleri

source: %i Desktop
pl: Pulpit %i
tr: %i masaüstü

source: Multiple Desktop Settings
pl: Ustawienia Wielu Pulpitów
tr: Çoklu masaüstü ayarlarý

source: Enlightenment Multiple Desktop Settings Dialog
pl: Okno ustawieñ Wielu Pulpitów Enlightenment
tr: Enlightenment çoklu masaüstü ayarlarý diyaloðu

source: Number of virtual desktops:
pl: Ilo¶æ Pulpitów wirtualnych:
tr: Sanal masaüstlerinin sayýsý :

source: %i x %i Screens in size
pl: %i x %i Pulpitów
tr: %i * %i Ekran boyutlarý

source: 1 Screen in size
pl: 1 Pulpitu
tr: 1 Ekran boyutu

source: Virtual Desktop Settings
pl: Ustawienia Wirtualnego Biurka
tr: Sanal masaüstü ayarlarý

source: Enlightenment Virtual Desktop Settings Dialog
pl: Okno ustawieñ Wirtualnego Biurka Enlightenment
tr: Enlightenment sanal masaüstü ayarlarý diyaloðu

source: Virtual Desktop size:
pl: Rozmiar Wirtualnego Pulpitu :
tr: Sanal masaüstü boyutu :

source: Wrap virtual desktops around
pl: Zawijaj Wirtulane Pulpity
tr: Sanal masaüstleri kenarda deðiþtir

source: Enable edge flip
pl: W³±cz prze³±czanie przy brzegach ekranu
tr: Kenar zýplamasýný aç

source: Resistance at edge of screen:
pl: Czu³o¶æ na prze³±czanie przy brzegach ekranu:
tr: Ekran kenarýnýn dayanýklýðý :

source: Window Placement Settings
pl: Ustawienia Rozmieszczania Okien
tr: Pencere yerleþme ayarlarý

source: Enlightenment Window Placement Settings Dialog
pl: Okno ustawieñ Rozmiesczania Okien Enlightenment
tr: Enlightenment pencere yerleþme ayarlarý diyaloðu

source: Dialog windows appear together with their owner
pl: Okna dialogowe pojawjaj± siê razem z w³a¶cicielem
tr: Diyalok pencerelerini ana pencereleriyle beraber ayný masaüsütünde aç

source: Switch to desktop where dialog appears
pl: Prze³±czaj na Pulpit, gdzie pojawia siê okno dialogowe
tr: Yeni bir diyalok penceresinin açýldýðý masaüstüne geç

source: Place windows manually
pl: Rozmieszczaj okna rêcznie
tr: Pencereleri elden yerleþtir

source: Place windows under mouse
pl: Rozmieszczaj okna pod mysz±
tr: Pencereleri farenin altýna yerleþtir

source: Autoraise Settings
pl: Ustawienia Auto-Podnoszenia
tr: Otomatik öne getirim

source: Enlightenment Automatic Raising of Windows Settings Dialog
pl: Okno ustawieñ Automatycznego Podnoszenia Okien
tr: Enlightenment otomatikman öne getirim ayarlarý diyaloðu

source: Raise Windows Automatically
pl: Podno¶ Okna Automatycznie
tr: Pencereleri otomatikman öne geçir

source: Autoraise delay:
pl: Opó¼nienie podnoszenia:
tr: Bekleme zamaný :

source: Tooltip Settings
pl: Ustawienia Podpowiedzi
tr: Balon yardýmý ayarlarý

source: Enlightenment Tooltip Settings Dialog
pl: Okno Ustawieñ Podpowiedzi Enlightenment
tr: Enlightenment balon yardýmý ayarlarý diyaloðu

source: Display Tooltips
pl: Wy¶wietlaj Podpowiedzi
tr: Balon yardýmlarý göster

source: Display Root Window Tips
pl: Wy¶wietlaj Podpowiedzi Okna G³ównego
tr: Ana pencere yardýmlarýný göster

source: Tooltip Delay:
pl: Opó¼nienie wy¶wietlania Podpowiedzi
tr: Balon yardýmý gösterme zaman arasý :

source: KDE Settings
pl: Ustawienia KDE
tr: KDE ayarlarý

source: Enlightenment KDE Settings Dialog
pl: Okno ustawieñ KDE Enlightenment
tr: Enlightenment KDE ayarlarý diyaloðu

source: Enable KDE Support
pl: W³±cz obs³ugê KDE
tr: KDE desteðini aç

source: Miscellaneous Settings
pl: Ustawienia ró¿ne
tr: Karýþýk ayarlar

source: Enlightenment Miscellaneous Settings Dialog
pl: Okno Ustawieñ Ró¿nych Enlightenment
tr: Enlightenment karýþýk ayarlar diyaloðu

source: Enable Dialog Headers
pl: W³±cz nag³ówki okien dialogowych
tr: Diyalok baþlýklarýný aç

source: Audio Settings
pl: Ustawienia Audio
tr: Ses ayarlarý

source: Enlightenment Audio Settings Dialog
pl: Okno ustwieñ Audio Enlightenment
tr: Enlightenment ses ayarlarý diyaloðu

source: Enable sounds
pl: W³±cz d¼wiêki
tr: Sesi aç

source: Audio not available since EsounD was not present at the time of compilation.
pl: D¼wiêki nie s± dostêpne, poniewa¿ EsounD nie by³ dostêpny podczas kompilacji.
tr: Kurulum vaktinde EsounD bulunamadýðý için ses desteði yoktur .

source: Special FX Settings
pl: Ustawienia Efektów specjalnych
tr: Özel efekler ayarlarý

source: Enlightenment Special Effects Settings Dialog
pl: Okno ustawieñ Efektów specjalnych Enlightenmnet
tr: Enlightenment özel efekler ayarlarý diyaloðu

source: Slide Method:
pl: Metoda ¦lizgania :
tr: Kaydýrma þekli :

source: Slide desktops around when changing
pl: Pulpity ¶lizgaj± siê podczas ich zmiany
tr: Masaüstü deðiþtirirken masaüstünü kaydýrt

source: Slide windows around when cleaning up
pl: Okna ¶lizgaja siê podczas czyszczenia
tr: Ekraný temizlerken pencereleri kaydýrt

source: Slide windows in when they appear
pl: Okna ¶lizgaj± siê, gdy siê pojawjaj±
tr: Pencerler gözükürken pencereleri kaydýrt

source: Animated display of menus
pl: Animowane wy¶wietlanie menu
tr: Mönüleri hareketlendir

source: Always pop up menus on screen
pl: Zawsze pokazuj menu w ca³o¶ci na ekranie
tr: Mönüleri her zaman ekranda aç

source: Warp pointer after moving menus
pl: Przeno¶ wska¼nik myszy razem z menu
tr: Mönüleri taþýdýktan sonra göstergeyi zýplat

source: Use saveunders to reduce window exposures
pl: U¿yj funkcji saveunders, aby ograniczyæ wy¶wietlanie okien
tr: Pencere gösterimlerini "saveunder"'leri kullanýp azalt

source: Animate shading and unshading of windows
pl: Animacja przechodzenia w cieñ i wychodzenia z cienia
tr: Pencerelerin toplanmasýný hareketlendir

source: Display desktop dragbar
pl: Wy¶wietlaj Pasek Przeci±gania Pulpitu
tr: Masaüstü çizgisini göster

source: Drag bar position:
pl: Pozycja Paska Przeci±gania
tr: Masaüstü çizgisinin yeri :

source: Top
pl: Góra
tr: Üst

source: Bottom
pl: Dó³
tr: Alt

source: Desktop Slide speed: (slow)
pl: Szybko¶æ ¶lizgania siê Pulpitów: (wolno)
tr: Masaüstü kaydýrtma hýzý : (yavaþ)

source: (fast)
pl: (szybko)
tr: (hýzlý)

source: Cleanup Slide speed: (slow)
pl: Szybko¶æ ¶lizgania siê okien przy czyszczeniu: (wolno)
tr: Temizleme kaydýrtma hýzý: (yavaþ)

source: Appear Slide speed: (slow)
pl: Szybko¶æ ¶lizgania siê przy pojawianiu: (wolno)
tr: Görünme kaydýtma hýzý : (yavaþ)

source: Window Shading speed: (slow)
pl: Szybko¶æ przechodzenia w cieñ: (wolna)
tr: Pencere toplama hýzý : (yavaþ)

source: -NONE-
pl: -¯ADEN-
tr: -YOK-

source: Background definition information: Name: %s File: %s
pl: Defincja t³a: Nazwa : %s Plik : %s
tr: Ardalan bilgi þekli : Isim : %s Dosya : %s

source: No Background
pl: Ilo¶æ t³o
tr: Ardalan yok

source: Unused backgrounds freed after %2i:%02i:%02i
pl: Usuwanie nie uzywanych plików t³a po %2i:%02i:%02i
tr: Kullanýlmayan %2i:%02i:%02i dan sonra serbest'edilsin

source: Desktop Background Settings
pl: Ustawienia T³a Pulpitu
tr: Ardalan ayarlarý

source: Enlightenment Desktop Background Settings Dialog
pl: Oknoustawieñ T³a Pulpitu Enlightenment
tr: Enlightenment masaüstü ardalan ayarlarý diyaloðu

source: BG Colour
pl: Kolor t³a
tr: Ardalan rengi

source: Move to Front
pl: Przesuñ na przód
tr: Öne getir

source: Duplicate
pl: Powiel
tr: Kopyala

source: Unlist
pl: Usuñ z listy
tr: Listeden çýkar

source: Delete File
pl: Skasuj plik
tr: Dosyayý sil

source: Red:
pl: Czerwony :
tr: Kýrmýzý :

source: Use background image
pl: U¿yj obrazka jako t³a
tr: Ardalan resmini kullan

source: Green:
pl: Zielony :
tr: Yeþil :

source: Keep aspect on scale
pl: Zachowaj proporcje przy skalowaniu
tr: Büyütürken boyutlarý koru

source: Blue:
pl: Niebieski :
tr: Mavi :

source: Tile image across background
pl: Utwórz mozaikê z obrazka
tr: Resmi ardalan'da tekrarla

source: Background Image Scaling and Alignment
pl: Skalowanie i Wyrównanie Obrazka t³a
tr: Ardalan Resim Büyütme ve Taraflandýrma

source: Use dithering in Hi-Colour
pl: U¿ywaj ditheringu w trybie Hi-Color
tr: Yüksek renk sayýlarýnda titremi kur

source: Background overrides theme
pl: Ustawienia t³a nadrzêdne nad ustawieniami wystroju
tr: Ardalan görünümü geçer

source: Pre-scan BG's
pl: Pre-skanowanie obrazków t³a
tr: Ardalanlarý ön-tara

source: Sort by File
pl: Sortuj wed³ug pliku
tr: Dosyaya göre sýrala

source: Sort by Attr.
pl: Sortuj wed³ug atrybutów
tr: Üzelliklere göre sýrala

source: Sort by Image
pl: Sortuj wed³ug obrazka
tr: Resme göre sýrala

source: Iconbox Settings
pl: Ustawienia Pude³ka na Ikony
tr: Simge kutusu ayarlarý

source: Enlightenment Iconbox Settings Dialog
pl: Okno ustawieñ Pude³ka na Ikony Enlightenment
tr: Enlightenment simge kutusu ayarlarý diyaloðu

source: Transparent background
pl: Przezroczyste t³o
tr: Transparan ardalan

source: Hide border around inner Iconbox
pl: Schowaj obramowanie wewnêtrzne Pude³ka na Ikony
tr: Simge kutusunun içindeki kenarý sakla

source: Show icon names
pl: Pokazuj nazwy Ikon
tr: Simge isimlerini göster

source: Draw base image behind Icons
pl: Umieszczaj za Ikonami obrazek bazowy
tr: Simgenin arkasýnda resim boya

source: Hide scrollbar when not needed
pl: Ukryj pasek przewijania, gdy nie jest portrzebny
tr: Lazým deðilse kayd#_rima çubuðunu gizle

source: Automatically resize to fit Icons
pl: Automatycznie zmieniaj rozmiar, tak aby zmie¶ciæ Ikony
tr: Simgelere göre boyutlandýr

source: Animate when iconifying to this Iconbox
pl: W³±cz animacjê przy zwijaniu do Ikony w tym Pude³ku
tr: Simge kutusuna simgeleþirken hareketlendir

source: Alignment of anchoring when automatically resizing:
pl: Wyrównywanie zaczepienia przy automatycznej zmianie rozmiaru
tr: Otomatikman yeniden boyutlandýrýrken demirlenecek yön :

source: Icon image display policy (if one operation fails, try the next):
pl: Sposób wy¶wietlania ikon (je¿eli która¶ zawiedzie, spróbuj nastêpnej):
tr: Ikona resmi gösterme taktiði ( birisi baþarýsýz olursa , baþkasýný dene ):

source: Snapshot Windows, Use application icon, Use Enlightenment Icon
pl: Zdjêcie Okna, U¿yj Ikony aplikacji, U¿ytj Ikony Enlightenment
tr: Pencereyi yakala, uygulama simgesini kullan, Enlightenment simgesini kullan

source: Use application icon, Use Enlightenment Icon, Snapshot Window
pl: U¿yj Ikony aplikacji, U¿ytj Ikony Enlightenment, Zdjêcie Okna
tr: Uygulama simgesini kullan, Enlightenment simgesini kullan, pencereyi yakala

source: Use Enlightenment Icon, Snapshot Window
pl: U¿ytj Ikony Enlightenment, Zdjêcie Okna
tr: Enlightenment simgesini kullan, pencereyi yakala

source: Icon size
pl: Rozmiar Ikon
tr: Ikona boyutu

source: Orientation:
pl: Orientacja:
tr: Taraflama :

source: Scrollbar side:
pl: Pozycja Paska Przewijania:
tr: Kaydýrma çubuðu tarafý :

source: Scrollbar arrows:
pl: Strza³ki Paska Przewijania:
tr: Kaydýrma çubuðu göstergesi :

source: Horizontal
pl: Poziome
tr: Ufki

source: Left / Top
pl: Lewo / Góra
tr: Sol / Üst

source: Start
tr: Baþla

source: Vertical
pl: Pionowe
tr: Dikey

source: Right / Bottom
pl: Prawo / Dó³
tr: Sað / Alt

source: Both ends
pl: Obydwa koñce
tr: Iki son da

source: End
pl: Koniec
tr: Son

source: None
pl: ¯aden
tr: Hiç biri

source: This window currently does not belong to any groups.
pl: To okno nie nale¿y w tej chwili do ¿adnej grupy.
tr: Bu pencere hiç bir kitlenin üyesi deðil .

source: Window Group Settings
pl: Ustawienia Grup Okien
tr: Pencere kitlesi ayarlarý

source: Enlightenment Window Group Settings Dialog
pl: Okno ustawieñ Grup Okien Enlightenment
tr: Enlightenment pencere kitlesi ayarlarý diyaloðu

source: Pick the group to configure:
pl: Wybierz grupê, któr± chcesz konfigurowaæ :
tr: Ayarlanacak kitleyi seç :

source: The following actions are applied to all group members:
pl: Nastêpuj±ce akcje obejmuj± wszystkich cz³onków grupy:
tr: Bu eylemler bu kitlenin yekin üyelerine etkin edilecektir

source: Changing Border Style
pl: Zmiana stylu obramowania
tr: Kenar deðiþiklikleri

source: Iconifying
pl: Zwijanie do Ikony
tr: Ikonalaþlým

source: Killing
pl: Niszczenie
tr: Öldürülme

source: Moving
pl: Przesuwanie
tr: Taþýnma

source: Raising/Lowering
pl: Podnoszenie / Zag³êbianie
tr: Yükseltme/Alçaltma

source: Sticking
pl: Przyklejanie
tr: Yapýþtýrma

source: Shading
pl: Usuwanie w cieñ
tr: Toplanma

source: Mirror Shade/Iconify/Stick
pl: Usuwanie w Cieñ/Zwijanie do Ikony/Przyklejanie
tr: Toplama/Ikonalaþma/Yapýþ#_týrma aynalanmasý

source: Default Group Control Settings
pl: Ustawienia Domy¶lne Grupy
tr: Önayarlý kitle kontrol ayarlarý

source: Enlightenment Default Group Control Settings Dialog
pl: Okno ustawieñ domy¶lnych Grup Enlightenment
tr: Enlightenment önayarlý kitle kontrol ayarlarý diyaloðu

source: Per-group settings:
pl: Ustawienia dotycz±ce ca³ej grupy:
tr: Kitleye ögzü ayarlar :

source: Global settings:
pl: Ustawienia globalne:
tr: Genel ayarlar :

source: Swap Window Locations
pl: Zamiana po³o¿eñ okien
tr: Pencere yerlerini deðiþtir

source: Remembered Windows Settings
pl: Zapamiêtywane ustawienia okien
tr: Pencere ayarlarýný hatýrla

source: Enlightenment Remembered Windows Settings Dialog
pl: Okno dialogowe Zapamiêtywanych Ustawwieñ Okien Enlightenment
tr: Enlightenment hatýrlanan pencere ayarlarý diyaloðu

source: Remembered Settings...
pl: Zapamiêtywane ustawienia...
tr: Hatýrlanan ayarlar ...

source: There are no active windows with remembered attributes.
pl: Nie ma ¿adnych aktywnych okien z zapamiêtanymi ustawieniami.
tr: Hatýrlanan ayarlarlý geçerli pencere yok.

source: Enlightenment cannot connect to the display nominated by your shell's DISPLAY environment variable. You may set this variable to indicate which display name Enlightenment is to connect to. It may be that you do not have an Xserver already running to serve that Display connection, or that you do not have permission to connect to that display. Please make sure all is correct before trying again. Run an Xserver by running xdm or startx first, or contact your local system administrator, or Xserver vendor, or read the X, xdm and startx manual pages before proceeding.
pl: Enlightenment nie mo¿e siê po³±czyæ z ekranem wskazywanym prze twoj± zmienn± ¶rodowiskow± DISPLAY. Mo¿esz ustawiæ t± zmienn± wskazuj±c Enlightenment, z którym ekranem powinien siê po³±czyæ. Byæ mo¿e nie uruchomi³e¶ jeszcze XSerwera, który tworzy ekran, z którym mo¿na siê po³±czyæ, albo nie masz praw na po³±czeni z ju¿ istniejacym. Upewnij siê, ¿e wszystko jest w porz±dku, zanim spróbujesz ponownie. Uruchom XSerwer wydaj±c komendê starts lub xdm, albo skontaktuj siê z administratorem systemu, lub sprzedawc± XSerwera, preczytaj strony podrêcznika X, xdm i startx zanim podejmiesz dalsze dzia³ania.
tr: Enlightenment komutanýn DISPLAY verimiyle belirtilmiþ yere baðlanamýyor ! Sen bunu yanlýþ yazdýysan , þimdi düzeltebilirsin . Veya sen þu an bir X sunucusu baþlatmadýn ki , Enlightenment o'na baðlansa ; yada senin X-sunucuna baðlanma hakkýn yok . Lütfen bu þartlarýn hepsinin bir tür yerine getirildiðinden emin olup , Enlightenment'i yeniden baþlatmaya dene . O zaman 'xdm' yada 'startx' ile X'i baþlat yada yerel sistem yöneticisiyle iletiþim kurup , derdini o'na , ya da X-sunucusu imalatcýsýný ya da ruh doktorunla görüþ , veya X , xdm ve startx kýlavuzlarýný yeniden denemeden önce bi' oku .

source: X server setup error
pl: B³±d w konfiguracji X Serwera
tr: X sunucusu kurulum hatasý

source: FATAL ERROR: This Xserver does not support the Shape extension. This is required for Enlightenment to run. Your Xserver probably is too old or mis-configured. Exiting.
pl: B£¡D KRYTYCZNY: Ten XSerwer nie wspiera rozszerzenia Shape. Jest ono konieczne, aby Enlightenment siê uruchomi³. Twój XSerwer jest albo za stary, albo ¼le skonfigurowany. Koñczê dzia³anie.
tr: AÐIR HATA : Bu X-sunucusu "Shape"-eklemine sahip deðildir . Fakat bu Enlightenment'in çalýþmasý için gerekli . Ya X-sunucun çok eski , yada doðru ayarlanmamýþtýr . Bitiriyorum .

source: Imlib initialisation error
pl: B³±d w instalacji Imlib
tr: Imlib kurulum hatasý

source: FATAL ERROR: Enlightenment is unable to initialise Imlib. This is unusual. Unable to continue. Exiting.
pl: B£¡D KRYTYCZNY: Enlightenment nie mo¿e zainicjowaæ Imlib. To siê rzadko zdarza. Nie da siê kontynuowaæ. Koñczê dzia³anie.
tr: AÐIR HATA : Enlightenment Imlib'i baþlatamadý . Bu anormaldir . Devam edecek durum kalmadý . Bitiriyorum .

source: FATAL ERROR: Enlightenment is unable to initialise Fnlib. This is unusual. Unable to continue. Exiting.
pl: B£¡D KRYTYCZNY: Enlightenment nie mo¿e zainicjowaæ Fnlib. To siê rzadko zdarza. Nie da siê kontynuowaæ. Koñczê dzia³anie.
tr: AÐIR HATA : Enlightenment Fnlib'i baþlatamadý . Bu anormaldir . Devam edecek durum kalmadý . Bitiriyorum .

source: X server version error
pl: B³±d wersji XSerwera
tr: X sunucu nesil hatasý

source: Ignore this error
pl: Zignoruj ten b³±d
tr: Bu hatayý gözardý et

source: WARNING: This is not an X11 Xserver. It in fact talks the X%i protocol. This may mean Enlightenment will either not function, or function incorrectly. If it is later than X11, then your server is one the author of Enlightenment neither have access to, nor have heard of.
pl: OSTRZE¯ENIE: To nie jest X11 Xserwer. W rzeczywisto¶ci u¿ywa on protoko³u X%i Mo¿e to oznaczaæ, ¿e Enlightenment albo nie bêdzie dzia³a³ albo bêdzie dzia³a³ niepoprawnie. Je¿eli jest on pó¼niejszy ni¿ X11, to do Twojego serwera autor Enlightenment nigdy nie mia³ dostêpu, ani nawet o nim nie s³ysza³.
tr: IKAZ : Bu bir X11 X-sunucus deðil . Gerçek'te X%i protokolünü konuþuyor . Bu Enlightenment'in çalýþtýrmayabilir yada bozuk çalýþmasýna sebebiyet verebilir . Fakat X11'den daha yeniyse , o zaman Enlightenment'in yazarlarýnýn hiç duymadýðý yada eriþemediði bir tanesi idir .

source: The directory %s is apparently not a directory This is a fatal condition. Please remove this file
pl: Katalog %s njwidoczniej nie jest katalogiem. To jest sytuacja krytyczna. Usuñ ten plik.
tr: ´%s´ bir dizin deðildir . Bu aðýr bir hataya yol açtý . Lütfen o dosyayý sil yada baþka bir yere taþý .

source: Do not have execute access to %s This is a fatal condition. Please check the ownership and permissions of this directory and take steps to rectify this.
pl: Brak praw wykonywania do %s To jest sytuacja krytyczna. Sprawd¼ kto jest w³a¶cicielem i jakie s± prawa dostêpu do tego katalogu i spróbuj temu zaradziæ.
tr: ´%s´'yi çalýþtýrma hakkýmýz yok Bu aðýr bir hata idir . Lütfen bu dizinin sahipliðini ve ulaþým haklarýný bir gözden geçir .

source: Do not have read access to %s This is a fatal condition. Please check the ownership and permissions of this directory and take steps to rectify this.
pl: Brak praw odczytu do %s To jest sytuacja krytyczna. Sprawd¼ kto jest w³a¶cicielem i jakie s± prawa dostêpu do tego katalogu i spróbuj temu zaradziæ.
tr: ´%s´'yi okuma hakkýmýz yok Bu aðýr bir hata idir . Lütfen bu dizinin sahipliðini ve ulaþým haklarýný bir gözden geçir .

source: Do not have write access to %s This is a fatal condition. Please check the ownership and permissions of this directory and take steps to rectify this.
pl: Brak praw zapisu do %s To jest sytuacja krytyczna. Sprawd¼ kto jest w³a¶cicielem i jakie s± prawa dostêpu do tego katalogu i spróbuj temu zaradziæ.
tr: ´%s´'yi yazma hakkýmýz yok Bu aðýr bir hata idir . Lütfen bu dizinin sahipliðini ve ulaþým haklarýný bir gözden geçir .

source: Remembered Application Attributes
pl: Zapamiêtywane Ustawienia Aplikacji
tr: Hatýrlanan uygulama özellikleri

source: Select the attributes of this window you wish to Remember from now on
pl: Wybierz Ustawienia tego okna które chcesz od tego momentu zapamiêtaæ.
tr: Bu pencerenin þimdiden sonra hatýrlanmasýný istediðin özellikleri seç

source: Title:
pl: Tytu³:
tr: Baþlýk :

source: Name:
pl: Nazwa:
tr: Isim :

source: Class:
pl: Klasa:
tr: Sýnýf :

source: Command:
pl: Komenda:
tr: Komuta :

source: Location
pl: Pozycja
tr: Yer

source: Border style
pl: Styl Obramowania
tr: Kenar tipi

source: Size
pl: Rozmiar
tr: Boyut

source: Desktop
pl: Pulpit
tr: Masaüstü

source: Shaded state
pl: Stan Usuniêcia w Cieñ
tr: Toplanmýþ

source: Sticky state
pl: Stan Przyklejania
tr: Yapýþýk

source: Stacking layer
pl: Poziom
tr: Býrakým seviyesi

source: Window List Skip
pl: Pomijanie w Li¶cie Okien
tr: Pencere çizgiyesinde kaydetme

source: Never Focus
pl: Nigdy Nie Aktywuj
tr: Katiyyen foküsleme

source: Restart application on login
pl: Uruchom aplikacjê przy logowaniu
tr: Giriþ'te uygulamayý yeniden baþlat

source: Remember this window's group(s)
pl: Zapamiêtaj grupy tego okna
tr: Pencere(ler)in kitlesini hýfzet

source: Error saving snaps file
pl: B³±d w zapisie pliku zdjêæ
tr: Yakalam dosyasýný kaydederken hata oldu

source: Error finding sound file
pl: B³±d przy znajdowaniu pliku d¼wiêkowego
tr: Ses dosyasýný ararken hata oldu

source: Warning! Enlightenment was unable to load the following sound file: %s Enlightenment will continue to operate, but you may wish to check your configuration settings.
pl: Ostrze¿enie! Enlightenment nie by³ w stanie za³adowaæ nastêpuj±cego pliku d¼wiêkowego: %s Enlightenment bêdzie dalej dzia³a³, ale byæ mo¿e zechcesz sprawdziæ swoj± koniguracjê.
tr: Ikaz ! Enlightenment ´%s´ ses dosyasýný yükleyemedi . Enlightenment çalýþmaya devam edecektir , fakat sen ayar dosyalarýný bir gözden geçirmek istersin ( herhalde ) .

source: Error initialising sound
pl: B³±d przy inicjalizacji d¼wiêku
tr: Sesi baþlatýrken hata oldu

source: Audio was enabled for Enlightenment but there was an error communicating with the audio server (Esound). Audio will now be disabled.
pl: W³±czono obs³ugê d¼wiêku Enlightenment, ale wyst±pi³ b³±d przy komunikacji z serwerem Audio (Esound). D¼wiêk zostanie teraz wy³±czony.
tr: Enlightenment'i sesle çalýþmak için ayarlanmýþ , ama E ses sunucusuyla iletiþim kurarken ("Esound") hata oldu . Ses kapatýlcaktýr .

source: TextClass Error!
pl: B³±d sekcji TextClass
tr: TextClass hatasý!

source: Unknown
pl: Nieznany
tr: Bilinmiyor

source: Theme file/directory does not exist
pl: Plik/katalog wystroju nie istnieje
tr: Görünüm dosyasý/dizini yok

source: The theme: %s Is a badly formed theme package and is thus not being used. Enlightenment has fallen back to using the DEFAULT theme. The reason this theme is bad is: %s
pl: Wystrój: %s jest ¼le skonstruowanym wystrojem i przez to nie jest u¿ywany. Enlightenment powróci³ do u¿ywanie wystroju domy¶lnego (DEFAULT). Powodem dla którego ten wystrój jest z³y jest:%s
tr: ´%s´ görünümü hataya yol açtý Düzügün bir yapýya sahip olmadýðý için Enlightenment þimdi önayarlý görünümüne geçecektir . Bu görünümün kötü oluþunun nedeni de ´%s´ idir

source: Bad Theme
pl: Z³y wystrój
tr: Kütü görünüm

source: ToolTip Error!
pl: B³±d podpowiedzi
tr: ToolTip hatasý!

source: Enlightenment's message of the day
pl: Wiadomo¶æ dnia Enlightenment
tr: Enlightenment'den günün mesajý

source: Place windows on another head when full
pl: Rozmieszczaj okna na kolejnym ekranie gdy jest pe³no
