Repository: kakaroto/e17
Catalog: e16/e/po/*.po
Languages: pl, tr

source: WARNING!!!!!! Allocation for %i bytes (%3.0f kB or %3.1f MB) did not succeed. Either this is a bug where ridiculous amounts of memory are being allocated, or your system has run out of both real and virtual memory and is unable to satisfy the request. If you have a low memory system it is suggested to either purchase more memory, increase SWAP space, or reconfigure Enlightenment to use less resources by turning features off. The malloc requested was at %s, line %d
pl: OSTRZE¯ENIE!!! Nie powiod³o siê przydzielenie %i bajtów (%3.0f kB or %3.1f MB) Albo powsta³ b³±d, powoduj±cy przydzielanie bardzo du¿ych bloków pamiêci, albo w Twoim systemie skoñczy³a siê zarówno pamiêæ fizyczna jak i wirtualna i nie da siê zrealizowaæ ¿±dania Je¿eli Twój system am ma³o pamêci, doradzamy zakup wiêkszej jej ilo¶ci, zwiekszenie przestrzeni SWAP, lub rekonfiguracjê Enlightenment i zmniejszenie zapotrzebowania na pamiêæ poprzez wy³±czenie funkcji. ¯±danie malloc znajdowa³o siê w %s, linia %d
tr: IKAZ !!!!! %i bayt için hafýza ayrýlanamadý (%3.0f kB yada %3.1f MB ) . Bu ya bir aðýr ve korunabilinir hatadan dolayý gülünecek miktarda hafýzayý ayýrtmaya udraþýyor . Yada sistemin toplam sanal ve gerçek belleðin tükendi ( yani istenilien hafýza vallahi yok ) . Az bellekli bir sistemle çalýþýyorsan , ya daha fazla bellek satýn an ;-) , ya takas alanýný arttýr veya Enlightenment'in deðiþik ayarlarýný öyle deðiþtir ki , bazý bellek harcayýcý özellikler kapalý kalsýn . Hafýzayý isteyen ´malloc´ %s idi , satýr %d

source: Error in reallocating memory that hasn't been allocated
pl: B³±d przy zmianie przydzielenia pamiêci wcze¶niej nie przydzielonej
tr: Hafýzanýn yeniden ayrýlmasýnda bir hata oldu

source: WARNING!!!!!! Re-allocation for %i bytes (%3.0f kB or %3.1f MB) for pointer %x is attempting to re-allocate memory for a memory chunk that has not been allocated or has already been freed. This is definitely a bug. Please report it. The error occurred at %s, line %d.
pl: OSTRZE¯ENIE!!! Ponowne przydzielenie %i bajtów (%3.0f kB lub %3.1f MB) wska¼nikowi %x jest prób± ponownego przydzielenia pamiêci która nie zosta³a wcze¶niej przydzielona, lub zosta³a ju¿ wcze¶niej zwolniona Jest to na pewno b³±d w programie. Prosimy o jego zg³oszenie B³±d wyst±pi³ w %s, linia %d.
tr: IKAZ !!!!!! %i bayt için yeniden hafýza ayýrtalamadý ( %3.0f kB yada %3.1f MB ) [ %x göstergesi için ] , boþaltýlmýþ yada ayýrtalmayan bir hafýza bölgesinden hafýza istiyor . Bu aðýr bir yazýlým hatasýdýr ; lütfen bir hata raporu gönder . Hata#_nýn oluþtuðu yer : %s , satýr %s .

source: WARNING!!!!!! Re-allocation for %i bytes (%3.0f kB or %3.1f MB) did not succeed. Either this is a bug where ridiculous amounts of memory are being allocated, or your system has run out of both real and virtual memory and is unable to satisfy the request. If you have a low memory system it is suggested to either purchase more memory, increase SWAP space, or reconfigure Enlightenment to use less resources by turning features off. The realloc requested was at %s, line %d
pl: OSTRZE¯ENIE!!! Ponowne przydzielenie %i bajtów (%3.0f kB lub %3.1f MB) nie powiod³o siê Albo powsta³ b³±d, powoduj±cy przydzielanie bardzo du¿ych bloków pamiêci, albo w Twoim systemie skoñczy³a siê zarówno pamiêæ fizyczna jak i wirtualna i nie da siê zrealizowaæ ¿±dania Je¿eli Twój system am ma³o pamêci, doradzamy zakup wiêkszej jej ilo¶ci, zwiekszenie przestrzeni SWAP, lub rekonfiguracjê Enlightenment i zmniejszenie zapotrzebowania na pamiêæ poprzez wy³±czenie funkcji. ¯±danie malloc znajdowa³o siê w %s, linia %d
tr: IKAZ !!!!! %i bayt için yeniden hafýza ayrýlanamadý (%3.0f kB yada %3.1f MB ) . Bu ya bir aðýr ve korunabilinir hatadan dolayý gülünecek miktarda hafýzayý ayýrtmaya udraþýyor . Yada sistemin toplam sanal ve gerçek belleðin tükendi ( yani istenilien hafýza vallahi yok ) . Az bellekli bir sistemle çalýþýyorsan , ya daha fazla bellek satýn an ;-) , ya takas alanýný arttýr veya Enlightenment'in deðiþik ayarlarýný öyle deðiþtir ki , bazý bellek harcayýcý özellikler kapalý kalsýn . Hafýzayý isteyen ´realloc´ %s idi , satýr %d

source: Error in freeing memory that hasn't been allocated
pl: B³±d przy próbie zwolnienia nie przydzielonej pamiêci
tr: Ayrýlmamýþ hafýzanýn "serbest býrakýlmasýnda" bir hata oldu

source: WARNING!!!!!! freeing for pointer %x is attempting to free memory for a memory chunk that has not been allocated, or has already been freed. This is definitely a bug. Please report it. The error occurred at %s, line %d.
pl: OSTRZE¯ENIE!!! Zwalnianie pamiêci dla wska¼nika %x jest prób± zwolnienia nie przydzielonej pamiêci, lub pamiêci, która ju¿ wcze¶niej zosta³a zwolniona Jest to na pewno b³±d w programie. Prosimy o jego zg³oszenie B³±d wyst±pi³ w %s, linia %d.
tr: IKAZ !!!!! %x göstergesi boþaltýlýrken bir aðýr hata oluþtu ! Bunun nedeni zaten boþaltýlmýþ bir göstergenin yeninden boþaltýlmasýnýn bir sonucu olabilir . Bu tabii ki , bir yazýlým hatasýdýr . Lütfen bunu rapor et . Hata burada oluþtu : %s , satýr %d .

source: Error in attempting to free NULL pointer
pl: B³±d przy próbie zwolnienia pamiêci dla wska¼nika NULL
tr: NULL göstergesini serbest etmeye uðraþýldý

source: Ignore this (safe)
pl: Zignoruj (bezpieczne)
tr: Bunu geç (güvenlidir)

source: WARNING!!!!!! Enlightenment attempted to free a NULL pointer. This is definitely a bug. Please report it. It is safe to ignore this error and continue running Enlightenment. The pointer value was %x. The error occurred at %s, line %d.
pl: OSTRZE¯ENIE!!! Enlightenment próbowa³ zwolniæ pamiêæ dla wska¼nika NULL. Jest to na pewno b³±d w programie. Prosimy o jego zg³oszenie Mo¿na go bezpiecznie zignorowaæ i kontynuowaæ dzia³anie Enlightenment. Warto¶æ wska¼nika wynosi³a %x. B³±d wyst±pi³ w %s, linia %d.
tr: IKAZ !!!!!!!! Enlightenment bir NULL göstergesini boþaltmaya uðraþtý . Bu aðýr bir yazýlým hatasýdýr . Bunu lütfen rapor et . Enlightenment'i devamen çalýþtýrmak güvenli olabilir . Gösterge deðeri %x idi . Hata'nýn oluþtuðu yer : %s , satýr %s .

source: Go to this Desktop
pl: Przejd¼ do tego Pulpitu
tr: Bu masaüstüne geç

source: Desktop %i
pl: Pulpit %i
tr: Masaüstü %i

source: Show/Hide this group
pl: Poka¿/Ukryj t± grupê
tr: Bu kitleyi göster/gizle

source: Iconify this group
pl: Zwiñ t± grupê do ikony
tr: Bu kitleyi simgeleþtir

source: Group %i
pl: Grupa %i
tr: Kitle %i

source: !!!!!!!! ERROR ERROR ERROR ERROR !!!!!!!! Enlightenment's utility executable cannot be found at: %s This is a fatal error and Enlightenment will cease to run. Please rectify this situation and ensure it is installed correctly. The reason this could be missing is due to badly created packages, someone manually deleting that program or perhaps an error in installing Enlightenment.
pl: !!!!!!!! B£¡D B£¡D B£¡D B£¡D !!!!!!!! Nie znaleziono progrmau pomocniczego Enlightenment w: %s Jest to b³±d krytyczny i Enlightenment zakoñczy dzia³anie. Spróbuj zaradziæ tej sytuacji i zainstaluj poprawnie ten program. Powodem braku mo¿e byæ ¼le przygotowany plik instalacyjny, rêczne skasowanie pliku, lub b³±d w instalacji Enlightenment.
tr: !! HATA HATA HATA HATA HATA ( Reha Muhtar'sýz ;-) ) !! Enlightenment'in uygulama baþlatýcýsý burada bulunamadý : %s Bu aðýr bir hatadýr ve Enlightenment çalýþmayý durdurcaktýr . Lütfen bu durumabir göz at ve Enlightenment'in parçalarýnýn doðruca yüklendiðini te'min et . Ya yanlýþ haz#-irlanmýþ bir paketi kullanýyorsun , ya baþka biri ( yada sen ) bu uygulamayý sildi yada Enlightenment tamamen ve doðruca yüklendmedi .

source: !!!!!!!! ERROR ERROR ERROR ERROR !!!!!!!! Enlightenment's dox executable is not able to be executed: %s This is a fatal error and Enlightenment will cease to run. Please rectify this situation and ensure dox is installed correctly.
pl: !!!!!!!! B£¡D B£¡D B£¡D B£¡D !!!!!!!! Nie znaleziono progrmau pomocniczego Enlightenment dox w: %s Jest to b³±d krytyczny i Enlightenment zakoñczy dzia³anie. Spróbuj zaradziæ tej sytuacji i upewnij siê, ¿e dox jest zaistalowany poprawnie.
tr: !! HATA HATA HATA HATA HATA ( Reha Muhtar'sýz ;-) ) !! Enlightenment'in yardým gösterme uygulamasý bulunamadý : %s Bu aðýr bir hatadýr ve Enlightenment çalýþmayý durdurcaktýr . Lütfen bu duruma bir göz at ve dox'un doðruca yüklendiðini te'min et . Dox Enlightenment'in yardým gösterme uygulamasýdýr .

source: !!!!!!!! ERROR ERROR ERROR ERROR !!!!!!!! Enlightenment's documentation is not present or correctly installed This is a fatal error and Enlightenment will cease to run. Please rectify this situation and ensure it is installed correctly. The reason this could be missing is due to badly created packages, someone manually deleting those files or perhaps an error in installing Enlightenment.
pl: !!!!!!!! B£¡D B£¡D B£¡D B£¡D !!!!!!!! Nie znaleziono dokumentacji Enlightenment. Jest to b³±d krytyczny i Enlightenment zakoñczy dzia³anie. Spróbuj zaradziæ tej sytuacji i zainstaluj poprawnie ten program. Powodem braku mo¿e byæ ¼le przygotowany plik instalacyjny, rêczne skasowanie plików, lub b³±d w instalacji Enlightenment.
tr: !! HATA HATA HATA HATA HATA ( Reha Muhtar'sýz ;-) ) !! Enlightenment'in yardým dosyalarý bulunamadý : %s Bu aðýr bir hatadýr ve Enlightenment çalýþmayý durdurcaktýr . Lütfen bu durumabir göz at ve Enlightenment'in parçalarýnýn doðruca yüklendiðini te'min et . Ya yanlýþ haz#-irlanmýþ bir paketi kullanýyorsun , ya baþka biri ( yada sen ) bu uygulamayý sildi yada Enlightenment tamamen ve doðruca yüklendmedi .

source: !!!!!!!! ERROR ERROR ERROR ERROR !!!!!!!! Enlightenment's DEFAULT installed theme is missing or inadequately configured to be a useful DEFAULT theme. This is a fatal error and Enlightenment will cease to run. Please rectify this situation and ensure it is installed correctly. The DEFAULT theme Enlightenment comes with normally is BrushedMetal-Tigert and this theme is adequate for a DEFAULT theme.
pl: !!!!!!!! B£¡D B£¡D B£¡D B£¡D !!!!!!!! Domy¶lny wystrój Enlightenment jest ¼le skonfigurowany, lub wcale go nie ma. Jest to b³±d krytyczny i Enlightenment zakoñczy dzia³anie. Spróbuj zaradziæ tej sytuacji i zainstaluj poprawnie ten wystrój. Zwykle domy¶lnym wystrojem Enlightenment jest wystrój BrushedMetal-Tigert, który jest przystosowany do tej funkcji
tr: !! HATA HATA HATA HATA HATA ( Reha Muhtar'sýz ;-) ) !! Enlightenment'in DEFAULT görünümü bulunamadý yada doðru dürüst kullanýlacak halde deðil . Bu aðýr bir hatadýr ve Enlightenment çalýþmayý durdurcaktýr . Lütfen bu duruma bir göz at ve bu yükleme hatasýný düzelt . Enlightenment'in DEFAULT görünümü normalen "BrushedMetal-Tigert"'dir . Bu görünüm tabii ki Enlightenment'le beraber doðruca çalýþýyor .

source: Theme does not contain a borders.cfg file
pl: Wystrój nie zawiera pliku borders.cfg
tr: Görünümün "borders.cfg" dosyasý eksik

source: Theme does not contain a buttons.cfg file
pl: Wystrój nie zawiera pliku buttons.cfg
tr: Görünümün "buttons.cfg" dosyasý eksik

source: Theme does not contain a colormodifiers.cfg file
pl: Wystrój nie zawiera pliku colormodifiers.cfg
tr: Görünümün "colormodifiers.cfg" dosyasý eksik

source: Theme does not contain a cursors.cfg file
pl: Wystrój nie zawiera pliku cursors.cfg
tr: Görünümün "cursors.cfg" dosyasý eksik

source: Theme does not contain a desktops.cfg file
pl: Wystrój nie zawiera pliku desktops.cfg
tr: Görünümün "desktop.cfg" dosyasý eksik

source: Theme does not contain a imageclasses.cfg file
pl: Wystrój nie zawiera pliku imagesclasses.cfg
tr: Görünümün "imageclasses.cfg" dosyasý eksik

source: Theme does not contain a init.cfg file
pl: Wystrój nie zawiera pliku init.cfg
tr: Görünümün "init.cfg" dosyasý eksik

source: Theme does not contain a menustyles.cfg file
pl: Wystrój nie zawiera pliku menustyles.cfg
tr: Görünümün "menustyles.cfg" dosyasý eksik

source: Theme does not contain a slideouts.cfg file
pl: Wystrój nie zawiera pliku slideouts.cfg
tr: Görünümün "slideouts.cfg" dosyasý eksik

source: Theme does not contain a sound.cfg file
pl: Wystrój nie zawiera pliku sound.cfg
tr: Görünümün "sound.cfg" dosyasý eksik

source: Theme does not contain a tooltips.cfg file
pl: Wystrój nie zawiera pliku tooltips.cfg
tr: Görünümün "tooltips.cfg" dosyasý eksik

source: Theme does not contain a windowmatches.cfg file
pl: Wystrój nie zawiera pliku windowmatches.cfg
tr: Görünümün "windowmatches.cfg" dosyasý eksik

source: Theme contains a menus.cfg file
pl: Wystrój zawiera plik menus.cfg
tr: Görünümün bir "menus.cfg" dosyasý var

source: Theme contains a control.cfg file
pl: Wystrój zawiera plik control.cfg
tr: Görünümün bir "control.cfg" dosyasý var

source: Theme contains a keybindings.cfg file
pl: Wystrój zawiera plik keybindings.cfg
tr: Görünümün bir "keybindings.cfg" dosyasý var

source: Module is Already Loaded.
pl: Modu³ jest ju¿ za³adowany.
tr: Modül zaten yüklü .

source: Module Failed During Load.
pl: Modu³ zawiód³ poczas ³adowania.
tr: Modül yükleme sürecinde hat oldu .

source: Module Unload Failed.
pl: Nie powiod³o siê usuniêcie modu³u.
tr: Modül ayýrma sürecinde bir hata oldu.

source: Module is not Loaded.
pl: Modu³ nie jest za³adowany.
tr: Modül yüklü deðil.

source: Unknown Module Error.
pl: Nieznany b³±d modu³u.
tr: Bilinmeyen modül hatasý .

source: Warning!
pl: Ostrze¿enie !
tr: Ikaz !

source: You seem to have an X Server capable of Shared Memory but it is incapable of doing ZPixmap Shared pixmaps (The server does not claim to be able to do them). The pager in Enlightenment will run slowly in snapshot mode if you continue to use that mode of the pager under these conditions. It is suggested you change the settings on your pager to disable snapshots to improve performance.
pl: Twój X Serwer ma wbudowan± funkcjê Shared Memory ale nie ma funkcji ZPixmap Shared (Serwer nie twierdzi, ¿e j± obs³uguje). Podgl±d Pulpitu w trybie Zdjêcia Ekranu w Enlightenment bêdzie w tych warunkach dzia³±³ wolno. Doradzam, aby¶ zmieni³ ustawienia Podgl±du Pulpitu i wy³±czy³ opcjê 'Zdjêcie Ekranu'
tr: Bölüþülebilinir hafýza özelliðine sahip bir X-sunucun var , ama ZPixmap bölüþülebilinir resimcikler özelliði ortada yok gibi . ( X-sunucusu böyle bir özelliðe sahip olmadýðýný açýklýyor ) . Enlightenment gözeyi ufacýk resimler modüsünde çalýþtýrmak istiyorsan , bu þartlar altýnda gözey acaipce yavaþ çalýþacaktýr . Performansý artýrmak için gözey özelliklerinde ufacýk resimler özelliðini kapatman tavsiye edilir .

source: Your X Server is capable of doing Shared Memory but you do not have Shared Pixmaps enabled in your Imlib configuration. Please enable Shared Pixmaps in your Imlib configuration then restart Enlightenment to gain better performance for the pagers when snapshot mode is enabled.
pl: Twój X Serwer obs³uguje rozszerzenie Shared Memory, ale nie w³±czono obs³ugi Shared Memory w bibliotece Imlib W³±cz opcjê 'Shared Pixmaps' w konfiguracji Imlib, nastêpnie uruchom ponownie Enlightenment - dziêki temu uzyskasz lepsz± wydajno¶æ w trybie 'Zdjêcie Ekranu'
tr: Senin X-sunucun bölüþülebilinir hafýza özelliðine sahiptir , ama bölüþülebilinir resimcikler özelliði ortada gözükmüyor . Lütfen ya Imlib ayarlarýnda bölüþülebilinir resimcikleri aç ve böylece de Enlightenment'in daha yüksek perfermansla çalýþmasýný saðlayacaktýr ( özellikler gözey için çok iyidir ) .

source: You seem to be running Enlightenment over a network Connection or on an X Server that does not support Shared Memory, or you have disabled MIT-SHM Shared memory in your Imlib configuration. This means the Enlightenment Pager will perform slowly and use more system resources than it would when Shared Memory is available. To improve performance please either enable MIT-SHM Shared Memory in your Imlib config, if you disabled it, or disable Pager snapshots.
pl: Wydaje siê, ¿e albo uruchomi³e¶ Enlightenment poprzez sieæ albo twój X Serwer nie wspiera rozszerzenia Shared Memory, albo wy³±czy³e¶ opcjê MIT-SHM Shared Memory w konfiguracji Imlib Oznacza to, ¿e Podgl±d Pulpitu Enlightenment bêdzie dzia³a³ wolno i bêdzie zuzywa³ wiêcej zasobów systemowych ni¿ gdyby dzia³a³ przy w³±czonej opcji Shared Memory Aby zwiêkszyæ szybko¶æ dzia³ania albo w³±cz obs³uge opcji MIT-SHM w konfiguracji Imlib, je¿eli jest wy³±czona, albo wy³±cz opcjê 'Zdjêcie Ekranu' Podgl±du Pulpitu
tr: Enlightenment'i bir að baðlantýsý yada bölüþülebilinir hafýza özelliðine sahip olmayan X-sunucusunda çalýþtýrmaya uðraþýyorsin . Yada Imlib ayarlarýnda MIT-SHM bölüþülebilinir hafýza özelliðini kapattýn .Bu Enlightenment'in gözeyinin ( pager'inin ) gereðinden çok daha fazla yavaþ ve çirkince çalýþmasýna sebebiyet verecek . Ayrýca sistemini daha meþgul edecektir ; öylece bu özelliði lütfen aç . Bu mümkün deðilse , MIT-SHM bölüþülebilinir hafýza özelliðini Imlib ayarlarýnda aç , yada bu özelliði kapat veya Enlightenment'te gözey'in ufacýk resimler gösterme özelliðini kapatabilirsin .Sistemin sana teþekkür edecektir .

source: Window Options
pl: Opcje Okna
tr: Pencere ayarlarý

source: Iconify
pl: Zwiñ do Ikony
tr: Simgeleþtir

source: Annihilate
pl: Zniszcz
tr: Öldür

source: Stick / Unstick
pl: Przyklej/Odklej
tr: Yapýþtýr/Serbest'et

source: Desktop Options
pl: Opcje pulpitu
tr: Masaüstü ayarlarý

source: Pager Settings...
pl: Opcje Podgl±du Pulpitu...
tr: Gözey ayarlarý ...

source: Snapshotting On
pl: W³±cz 'Zdjêcie Ekranu'
tr: Ekranlamayý aç

source: Snapshotting Off
pl: Wy³±cz 'Zdjêcie Ekranu'
tr: Ekranlamayý kapat

source: High Quality On
pl: W³±cz Wysok± Jako¶æ
tr: Yüksek kaliteyle

source: High Quality Off
pl: Wy³±cz Wysok± Jako¶æ
tr: Yüksek kalitesiz

source: There was an error writing the clients session save file. You may have run out of disk space, not have permission to write to your filing system or other similar problems.
pl: Wyst±pi³ b³±d przy zapisie pliku sesji klienta. Byc mo¿e skoñczy³a Ci siê przestrzeñ dyskowa, nie masz praw zapisu, lub wyst±pi³ inny, podobny problem
tr: Kulanýcý oturum kayýt dosyasýný kaydederken hata oldu. Yeterince boþ disk alaný kalmamýþ olabilir, gerekli olan ulaþým haklarýna sahip olmayabilirsin yada baþka sorunlar olabilirsin .

source: There was an error saving your autosave data - filing system problems.
pl: Wyst±pi³ b³±d przy zapisie pliku autosave. Byc mo¿e skoñczy³a Ci siê przestrzeñ dyskowa, nie masz praw zapisu, lub wyst±pi³ inny, podobny problem
tr: Otomatikman kaydedilecek bilgileri kaydedemedim - sistem dosyalama hatasýndan dolayý

source: ERROR! Lost the Session Manager that was there? Here here session manager... come here... want a bone? Oh come now! Stop sulking! Bugger. Oh well. Will continue without a session manager. I'll survive somehow. ... I hope.
pl: B³±d ! Znikn±³ Session Manager, który poprzednio tam by³? No chod¼ session managerku... no chod¼... mo¿e chcesz kosteczkê? No chod¼ wreszcie! Przestañ siê d±saæ! Frajer. No có¿. Dzia³am dalej bez session managera. Jako¶ sobie poradzê. ... Tak± mam nadziejê.
tr: HATA ! Oturum yöneticisini kaybettim ?!? Cici oturum yöneticisi , buraa gel , bir þeker verceeem ! Gel be ! Nerdesin ! Gelmüün müsün , oldu ; sensiz de devam edeceðim, oturum yöneticisi olmadan . Ben zaten hayata devam edeceðim ! ... inþallah !

source: Are you sure you wish to log out ?
pl: Czy na pewno chcesz siê wylogowaæ ?
tr: Enlightenment'den çýkmak istediðinden emin misin ?

source: Yes, Log Out
pl: Tak, Wyloguj siê
tr: Evet, çýk

source: No
pl: Nie
tr: Hayýr

source: Pager scanning speed:
pl: Szybko¶æ skanowania w Podgl±dzie Pulpitu:
tr: Gözey tarama hýzý :

source: lines per second
pl: linii na sekundê
tr: satýr/saniyede

source: Pager Settings
pl: Ustawienia Podgladu Pulpitu
tr: Gözey ayarlarý

source: Enlightenment Desktop & Area Pager Settings Dialog
pl: Okno ustawieñ Podgl±du Pulpitu Enlightenment
tr: Enlightenment masaüstü & bölge gözey ayarlarý diyaloðu

source: Enable pager display
pl: W³±cz Podgl±d Pulpitu
tr: Gözey gösterimini aç

source: Make miniature snapshots of the screen
pl: Rób miniaturowe zdjêcia ekranu
tr: Ekranýn ufacýk resimlerini çek

source: Smooth high quality snapshots in snapshot mode
pl: Wyg³adzaj wysokiej jako¶ci zdjêcia w trybie 'Zdjêcia Ekranu'
tr: Ufacýk resimlerde ufak bir puslama yap

source: Zoom in on pager windows when mouse is over them
pl: Powiêksz okna w Podgl±dzie Pulpitu, gdy jest nad nimi wska¼nik myszy
tr: Güzey'de fare bir pencerenin üzerinde vardýðý zaman "zoom" yap

source: Pop up window title when mouse is over the window
pl: Wy¶wietl tytu³ okna, gdy jest nad nim wska¼nik myszy
tr: Fare pencerenin üstünde olduðu zaman pencere üstyazýs#_ný aç

source: Continuously scan screen to update pager
pl: Skanuj bez przerwy ekran i uaktualniaj Podgl±d Pulpitu
tr: Gözey'i yenilemek için ekraný daima tara

source: Mouse button to select and drag windows:
pl: Przycisk myszy s³u¿acy do wybierania i przeci±gania okien :
tr: Pencereleri seçme ve taþýma tuþu :

source: Left
pl: Lewo
tr: Sol

source: Middle
pl: ¦rodek
tr: Orta

source: Right
pl: Prawo
tr: Sað

source: Mouse button to select desktops:
pl: Przycisk myszy s³u¿±cy do wybierania Pulpitów :
tr: Masaüstünün seçme fare tuþu :

source: Mouse button to display pager menu:
pl: Przycisk myszy s³u¿acy do wy¶wietlania menu Podgl±du Pulpitu :
tr: Gözey mönüsünü gösterten fare tuþu :

source: Apply
pl: Zastosuj
tr: Uygula

source: Focus Settings
pl: Ustawienia Aktywacji
tr: Foküsleme ayarlarý

source: Enlightenment Focus Settings Dialog
pl: Aktywacja Enlightenment Okno ustawieñ
tr: Enlightenment foküsleme ayarlarý diyaloðu

source: Focus follows pointer
pl: Aktywacja pod±¿a za kursorem
tr: Foküs göstergeyi takip ediyor

source: Focus follows pointer sloppily
pl: Aktywacja pod±za leniwie za kursorem
tr: Foküs göstergeyi yavaþ takip ediyor

source: Focus follows mouse clicks
pl: Aktywacja pod±¿a za klikniêciami myszy
tr: Foküs fare týklamalarýný takip ediyor

source: Clicking in a window always raises it
pl: Klikniêcie w oknie zawsze je Aktywuje
tr: Pencereye týklanýnca pencereyi yükselt

source: All new windows first get the focus
pl: Wszystkie nowe okna s± najpierw Aktywowane
tr: Ilken pencere çikarsa o'nu foküsla

source: Only new dialog windows get the focus
pl: Aktywowane s± tylko nowe okna dialogowe
tr: Sadece yeni diyalok pencereleri foküs alýr

source: Only new dialogs whose owner is focused get the focus
pl: Aktywowane s± tylko okna dialogowe, których w³a¶ciciel jest aktywny
tr: Sadece sahibi foküslü olan yeni diyalok pencereleri foküs alýr

source: Raise windows on focus switch
pl: Podno¶ okna przy zmianie Aktywacji
tr: Foküs deðiþiminde pencereleri yükselt

source: Send mouse pointer to window on focus switch
pl: Przesuñ wska¼nik myszy do Aktywowanego okna
tr: Foküs deðiþiminde fareyi pencereye gönder

source: Display and use focus list
pl: Wy¶wietl i uzywaj listy Aktywacji
tr: Göster ve foküsleme listesini kullan

source: Include sticky windows in focus list
pl: W³±cz okna przyklejone do listy aktywacji
tr: Yapýþýk pencereleri foküsleme listesinde içer

source: Include shaded windows in focus list
pl: W³±cz onka w cieniu do listy Aktywacji
tr: Toplanmýþ pencereleri foküsleme listesinde içer

source: Include iconified windows in focus list
pl: W³±cz okna zwiniête do ikony do listy Aktywacji
tr: Simgeleþtirilmiþ pencereleri foküsleme listesinde içer

source: Focus windows while switching
pl: Aktywuj okna podczas prze³±czania
tr: Pencere deðiþtirirken pencereleri foküsle

source: Raise windows after focus switch
pl: Podno¶ okna po prze³±czeniu Aktywacji
tr: Foküs deðiþiminden sonra pencereleri yükselt

source: Send mouse pointer to window after focus switch
pl: Wy¶lij wska¼nik myszy do okna po prze³±czeniu Aktywacji
tr: Foküs deðiþimden sonra fareyi pencereye gönder

source: Move & Resize Settings
pl: Ustawienia Przesuwania i Zmiany rozmiaru
tr: Boyutlandýrma & Taþýma þekilleri

source: Enlightenment Move & Resize Method Settings Dialog
pl: Okno ustawieñ metod Przesuwania i Zmieniania Rozmiaru Enlightenment
tr: Enlightenment Taþýma & boyutlandýrma türleri ayarlarý diyaloðu

source: Move Methods:
pl: Metody Przesuwania
tr: Taþýma þekli :
