Repository: kakaroto/e17
Catalog: e_modules/news/po/*.po
Languages: hu

source: Config init failed
hu: Konfiguráció nem sikerült

source: Parser init failed
hu: Értelmező indítás nem sikerült

source: Feeds init failed
hu: Csatorna indítás nem sikerült

source: Viewer init failed
hu: Nézegető indítás nem sikerült

source: Popup subsystem init failed
hu: Felbukkanó alrendszer indítás nem sikerült

source: News
hu: Hírek

source: <hilight>News module : Configuration Upgraded</hilight><br><br>Your configuration of news module<br>has been upgraded<br>Your settings were removed<br>Sorry for the inconvenience<br><br>(%d -> %d)
hu: <hilight>Hírek modul: Beállítás frissítve</hilight><br><br> A Hírek modul konfigurációja <br>frissítve,<br> korábbi beállítások törölve. Elnézést.<br><br>(%d -> %d)

source: <hilight>News module : Configuration Downgraded</hilight><br><br>Your configuration of News module<br>has been downgraded<br>Your settings were removed<br>Sorry for the inconvenience<br><br>(%d ->%d)
hu: <hilight>Hírek modul: Beállítás visszaállítva</hilight><br><br> A Hírek modul konfigurációja <br>visszaállítva,<br> korábbi beállítások törölve. Elnézést.<br><br>(%d -> %d)

source: News Main Configuration
hu: Hírek fő beállításai

source: Feeds
hu: Csatornák

source: Sort lists by name (disable Move action)
hu: Lista rendezés név szerint (mozgás letiltva)

source: News Viewer
hu: Hírolvasó

source: Font size
hu: Betűméret

source: Font color
hu: Szövegszín

source: Timer
hu: Időmérő

source: %1.0f min
hu: %1.0f perc

source: Browser
hu: Böngésző

source: Uses xdg-open script, from freedesktop.org
hu: Használd az xdg-open parancsot, a freedasktop.org-ról

source: Popup On News
hu: Felugró ablak a hírekben

source: Never
hu: Soha

source: Only on urgent feeds
hu: Csak fontos hír esetén

source: On all feeds
hu: Minden hírnél

source: Popup On Warning / Error
hu: felugró be figyelmeztetés / hiba esetén

source: Show on timeout ?
hu: Időtullépés esetén mutasd?

source: Unread feeds first
hu: Olvasatlan hírek előre

source: Unread articles first
hu: Olvasatlan bekezdése előre

source: Sort articles by date
hu: Rendezés dátum szerint

source: Font
hu: Betűkészlet

source: Font Shadow
hu: Betű árnyék

source: Enable
hu: Engedélyezés

source: Host
hu: Kiszolgáló

source: News Category Configuration
hu: Hír kategória beállítások

source: Icon
hu: Ikon

source: Name
hu: Név

source: Select an Icon
hu: Válassz egy ikont

source: Cancel
hu: Mégsem

source: You need to <hilight>create a category</hilight> first
hu: Először <hilight>létre kell hoznod egy kategóriát.</hilight>

source: News Feed Configuration
hu: Hír csatorna beállítások

source: Basic informations
hu: Alap információk

source: Name :
hu: Név:

source: Feed url :
hu: Csatorna url:

source: Mark as important feed
hu: Megjelölés fontos csatornaként

source: Category
hu: Kategória

source: Language
hu: Nyelv

source: Advanced informations
hu: Speciális információk

source: Description
hu: Leírás

source: Home url
hu: Saját könyvtár url

source: Server informations
hu: Kiszolgáló információk

source: Do allow the server to overwrite the informations you entered ?
hu: Engedélyezed a szerverne, hogy felülírja az információkat, amiket megadtál?

source: News Feeds Configuration
hu: Hír csatornák beállítása

source: Categories
hu: Kategóriák

source: Add
hu: Hozzáadás

source: Delete
hu: Törlés

source: Configure
hu: Beállítás

source: Languages
hu: Nyelvek

source: All
hu: Mind

source: Select
hu: Kijelölés

source: Empty the lists
hu: Lista ürítése

source: Restore default lists
hu: Alapértelmezett listák helyreállítása

source: There are <hilight>feeds</hilight> in this category.<br>You have to <hilight>remove them first</hilight>
hu: Már vannak <hilight>csatornák</hilight> ebben a kategóriában.<br> Először <hilight>ezeket kell eltávolítanod</hilight>

source: News Module - Are you sure ?
hu: Hírek Modul - Biztos vagy benne

source: News Gadget Configuration
hu: Hírek modul beállítások

source: View Mode
hu: Nézetmód

source: Show one icon for all feeds
hu: Egy ikon minden csatornánál

source: Show all feeds
hu: Összes csatorna megjelenítése

source: Show unread feeds
hu: Olvasatlan csatornák megjelenítése

source: Show all feeds marked as important
hu: Minden fontosnak megjelölt csatorna mutatása

source: Show unread feeds marked as important
hu: A fontos, olvasatlan csatornák mutatása

source: Feed open in
hu: Csatorna megnyitás

source: the feed viewer
hu: a csatorna áttekintő

source: my favorite browser
hu: a kedvenc böngészőm

source: Browser opens home url
hu: Böngésző saját könyvtár url-eket nyit meg

source: instead of feed url
hu: a csatorna url helyett

source: Apply this to all News gadgets
hu: Alkalmazd minden új modulra

source: News Gadget Content Configuration
hu: Hírek modul tartalmi beállításai

source: Avalaible Feeds
hu: Elérhető csatornák

source: Add this Feed
hu: Csatorna hozzáadása

source: Selected Feeds
hu: Kijelölt csatornák

source: Remove this Feed
hu: Csatorna eltávolítása

source: News Feeds Language Configuration
hu: Hír csatornák nyelvi beállításai

source: Welcome to News Module !
hu: A Hírek modul üdvözöl!

source: Please select the languages that you are able to read
hu: Kérlek válaszd ki azt a nyelvet, amelyiket érted

source: The <hilight>name</hilight> you entered is not correct
hu: A <hilight>név</hilight> amit megadtál, nem helyes

source: The need to <hilight>select a category</hilight>.
hu: Szükséges <hilight>egy kategória kiválasztása</hilight>

source: A feed with the <hilight>name</hilight> %s <hilight>already exists</hilight><br>in the %s category<br><br>Its not possible to have feeds with the same name<br>in one category.
hu: A csatorna a megadott <hilight>névvel</hilight> %s <hilight>már létezik</hilight><br> ebben a kategóriában: %s.<br><br>Ez nem lehetséges, kérlek válassz másik nevet.<br>

source: You need to select a <hilight>language</hilight>.
hu: Ki kell választanod egy <hilight>nyelvet</hilight>.

source: The <hilight>url</hilight> you specified is not correct
hu: A megadott <hilight>url</hilight> nem jó

source: You need to enter a <hilight>name</hilight> !
hu: Meg kell adnod egy <hilight>nevet</hilight>!

source: The <hilight>name</hilight> you entered is <hilight>already used</hilight><br>by another category
hu: A <hilight>név</hilight>, amit megadtál, <hilight>már egy másik kategóriában használva van.</hilight><br>

source: Configure this feed
hu: Csatorna beállítása

source: Set all feeds as read
hu: Minden csatorna beállítva olvasásra

source: Update all feeds
hu: Összes csatorna frissítése

source: Configure gadget
hu: Modul beállítása

source: Configure gadget content
hu: Tartalom beállítása

source: Main Configuration
hu: Fő beállítás

source: Feeds Configuration
hu: Csatornák beállítása

source: Configuration
hu: Beállítás

source: News Module DEBUG DEBUG DEBUG DEBUG
hu: Hírek modul NYOMKÖVETÉS NYOMKÖVETÉS

source: News Module
hu: Hírek modul

source: News Module Error
hu: Hírek modul hiba

source: Feeds in this gadget
hu: Csatornák a modulban

source: Articles in selected feed
hu: Hírek a kijelölt csatornában
