Repository: kakaroto/e17
Catalog: ewl/po/*.po
Languages: cs, fr, it

source: STOCK|About
cs: O programu...
fr: À propos
it: Informazioni su...

source: STOCK|Add
cs: Přidat
fr: Ajouter
it: Aggiungi

source: STOCK|Apply
cs: Použít
fr: Appliquer
it: Applica

source: STOCK|Bottom
cs: Spodek
fr: Bas
it: Basso

source: STOCK|Down
cs: Dolů
fr: Descendre
it: Giù

source: STOCK|First
cs: První
fr: Premier
it: Primo

source: STOCK|Last
cs: Poslední
fr: Dernier
it: Ultimo

source: STOCK|Left
cs: Vlevo
fr: Gauche
it: Sinistra

source: STOCK|Right
cs: Vpravo
fr: Droite
it: Destra

source: STOCK|Top
cs: Vršek
fr: Haut
it: Alto

source: STOCK|Up
cs: Nahoru
fr: Monter
it: Su

source: STOCK|Bold
cs: Tučně
fr: Gras
it: Grassetto

source: STOCK|Cancel
cs: Zrušit
fr: Annuler
it: Annulla

source: STOCK|Clear
cs: Vyčistit
fr: Effacer
it: Cancella

source: STOCK|Close
cs: Zavřít
fr: Fermer
it: Chiudi

source: STOCK|Copy
cs: Kopírovat
fr: Copier
it: Copia

source: STOCK|Cut
cs: Vystřihnout
fr: Couper
it: Taglia

source: STOCK|Delete
cs: Smazat
fr: Supprimer
it: Elimina

source: STOCK|Edit
cs: Upravit
fr: Editer
it: Modifica

source: STOCK|Execute
cs: Spustit
fr: Exécuter
it: Esegui

source: STOCK|Find
cs: Najít
fr: Rechercher
it: Trova

source: STOCK|Find and replace
cs: Najít a nahradit
fr: Rechercher et remplacer
it: Trova e sostituisci

source: STOCK|Flip horizontal
cs: Překlopit horizontálně
fr: Renverser horizontalement
it: Gira orizzontalmente

source: STOCK|Flip vertical
cs: Překlopit vertikálně
fr: Renverser verticalement
it: Gira verticalmente

source: STOCK|Fullscreen
cs: Celá obrazovka
fr: Plein écran
it: A tutto schermo

source: STOCK|Help
cs: Nápověda
fr: Aide
it: Aiuto

source: STOCK|Home
cs: Domů
fr: Dossier personnel
it: Inizio

source: STOCK|Indent
cs: Odsazení
fr: Indenter
it: Indenta

source: STOCK|Italic
cs: Kurzíva
fr: Italique
it: Corsivo

source: STOCK|Justify center
cs: Zarovnat na střed
fr: Centré
it: Allineato al centro

source: STOCK|Justify fill
cs: Vyplnit
fr: Justifié
it: Giustificato

source: STOCK|Justify left
cs: Zarovnat vlevo
fr: Aligner à gauche
it: Allineato a sinistra

source: STOCK|Justify right
cs: Zarovnat vpravo
fr: Aligner à droite
it: Allineato a destra

source: STOCK|FF
cs: FF
fr: Avance rapide
it: Avanti veloce

source: STOCK|Next
cs: Další
fr: Suivant
it: Successivo

source: STOCK|Pause
cs: Pauza
fr: Pause
it: Pausa

source: STOCK|Play
cs: Pustit
fr: Jouer
it: Esegui

source: STOCK|Previous
cs: Předchozí
fr: Précédent
it: Precedente

source: STOCK|Record
cs: Nahrát
fr: Enregistrement
it: Registra

source: STOCK|Rewind
cs: Převinout
fr: Rembobiner
it: Indietro veloce

source: STOCK|Stop
cs: Zastavit
fr: Arrêter
it: Ferma

source: STOCK|New
cs: Nový
fr: Nouveau
it: Nuovo

source: STOCK|Ok
cs: OK
fr: O.K.
it: OK

source: STOCK|Open
cs: Otevřít
fr: Ouvrir
it: Apri

source: STOCK|Paste
cs: Vložit
fr: Coller
it: Incolla

source: STOCK|Preferences
cs: Volby
fr: Préférences
it: Preferenze

source: STOCK|Print
cs: Tisknout
fr: Imprimer
it: Stampa

source: STOCK|Print preview
cs: Tisknout ukázku
fr: Imprimer l'aperçu
it: Anteprima di stampa

source: STOCK|Properties
cs: Vlastnosti
fr: Propriétés
it: Proprietà

source: STOCK|Quit
cs: Pryč
fr: Quitter
it: Chiudi

source: STOCK|Redo
cs: Vpřed
fr: Rétablir
it: Ripeti

source: STOCK|Refresh
cs: Obnovit
fr: Rafraîchir
it: Aggiorna

source: STOCK|Remove
cs: Smazat
fr: Supprimer
it: Rimuovi

source: STOCK|Rotate left
cs: Otočit vlevo
fr: Pivoter sur la gauche
it: Ruota a sinistra

source: STOCK|Rotate right
cs: Otočit vpravo
fr: Pivoter sur la droite
it: Ruota a destra

source: STOCK|Save
cs: Uložit
fr: Enregistrer
it: Salva

source: STOCK|Save as
cs: Uložit jako
fr: Enregistrer sous
it: Salva con nome

source: STOCK|Select all
cs: Vybrat vše
fr: Tout sélectionner
it: Seleziona tutto

source: STOCK|Sort ascending
cs: Seřadit vzestupně
fr: Trier par ordre croissant
it: Ordinamento ascendente

source: STOCK|Sort descending
cs: Seřadit sestupně
fr: Trier par ordre décroissant
it: Ordinamento discendente

source: STOCK|Spell check
cs: Kontrola pravopisu
fr: Vérification orthographique
it: Controllo ortografico

source: STOCK|Strikethrough
cs: Proškrtnout
fr: Barré
it: Barrato

source: STOCK|Underline
cs: Podrhnout
fr: Soulignage
it: Sottolineato

source: STOCK|Undo
cs: Zpět
fr: Annuler
it: Annulla

source: STOCK|Unindent
cs: Zrušit odsazení
fr: Désindenter
it: Rimuovi indentazione

source: STOCK|Zoom 1:1
cs: Přiblížení 1:1
fr: Normal
it: Dimensioni reali

source: STOCK|Zoom fit
cs: Přizpůsobit
fr: Au mieux
it: Adatta dimensione

source: STOCK|Zoom in
cs: Přiblížit
fr: Zoomer
it: Ingrandisci

source: STOCK|Zoom out
cs: Oddálit
fr: Dézoomer
it: Rimpicciolisci

source: Ewl Colordialog
cs: Výběr barev
fr: Fenêtre de couleurs Ewl
it: Impostazione colori di Ewl

source: COLOR|Current:
cs: Nynější:
fr: Actuelle:
it: Attuale:

source: COLOR|Previous:
cs: Předchozí:
fr: Précédente:
it: Precedente:
