Repository: kakaroto/e17
Catalog: E-MODULES-EXTRA/net/po/*.po
Languages: eo, es, he, hr, pl, ru, sk

source: Net Module Configuration
eo: Agordo de la modulo pri reto
es: Configuraci贸n del m贸dulo Net
he: תצורת מודול הרשת
hr: Konfiguracija Net Modula
pl: Konfiguracja modułu sieci
ru: Настройка модуля сети
sk: Konfigurácia modulu Sieť

source: General Settings
eo: Gxenerala agordo
es: Preferencias generales
he: הגדרות כלליות
hr: Opće Postavke
pl: Ustawienia ogólne
ru: Основные настройки
sk: Všeobecné nastavenia

source: Show Text
eo: Vidigi tekston
es: Mostrar texto
he: הצג טקסט
hr: Prikaži Tekst
pl: Pokaż tekst
ru: Показывать текст
sk: Zobraziť text

source: Show Popup On Mouse-Over
eo: Vidigi sxprucfenestron (muso supre)
es: Mostrar ventanas emergentes cuando el raton paso sobre el elemento
he: הצג חלונית עם מעבר סמן העכבר
hr: Prikaži Pop-up Kad je Miš Preko
pl: Pokazuj okienko po najechaniu myszą
ru: Показывать подсказку при наведении мыши
sk: Zobraziť vyskakovacie okno po prejdení myšou

source: Launch Application On Double-Click
eo: Lauxncxi aplikajxon per duobla alklako
es: Ejecutar aplicaci贸n al pulsar dos veces
he: טען תוכניות עם לחיצה כפולה
hr: Pokreni Aplikaciju Na Dvo-Klik
pl: Uruchom aplikacje przy podwójnym kliknięciu
ru: Запускать приложение при двойном клике
sk: Spustiť aplikáciu po dvojitom kliknutí

source: Activity Notification Level
eo: Ofteco de atentigo pri aktiveco
es: Nivel de notificaciones de actividad
he: רמת פעילות ההתרעות
hr: Razina Obavještavanja o Aktivnosti
pl: Poziom powiadomień o aktywności
ru: Уведомление уровня активности
sk: Úroveň upozorňovania na aktivitu

source: High (MB)
eo: Alta (MB)
es: Alto (MB)
he: גבוהה (מ"ב)
hr: Visok (MB)
pl: Wysoki (MB)
ru: Высокий (МБ)
sk: Vysoká (MB)

source: Middle (KB)
eo: Meza (KB)
es: Medio (Kb)
he: ממוצעת (ק"ב)
hr: Srednji (KB)
pl: Średni (KB)
ru: Средний (КБ)
sk: Stredná (KB)

source: Low (B)
eo: Malalta (B)
es: Bajo (B)
he: נמוכה (ב')
hr: Nizak (B)
pl: Niski (B)
ru: Низкий (Б)
sk: Nízka (B)

source: Device Settings
eo: Agordoj pri aparato
es: Preferencias de dispositivos
he: הגדרות ההתקן
hr: Postavke Uređaja
pl: Ustawienia urządzenia
ru: Настройки оборудования
sk: Nastavenia zariadenia

source: Net
eo: Reto
he: רשת
hr: Mreža
pl: Sieć
ru: Сеть
sk: Sieť

source: Configuration
eo: Agordo
es: Configuraci贸n
he: תצורה
hr: Konfiguracija
pl: Konfiguracja
ru: Настройка
sk: Konfigurácia

source: Device - %s
eo: Aparato - %s
es: Dispositivo - %s
he: התקן - %s
hr: Uređaj -%s
pl: Urządzenie - %s
ru: Устройство - %s
sk: Zariadenie - %s
