Repository: kakaroto/e17
Catalog: E-MODULES-EXTRA/mail/po/*.po
Languages: el, hr

source: Mailbox Configuration
el: Ρύθμιση Γραμματοκιβωτίου
hr: Konfiguracija Pretinca

source: General Settings
el: Γενικές Ρυθμίσεις
hr: Opće Postavke

source: Start Program When New Mail Arrives
el: Εκκίνηση προγράμματος κατά την παραλαβή νέου μηνύματος
hr: Pokreni Program Kad Nova Pošta Stigne

source: Program:
el: Πρόγραμμα:

source: Mailbox Type
el: Τύπος Γραμματοκιβωτίου
hr: Vrsta Pretinca

source: Port Settings
el: Ρυθμίσεις Πόρτας
hr: Postavke Porta

source: Use SSL:
el: Χρήση SSL:
hr: Upotrijebi SSL:

source: Port:
el: Πόρτα:

source: Mailbox Settings
el: Ρυθμίσεις Γραμματοκιβωτίου
hr: Postavke Pretinca

source: Name:
el: Όνομα:
hr: Naziv:

source: Mail Host:
el: Υπολογιστής Μηνύματων:
hr: Poštanski Domaćin

source: Username:
el: Όνομα Χρήστη:
hr: Korisničko ime:

source: Password:
el: Κωδικός Χρήστη:
hr: Lozinka:

source: New Mail Path:
el: Νέα Διαδρομή Μηνύματος:
hr: Novi Poštanski Put:

source: Current Mail Path:
el: Τρέχουσα Διαδρομή Μηνύματος:
hr: Trenutačni Poštanski Put:

source: Inbox
el: Εισερχόμενα
hr: Ulazni

source: Mail Configuration
el: Ρύθμιση Μηνύματος
hr: Konfiguracija Pošte

source: Always Show Labels
el: Εμφάνιση Ετικετών Πάντα
hr: Uvijek Prikaži Oznake

source: Show Mailbox Popup
el: Εμφάνιση Ειδοποίησης Ταχυδρομικού Κουτιού
hr: Prikaži Pop-up za Pretince

source: Show All Boxes In Popup
el: Εμφάνιση όλων των κουτιών στην Ειδοποίηση
hr: Prikaži Sve Pretince U Pop-up

source: Check Interval
el: Χρονικό Διάστημα Ενημέρωσης
hr: Provjeri Interval

source: %2.0f minutes
el: %2.0f λεπτά
hr: %2.0f minuta

source: Mail Boxes
el: Γραμματοκιβώτια
hr: Poštanski Pretinci

source: Add
el: Προσθήκη
hr: Dodaj

source: Delete
el: Διαγραφή
hr: Izbriši

source: Configure...
el: Ρύθμιση...
hr: Konfiguriranje...

source: Mail
el: Ταχυδρομείο
hr: Pošta

source: Mailboxes
el: Ταχυδρομικά Κουτιά
hr: Poštanskipretinci

source: Configuration
el: Ρύθμιση
hr: Konfiguracija

source: Monitor Mbox file permanently
hr: Stalno nadgledaj Mbox datoteku

source: Local:
hr: Lokalni:
