Repository: kakaroto/e17
Catalog: e_modules/mixer/po/*.po
Languages: it

source: Mixer Configuration
it: Configurazione di Mixer

source: Mixer Application
it: Applicazione mixer

source: Launch Mixer App
it: Lancia applicazione

source: Available Cards
it: Schede disponibili

source: Available Mixers
it: Controlli disponibili

source: Mixer Popup
it: Popup di Mixer

source: Show Popup
it: Mostra popup

source: Popup Speed
it: Velocit√† popup

source: %1.1f seconds
it: %1.1f secondi

source: Mixer module lets you change volume.
it: Il modulo Mixer consente di cambiare il volume

source: Mute
it: Muto
