Repository: kakaroto/e17
Catalog: e_modules/uptime/po/*.po
Languages: it

source: Uptime Configuration
it: Configurazione modulo Uptime

source: Uptime Settings
it: Impostazioni di Uptime

source: Update Interval:
it: Frequenza di aggiornamento:

source: Check Interval:
it: Frequenza di aggiornamento:

source: Configuration
it: Configurazione

source: Enlightenment Uptime Monitor Module
it: Modulo Uptime di Enlightenment

source: This module is used to monitor uptime.
it: Questo modulo viene usato per monitorare il tempo di servizio.

source: up: %ld days, %ld:%02ld:%02ld
it: tempo di servizio: %ld giorni, %ld:%02ld:%02ld

source: la: %.2f %.2f %.2f
it: carico medio: %.2f %.2f %.2f

source: users: %d
it: utenti: %d
