Repository: kakaroto/e17
Catalog: e_modules/emu/po/*.po
Languages: eo, fi, ja

source: Emu Configuration
eo: Konfigurajxo de Emu
fi: Emun asetukset
ja: Emu の設定

source: Enlightenment Emu Module - error
fi: Englihtenmentin Emumoduuli - virhe
ja: Enlightenment Emu モジュール - エラー

source: There is no emu.
fi: Emua ei ole.
ja: emu がありません

source: Window properties
eo: Fenestraj Ecoj
fi: Ikkunan ominaisuudet
ja: ウィンドウプロパティ

source: Window identification
fi: Ikkunan tunnukset
ja: ウィンドウ識別子

source: Title (%T)
eo: Titolo (%T)
fi: Otsikko (%T)
ja: タイトル (%T)

source: Properties
eo: Ecoj
fi: Ominaisuudet
ja: プロパティ

source: Position (%p)
eo: Pozicio (%p)
fi: Sijainti (%p)
ja: 位置 (%p)

source: Size (%s)
eo: Grandeco (%s)
fi: Koko (%s)
ja: 大きさ (%s)

source: Border style (%b)
eo: Randa stilo (%b)
fi: Kehyksen tyyli (%b)
ja: ボーダースタイル (%b)

source: Stickiness (%p)
eo: Glueco (%p)
fi: Tarttuvuus (%p)
ja: 常時表示 (%p)

source: Virtual desktop (%d)
eo: Virtuala labortablo (%d)
fi: Virtuaalityöpöytä (%d)
ja: 仮想デスクトップ (%d)

source: Shaded state (%r)
fi: Varjostustila (%r)
ja: シェーディング (%r)

source: Fullscreen (%f)
eo: Tutekreano (%f)
fi: Koko näyttö (%f)
ja: 全画面表示 (%f)

source: Iconified (%i)
eo: Piktogramigita (%i)
fi: Ikonisoitu (%i)
ja: アイコン化 (%i)

source: Window ID (%I)
eo: Fenestra ID (%i)
fi: Ikkunan ID (%I)
ja: ウィンドウID (%I)

source: Window name (%N)
eo: Fenestra nomo (%N)
fi: Ikkunan nimi (%N)
ja: ウィンドウ名 (%N)

source: Window class (%C)
eo: Fenestra klaso (%C)
fi: Ikkunan luokka (%C)
ja: ウィンドウクラス (%C)

source: Window role (%R)
fi: Ikkunan rooli (%R)
ja: ウィンドウの役割 (%R)

source: Window type (%S)
eo: Fenestra tipo (%S)
fi: Ikkunan tyyppi (%S)
ja: ウィンドウタイプ (%S)

source: Transient (%H)
fi: Vaihtuminen (%H)
ja: トランジェント (%H)

source: Layer (%l)
eo: Tavolo (%I)
fi: Kerros (%l)
ja: レイヤー (%l)

source: Stickiness (%y)
eo: Glueco (%y)
fi: Tarttuvuus (%y)
ja: 常時表示 (%y)

source: Screen zone (%z)
eo: Ekrana zono (%z)
fi: Näytön alue (%z)
ja: スクリーンゾーン (%z)

source: Window list skip (%w)
fi: Ikkunalistan sivuutus (%w)
ja: ウィンドウリストスキップ (%w)
