Repository: kakaroto/e17
Catalog: entrance/po/*.po
Languages: cs, fr

source: Cookie generation failed: could not open %s
cs: Selhala tvorba cookie: nemůžu otevřít %s
fr: La création du cookie a échoué : impossible d'ouvrir %s

source: Cookie generation failed: could not read %s
cs: Selhala tvorba cookie: nemůžu přečíst %s
fr: La création du cookie a échoué : impossible de lire %s

source: entranced_auth_purge: Write failed!
cs: entranced_auth_purge: Selhal zápis!
fr: entranced_auth_purge : l'écriture a échoué !

source: Generated MIT-MAGIC-COOKIE-1
cs: Vytvořen MIT-MAGIC-COOKIE-1
fr: MIT-MAGIC-COOKIE-1 créé

source: Auth generation failed.
cs: Tvorba ověření selhala.
fr: Échec de l'authentification.

source: _entrance_auth_entry_add: Auth write failed!
cs: _entrance_auth_entry_add: Zápis ověření selhal!
fr: _entrance_auth_entry_add : échec à l'écriture de l'authentification !

source: _entrance_auth_entry_add: Could not add auth entry to list!
cs: _entrance_auth_entry_add: Nemůžu přidat autorizační položku do seznamu!
fr: _entrance_auth_entry_add : impossible d'ajouter une entrée à la liste d'authentification !

source: entranced_auth_display_secure: Setting up access for display %s
cs: entranced_auth_display_secure: Nastavuji přístup na displej %s
fr: entranced_auth_display_secure : paramétrage de l'accès à l'affichage %s

source: entranced_auth_display_secure: Successfully set up access for %s (localhost)
cs: entranced_auth_display_secure: Úspěšně nastaven přístup pro %s (localhost)
fr: entranced_auth_display_secure : paramétrage de l'accès à %s (localhost) réalisé avec succès.

source: entranced_auth_user_add: Adding auth cookie
cs: entranced_auth_user_add: Přidávám autorizační cookie
fr: entranced_auth_user_add : ajout du cookie d'authentification

source: entranced_auth_user_add: Unable to write auth file %s
cs: entranced_auth_user_add: Nemůžu zapsat autorizační soubor %s
fr: entranced_auth_user_add : l'écriture du fichier d'authentification %s a échoué

source: entranced_auth_user_add: Opened %s for writing cookies
cs: entranced_auth_user_add: Otevřen %s pro zápis cookies
fr: entranced_auth_user_add : ouverture de %s pour l'écriture des cookies

source: entranced_auth_user_add: Finished writing auth entries to %s
cs: entranced_auth_user_add: Dokončen zápis autorizačních položek do %s
fr: entranced_auth_user_add : écriture des entrées d'authentification pour %s terminée

source: entranced_auth_user_remove: Removing cookie from %s
cs: entranced_auth_user_remove: Odstraňuji cookie z %s
fr: entranced_auth_user_remove : suppression du cookie de %s

source: Entranced_Start_Server_Once: Executing %s
cs: Entranced_Start_Server_Once: Spouštím %s
fr: Entranced_Start_Server_Once : exécution de %s

source: Entranced_Start_Server_Once: Attempt to start X server failed.
cs: Entranced_Start_Server_Once: Pokus o start X serveru selhal.
fr: Entranced_Start_Server_Once : échec de la tentative de démarrage du serveur X.

source: _entranced_ipc_client_add: Received event
cs: _entranced_ipc_client_add: Přijata událost
fr: _entranced_ipc_client_add : événement reçu

source: _entranced_ipc_client_del: Received event
cs: _entranced_ipc_client_del: Přijata událost
fr: _entranced_ipc_client_del : événement reçu

source: _entranced_ipc_client_data: All tokens received; wrote cookie to user dir %s
cs: _entranced_ipc_client_data: Všechny tokeny přijaty; zapsán cookie do uživatelské složky %s
fr: _entranced_ipc_client_data : jetons bien reçus ; cookie écrit dans le répertoire %s de l'utilisateur

source: _entranced_ipc_client_data: Failed to write cookie to %s
cs: _entranced_ipc_client_data: Selhal zápis cookie do %s
fr: _entranced_ipc_client_data : l'écriture du cookie dans %s a échoué

source: _entranced_ipc_client_data: Received [%i] [%i] [%i] [%i] "%s"
cs: _entranced_ipc_client_data: Přijato [%i] [%i] [%i] [%i] "%s"
fr: _entranced_ipc_client_data : reçu [%i] [%i] [%i] [%i] "%s"

source: entranced_ipc_init: Failed to open socket %s.
cs: entranced_ipc_init: Selhalo otevření socketu %s.
fr: entranced_ipc_init : l'ouverture de la socket %s a échoué.

source: entranced_ipc_init: Success
cs: entranced_ipc_init: Úspěch
fr: entranced_ipc_init : succès

source: entranced_ipc_shutdown: Success
cs: entranced_ipc_shutdown: Úspěch
fr: entranced_ipc_shutdown : succès

source: Entrance Edit GUI
cs: Konfigurační GUI Entrance
fr: Editeur graphique d'Entrance

source: Appearance
cs: Vzhled
fr: Apparence

source: Use builtin(translatable) greeting message
cs: Použít vestavěnou(přeložitelnou) uvítací zprávu
fr: Utiliser le message d'accueil incorporé (traduisible)

source: Greeting prefix:
cs: Uvítací prefix:
fr: Préfixe d'accueil :

source: Greeting suffix:
cs: Uvítací suffix:
fr: suffixe d'accueil :

source: Date format:
cs: Formát data:
fr: Format de la date :

source: Time format:
cs: Formát času:
fr: Format de l'heure :

source: Entrance theme:
cs: Entrance téma:
fr: Thème d'Entrance :

source: Entrance Daemon settings
cs: Nastavení démona Entrance
fr: Paramètres du démon d'Entrance

source: Number of attempts:
cs: Počet pokusů:
fr: Nombre de tentatives :

source: Automatic login
cs: Automatické přihlášení
fr: Connexion automatique

source: Autologin user:
cs: Uživatel pro automatické přihlášení:
fr: Auto-connexion de l'utilisateur :

source: Pre-selected user
cs: Předem vybraný uživatel
fr: Pré-sélection de l'utilisateur :

source: Remember users
cs: Zapamatovat uživatele
fr: Mémorisation des utilisateurs

source: Number of remembers:
cs: Počet uživatelů:
fr: Nombre de mémorisations :

source: System
cs: Systém
fr: Système

source: Reboot allowed
cs: Povolit restart
fr: Autoriser le rédémarrage

source: Shutdown allowed
cs: Povolit vypnutí
fr: Autoriser l'extinction

source: PAM Authentication
cs: PAM ověření
fr: Authentification PAM

source: Don't forget to save your settings before closing app.
cs: Nezapomeňte uložit vaše nastavení před zavřením programu.
fr: Veuillez sauvegarder vos réglages avant de fermer l'application.

source: Save settings
cs: Uložit nastavení
fr: Sauvegarder la configuration

source: Exit application
cs: Vypnout program
fr: Quitter l'application

source: Locale set failed! Please make sure you have your locale files installed for "%s"
cs: Selhalo nastavení locale! Ujistěte se, že máte správné soubory nainstalované pro "%s"
fr: La définition de la locale a échoué ! Veuillez vous assurer de la présence des fichiers de localisation pour "%s"

source: You need root permissions to run this
cs: Jsou vyžadovány root práva
fr: Cette action requiert les droits du superutilisateur (root)

source: /etc/shadow was found but couldn't be read. Run entrance as root.
cs: /etc/shadow byl nalezen ale nelze přečíst. Prosím pusťte entrance jako root.

source: Entrance has been built without PAM support, so PAM isn't used for authentication!
cs: Entrance byl sestaven bez PAM podpory, takže PAM není použito pro ověření!

source: Could not load %s
cs: Nemůžu načíst %s
fr: Impossible de charger %s

source: Selected session command: %s
cs: Vybraný příkaz sezení: %s
fr: Commande de sélection de session : %s

source: _entrance_ipc_server_add: Received event
cs: _entrance_ipc_server_add: Přijata událost
fr: _entrance_ipc_server_add : événement reçu

source: _entrance_ipc_server_del: Received event
cs: _entrance_ipc_server_del: Přijata událost
fr: _entrance_ipc_server_del : événement reçu

source: _entrance_ipc_server_data: Received [%i] [%i] (%i) "%s"
cs: _entrance_ipc_server_data: Přijato [%i] [%i] (%i) "%s"
fr: _entrance_ipc_server_data : reçu [%i] [%i] (%i) "%s"

source: _entrance_ipc_server_data: Xauthority write success
cs: _entrance_ipc_server_data: Xauthority zápis se zdařil
fr: _entrance_ipc_server_data : écriture du fichier Xauthority réussie

source: _entrance_ipc_server_data: Xauthority write failure!
cs: _entrance_ipc_server_data: Chyba zápisu Xauthority!
fr: _entrance_ipc_server_data : échec à l'écriture du fichier Xauthority !

source: _entrance_ipc_server_data: Invalid message received
cs: _entrance_ipc_server_data: Přijata neplatná zpráva
fr: _entrance_ipc_server_data : message invalide reçu

source: _entrance_ipc_client_add: Received event
cs: _entrance_ipc_client_add: Přijata událost
fr: _entrance_ipc_client_add : événement reçu

source: _entrance_ipc_client_del: Received event
cs: _entrance_ipc_client_del: Přijata událost
fr: _entrance_ipc_client_del : événement reçu

source: _entrance_ipc_client_data: Received [%i] [%i] (%i) "%s"
cs: _entrance_ipc_client_data: Přijato [%i] [%i] (%i) "%s"
fr: _entrance_ipc_client_data : reçu [%i] [%i] (%i) "%s"

source: Failed on: %s
cs: Selhalo na: %s
fr: Échec pour : %s

source: Welcome to
cs: Vítejte v
fr: Bienvenue sur

source: Welcome to Localhost
cs: Vítejte v Localhost
fr: Bienvenue sur localhost

source: Unknown signal Emission(%s)
cs: Neznámá emise signálu(%s)
fr: Signal inconnu (%s)

source: Unknown Container Orientation
cs: Neplatná orientace kontejneru
fr: Orientation du conteneur inconnue

source: ERROR: could not parse command line options.
cs: CHYBA: nemůžu parsovat volby příkazové řádky.
fr: ERREUR : impossible d'interpréter les options de la ligne de commande.

source: Invalid non-option argument
cs: Neplatný ne-volbový argument
fr: Argument invalide (option requise)

source: Fatal error: Could not initialize ecore_evas!
cs: Fatální chyba: Nemohu načíst ecore_evas!
fr: Erreur irrécupérable : impossible d'initialiser ecore_evas !

source: Entrance - Testing Mode
cs: Entrance - testovací mód
fr: Entrance – Mode test

source: Please enter your user name
cs: Prosím zadejte své uživatelské jméno
fr: Veuillez entrer votre nom d'utilisateur

source: Please enter your password
cs: Prosím zadejte své heslo
fr: Veuillez entrer votre mot de passe

source: X server:
fr: Serveur X :
