Repository: kakaroto/e17
Catalog: e_modules/wlan/po/*.po
Languages: eo

source: Wlan Configuration
eo: Konfiguraĵo de Wlan

source: General Settings
eo: Ĝeneralaj Alĝustigoj

source: Always Show Text
eo: Ĉiam Vidigi Tekston

source: Show Text On Mouse Over
eo: Vidigi Tekston Dum Muso supras

source: Show Text As Percent
eo: Vidigi Tekston Kiel Percento

source: Check Interval:
eo: Kontroli Intervalon

source: %1.0f seconds
eo: %1.0f sekundoj

source: Device Settings
eo: Aparataj Agordoj

source: Wlan
eo: Sendrata reto

source: Configuration
eo: Konfiguraĵo
