Repository: kakaroto/e17
Catalog: E-MODULES-EXTRA/everything-websearch/po/*.po
Languages: ar, pt, sl

source: Translate
ar: ترجم
pt: Traduzir
sl: Prevedi

source: Abort download
ar: الغِ التنزيل
pt: Cancelar transferência
sl: Opusti prenos

source: Got %d kbytes of
ar: لديك %d كيلوبايت من
pt: Obtidos %d "kbytes" de
sl: Dobljenih·%d·kbytov·of

source: Enqueue in Playlist
ar: ضُمه في قائمة التشغيل
pt: Colocar na fila de reprodução
sl: Postavi v predvajalni seznam

source: Enqueue
ar: ضُمَّ
pt: Colocar na fila
sl: V vrsto

source: Play File
ar: اقرأ ملفا
pt: Reproduzir ficheiro
sl: Predvajaj datoteko

source: Play
ar: اقرأ
pt: Reproduzir
sl: Predvajaj

source: Finished download
ar: التنزيلات المنتهية
pt: Transferência concluída
sl: Prenašanje dokončano

source: Start download
ar: إبدأ التنزيل
pt: Iniciar transferência
sl: Začni prenos

source: Enqueue files for download
ar: ضُم الملفات للتحميل
pt: Colocar os ficheiros na fila de transferência
sl: Datoteke določi za kasnejši prenos

source: Upload Image
ar: رفع صورة
pt: Enviar imagem
sl: Naloži sliko

source: Link copied to clipboard
ar: نُسِخ الرابط إلى الحافظة
pt: Ligação copiada para a área de transferência
sl: Bližnjica kopirana na odložišče

source: Something went wrong :(
ar: هنالك شيء خاطئ :(
pt: Aconteceu algo estranho:(
sl: Nekaj je šlo po zlu :(

source: Completed %1.1f%% of %s
ar: أُكمِل %1.1f%% من %s
pt: Terminados %1.1f%% de %s
sl: Dokončano·%1.1f%%·od·%s

source: Wikipedia
sl: Wikipedija

source: Google for it
sl: Poišči v Google-u

source: Wikipedia Page
pt: Página Wikipedia
sl: Stran Wikipedije·

source: Feeling Lucky
pt: Sinto-me com sorte
sl: Imam srečo

source: Watch on Youtube
pt: Ver no Youtube
sl: Glej na·Youtube

source: Download as Audio
pt: Transferir como áudio
sl: Prenesi v obliki zvoka

source: Play Video
pt: Reproduzir vídeo
sl: Predvajaj·Video

source: Download and enqueue
pt: Transferir e colocar na fila
sl: Prenesi in postavi v vrsto

source: Download and play
pt: Transferir e reproduzir
sl: Prenesi in predvajaj

source: General
ar: عام
pt: Geral
sl: Splošno

source: Browser
ar: المتصفح
pt: Navegador
sl: Brskalnik

source: Language
ar: اللغة
pt: Idioma
sl: Jezik

source: Video player
ar: قارئ الفيديو
pt: Reprodutor de vídeo
sl: Video predvajalnik

source: Download directory
ar: مجلد التنزيلات
pt: Diretório de transferência
sl: Mapa prenosov

source: Download requires mplayer and mp3lame
ar: يتطلب التنزيل وجود mplayer و mp3lame
pt: A transferência requer mplayer e mp3lame
sl: Prenos zahteva mplayer in mp3lame

source: Extensions
pt: Extensões
sl: Razširitve

source: Everything Websearch
ar: كل شيء - بحث الوِب
pt: Everything - Pesquisa web

source: Launcher
ar: مُطلِق
