Repository: kakaroto/e17
Catalog: E-MODULES-EXTRA/exebuf/po/*.po
Languages: ar

source: Run Command Settings
ar: إعدادات أمر التشغيل

source: General
ar: عام

source: Maximum Apps to List
ar: أقصى عدد من التطبيقات للقائمة

source: Maximum Exes to List
ar: أقصى عدد من التطبيقات القابلة للتنفيد للقائمة

source: Maximum History to List
ar: أقصى عدد تواريخ للقائمة

source: Animations
ar: متحركة

source: Animate
ar: حرِّك

source: Speed
ar: السرعة

source: Minimum Width
ar: أدنى عرض

source: Minimum Height
ar: أدنى ارتفاع

source: Maximum Width
ar: أقصى عرض

source: Maximum Height
ar: أقصى ارتفاع

source: X-Axis Alignment
ar: محاذاة على المحور السيني

source: Y-Axis Alignment
ar: محاذاة على المحور الصادي

source: Geometry
ar: هندسي

source: Command (CTRL+RETURN to utilize)
ar: أمر (CTRL+RETURN ليُنَفَّذ)

source: Terminal
ar: الطرفية

source: Exebuf Module Configuration data needed upgrading. Your old configuration<br> has been wiped and a new set of defaults initialized. This<br>will happen regularly during development, so don't report a<br>bug. This simply means the module needs new configuration<br>data by default for usable functionality that your old<br>configuration simply lacks. This new set of defaults will fix<br>that by adding it in. You can re-configure things now to your<br>liking. Sorry for the inconvenience.<br>
ar: بيانات إعدادات وحدة Exebuf بحاجة للترقية. إعداداتك القديمة<br> أزيلت و واحدة أخرى جديدة و افتراضية قد هيئت .<br>سيحدث هذا بانتظام أثناء التطوير ، لذا لا تبلغ بوجود<br>علة. هذا يعني بكل بساطة أن الوحدة تحتاج لبيانات إعدادات جديدة <br>إفتراضيا لتحصل على أداء أفضل<br>كانت إعداداتك القديمة تفتقر لتوفيره. هذه اﻹعدادات الجديدة ستصلح<br>ذلك عبر إضافتها فيها. يمكنك اﻵن إعادة إعداد اﻷشياء حسب<br>رغبتك. نأسف ﻹزعاجك.<br>

source: Your Exebuf Module configuration is NEWER than the module version. This is very<br>strange. This should not happen unless you downgraded<br>the module or copied the configuration from a place where<br>a newer version of the module was running. This is bad and<br>as a precaution your configuration has been now restored to<br>defaults. Sorry for the inconvenience.<br>
ar: إعداداتك لوحدة Exebuf أحدث من إصدارة الوحدة. هذا غريب<br>جدا. لا يجب لهذا أن يحدث إلا إذا خفضت<br>إصدار الوحدة أو نسختَ اﻹعدادات من مكان آخر<br>يحتوي نسخة جديدة من الوحدة تعمل عليه. هذا سيء<br>و كإجراء إحترازي فإن إعداداتك ستعاد إلى<br>اﻹفتراضيات. نأسف ﻹزعاجك.<br>

source: Launch
ar: أطلق

source: Run Command Dialog
ar: نافذة حوار أمر التشغيل

source: Run Command
ar: أمر التشغيل

source: Advanced
ar: متقدم

source: Exebuf Configuration Updated
ar: إعدادات Exebuf حُدِّثت
