Repository: kakaroto/e17
Catalog: E-MODULES-EXTRA/mem/po/*.po
Languages: bg, cs, de, eo, es, fr, hr, hu, it, ja, lt, nl, pl, pt, pt_br, ru, sl, sv, uk, zh_cn

source: Mem Settings
cs: Nastavení Mem
de: Speichermodul-Einstellungen
fr: Paramétrage de Mémoire
it: Impostazioni di Mem
nl: Mem-configuratie
pt: Definições do módulo
sl: Nastavitve Spomina
uk: Налаштування

source: General Settings
bg: Общи настройки
cs: Obecná nastavení
de: Allgemeine Einstellungen
eo: Ĝeneralaj agordoj
es: Preferencias generales
fr: Paramètres généraux
hr: Opće Postavke
hu: Általános beállítások
it: Impostazioni generali
ja: 一般の設定
lt: Bendros nuostatos
nl: Algemene instellingen
pl: Ustawienia ogólne
pt: Definições gerais
pt_br: Configurações gerais
ru: Основные параметры
sl: Splošne nastavitve
sv: Allmänna inställningar
uk: Загальні налаштування
zh_cn: 常规设置

source: Always Show Text
bg: Винаги показвай текста
cs: Vždy zobrazit text
de: Text immer zeigen
eo: Montri tekson ĉiam
es: Mostrar siempre texto
fr: Toujours afficher le texte
hr: Uvijek Prikaži Tekst
hu: Mindig mutasd a szöveget
it: Mostra testo sempre
ja: 常に表示する
lt: Visada rodyti tekstą
nl: Toon altijd tekst
pl: Zawsze pokazuj tekst
pt: Mostrar sempre o texto
pt_br: Sempre mostrar texto
ru: Всегда отображать текстовые подписи
sl: Vedno prikazuj besedilo
sv: Visa alltid text
uk: Завжди показувати текст
zh_cn: 总是显示文本

source: Show Text On Mouse Over
bg: Показвай текста при преминаване с мишката
cs: Zobrazit text, když je na ikoně kurzor
de: Beim Ãœberfahren mit dem Mauszeiger Text anzeigen
eo: Montri tekston dum muso supras
es: Mostrar etiquetas cuando el raton pase sobre el elemento
fr: Afficher le texte au survol
hr: Prikaži Tekst Kad je Miš Preko
hu: Szöveg megjelenítésa, ha az egér felette van
it: Mostra testo al passaggio del mouse
ja: マウスが乗れば表示する
lt: Rodyti tekstą užvedus pelės kursorių
nl: Toon tekst bij muisover
pl: Pokazuj tekst przy najechaniu myszą
pt: Mostrar texto ao passar com o rato
pt_br: Mostrar texto ao passar com o mouse
ru: Отображать текстовые подписи при наведении указателя мыши
sl: Prikaži besedilo ob prehodu z miško
sv: Visa text när musen är över
uk: Показувати текст при наведені курсора
zh_cn: 鼠标移过时显示

source: Show Text As Percent
bg: Показвай текста като процент
cs: Zobrazit text jako procenta
de: Text in Prozent anzeigen
eo: Montri tekston kiel percento
es: Mostrar la información en porcentajes
fr: Afficher le texte en pourcentage
hr: Prikaži Tekst Kao Postotak
hu: Szöveg százalékban
it: Mostra testo come percentuale
ja: 百分率で表示する
lt: Rodyti tekstą kaip procentus
nl: Toon tekst als percentage
pl: Pokazuj tekst jako procent
pt: Mostrar texto como percentagem
pt_br: Mostrar texto como porcentagem
ru: Отображать значения в процентах
sl: Prikaži besedilo kot odstotek
sv: Visa text som procent
uk: Показувати у відсотках
zh_cn: 按百分比显示

source: Ignore Buffers
bg: Игнорирай буферите
cs: Ignorovat buffery
de: Puffer ignorieren
eo: Ignori bufrojn
es: Ignorar búfers
fr: Ignorer les tampons de fichiers
hr: Ignoriraj Međuspremnike
hu: Tárolók elvetése
it: Ignora buffer
ja: バッファは無視する
lt: Ignoruoti buferius
nl: Negeer buffers
pl: Ignoruj bufory
pt: Ignorar "buffers"
pt_br: Ignorar buffers
ru: Игнорировать память в буферах
sl: Ne upoštevaj medpomnilnika
sv: Ignorera buffertar
uk: Нехтувати пам'ятю буферів
zh_cn: 忽略缓冲

source: Ignore Cached
bg: Игнорирай кеша
cs: Ignorovat cache
de: Gecachtes ignorieren
eo: Ignori kaŝmemoron
es: Ignorar la caché
fr: Ignorer la mémoire cache
hr: Ignoriraj Priručno Memorirano
hu: Gyorsítótár elvetése
it: Ignora cache
ja: キャッシュは無視する
lt: Ignoruoti podėlį
nl: Negeer gecachede gegevens
pl: Ignoruj cache
pt: Ignorar itens em "cache"
pt_br: Ignorar com cache
ru: Игнорировать память для кеша
sl: Ne upoštevaj predpomnilnika
sv: Ignorera cachat
uk: Нехтувати пам'ятю кешу
zh_cn: 忽略缓存

source: Check Interval:
bg: Интервал от време за проверка:
cs: Interval kontroly:
de: Abfrageintervall:
eo: Kontroli intervalon:
es: Tasa de comprobación:
fr: Intervalle des vérifications :
hr: Provjeri Interval:
hu: Ellenőrzés Időköz:
it: Frequenza di aggiornamento:
ja: 監視間隔
lt: Tikrinimo intervalas:
nl: Controle-interval:
pl: Częstotliwość sprawdzania:
pt: Intervalo de verificação:
pt_br: Intervalo de checagem
ru: Интервал проверки:
sl: Premor med posodabljanji:
sv: Kontrollintervall:
uk: Проміжок перевірки:
zh_cn: 检查间隔

source: %1.0f seconds
bg: %1.0f·секунди
cs: %1.0f sekund
de: %1.0f Sekunden
eo: %1.0f sekundoj
es: %1.0f segundos
fr: %1.0f secondes
hr: %1.0f sekundi
hu: %1.0f másodperc
it: %1.0f secondi
ja: %1.0f 秒
lt: %1.0f sekundės
nl: %1.0f seconden
pl: %1.0f sekund
pt: %1.0f segundos
pt_br: %1.0f segundos
ru: %1.0f секунд(ы)
sl: %1.0f·sek.
uk: %1.0f секунд
zh_cn: %1.0f 秒

source: Mem
de: Speichermodul
eo: Memoro
fr: Mémoire
hu: Memória
lt: Atmintis
pl: Pam
pt: Memória
sl: Spomin
sv: Minne
uk: Пам'ять
zh_cn: 内存

source: Settings
cs: Nastavení
de: Einstellungen
fr: Configuration
it: Impostazioni
nl: Instellingen
pt: Definições
sl: Nastavitve
uk: Налаштування

source: Mem Configuration
bg: Конфигурация на Mem
eo: Agordoj de modulo pri memoro
es: Configuración de Mem
hr: Konfiguracija Mem
hu: Memória beállítások
ja: mem の設定
lt: Atminties konfigūracija
pl: Konfiguracja Pam
pt_br: Configuração do mem
ru: Параметры модуля mem
sv: Minneskonfiguration
zh_cn: 内存配置

source: Configuration
bg: Настройка
eo: Agordoj
es: Configuración
hr: Konfiguracija
hu: Beállítás
ja: 設定
lt: Konfigūracija
pl: Konfiguracja
pt_br: Configuração
ru: Настройка
sv: Konfiguration
zh_cn: 配置
