Repository: kakaroto/e17
Catalog: E-MODULES-EXTRA/places/po/*.po
Languages: ar

source: Places Settings
ar: إعدادات اﻷماكن

source: General
ar: عام

source: Show in main menu
ar: اعرض في القائمة الرئيسية

source: Mount volumes on insert
ar: أوصل الحجوم (( ...HDD , flash )) عند اﻹدخال

source: Open filemanager on insert
ar: افتح مدير الملفات عند اﻹدخال

source: Use a custom file manager
ar: استخدم مدير ملف مخصص

source: Show in menu
ar: اعرض في القائمة

source: Home
ar: المنزل

source: Desktop
ar: سطح المكتب

source: Trash
ar: سلة المهملات

source: Filesystem
ar: نظام ملفات

source: Temp
ar: مؤقتة

source: Favorites
ar: مفضلة

source: Files
ar: ملفات

source: Places
ar: أماكن

source: Settings
ar: اﻹعدادات

source: No Name
ar: دون اسم

source: free of
ar: تخلص من

source: %s Not Mounted
ar: %s لم يوصل

source: unmount
ar: إفصل

source: eject
ar: اخرج
