Repository: kakaroto/e17
Catalog: E-MODULES-EXTRA/slideshow/po/*.po
Languages: cs, eo, es, fr, hr, id, ja, pl, uk, zh_cn

source: Slideshow Configuration
cs: Nastavení slideshow
eo: Agordo de Bildoprezento
es: Configuración de cambio de diapositivas
fr: Configuration du diaporama
hr: Slideshow Konfiguracija
id: Konfigurasi Slideshow
ja: スライドショーの設定
pl: Konfiguracja Pokazu Slajdów
uk: Налаштування показу слайдів
zh_cn: Slideshow 配置

source: Cycle Time
cs: Čas cyklu
eo: Cikla Tempo
fr: Périodicité
hr: Vrijeme Ciklusa
id: Durasi
ja: 切替間隔
pl: Czas cyklu
uk: Час повторення
zh_cn: 循环时间

source: Disable Timer
cs: Zakázat časovač
eo: Neebligi Tempoplanilon
es: Deshabilitar Temporizador
fr: Désactiver le minuteur
hr: Isključi Sat
id: Non-aktifkan Penghitung Waktu
ja: 背景を切り替えない
pl: Wyłącz minutnik
uk: Вимкнути таймер
zh_cn: 禁用计时器

source: %3.0f seconds
cs: %3.0f sekund
eo: %3.0f secondoj
es: %3.0f segundos
fr: %3.0f secondes
hr: %3.0f sekunde
ja: %3.0f 秒
pl: %3.0f sekund
uk: %3.0f секунд
zh_cn: %3.0f 秒

source: Directory
cs: Adresář
eo: Dosierujo
es: Carpeta
fr: Dossier
hr: Direktorij
id: Direktori
ja: ディレクトリ
pl: Folder
uk: Тека
zh_cn: 目录

source: Sub-directory to use for backgrounds
cs: Subadresář pro použití jako pozadí
eo: Patraj dosierujoj por uzado de ekranfonoj
es: Subdirectory para usar para fondos
fr: Chemin des fonds d'écrans
hr: Pod-direktorij za upotrebu za pozadine
id: Sub-direktori untuk gambar latar belakang
ja: 背景の保管場所
pl: Podkatalog dla plików tła
uk: Підтека для використання фонових елементів
zh_cn: 背景使用子目录

source: Extra
eo: Ekstra
hr: Dodatak
id: Ekstra
ja: その他
pl: Dodatkowe
uk: Додатковий
zh_cn: 附加

source: Randomize order
cs: Náhodné řazení
eo: Senvicigi ordon
es: Orden aleatorio
fr: Ordre aléatoire
hr: Postavi nasumičan red
id: Acak urutan
ja: 切替順をランダムにする
pl: Kolejnośc losowa
uk: Випадковий порядок
zh_cn: 随机排序

source: Set wallpaper on all desktops
cs: Použít wallpaper na všech plochách
eo: Difini tapeton sur ĉiuj labortabloj
es: Poner fondo de escritorio en todos los escritorios
fr: Appliquer à tous les bureaux
hr: Postavi tapetu na sve radne površine
id: Set wallpaper untuk semua desktop
ja: すべてのデスクトップの壁紙を設定する
pl: Ustaw tapetę dla wszystkich pulpitów
uk: Встановити шпалеру на всі стільниці
zh_cn: 设为所有桌面的墙纸

source: Set wallpaper on current desktop
cs: Použít wallpaper na aktivní ploše
eo: Difini tapeton sur nuna labortablo
es: Poner fondo de escritorio en escritorio actual
fr: Appliquer au bureau actuel
hr: Postavi tapetu na aktivnu radnu površinu
id: Set wallpaper untuk desktop ini saja
ja: 現在のデスクトップに壁紙を設定する
pl: Ustaw tapetę dla bieżacego pulpitu
uk: Встановити шпалеру на поточну стільницю
zh_cn: 设为当前桌面的墙纸

source: Set wallpaper on current screen
cs: Použít wallpaper na aktivní obrazovce
eo: Difini tapeton sur nuna ekrano
es: Poner fondo de escritorio en pantalla actual
fr: Appliquer à l'écran actuel
hr: Postavi tapetu na aktivni ekran
id: Set wallpaper untuk layar ini saja
pl: Ustaw tapetę bieżącego ekranu
uk: Встановити шпалеру на поточний екран
zh_cn: 设为当前屏幕的墙纸

source: Set wallpaper on current monitor (Xinerama support)
cs: Nastavit pozadí na aktuálním monitoru (Podpora Xineramy)
eo: Difini tapeton sur nuna monitoro (Xinerama subteno)
es: Poner
fr: Appliquer au moniteur actuel (support Xinerama)
hr: Postavi tapetu na aktivni monitor (Xinerama podržan)
id: Set wallpaper untuk monitor ini saja (Perlu dukungan Xinerama)
ja: 現在のモニター(Xinerama対応の場合)に壁紙を設定する
pl: Ustaw tapetę bieżącego ekranu (wsparcie Xinerama)
uk: Встановити шпалеру на поточний монітор (підтримка Xinerama)
zh_cn: 设为当前显示器的墙纸（Xinerama 支持）

source: Slideshow
eo: Foliprezento
es: Mostrar diapositivas
fr: Diaporama
pl: Pokaz slajdów
uk: Показ слайдів
zh_cn: 幻灯演示

source: Configuration
cs: Konfigurace
eo: Konfiguraĵo
es: Configuración
hr: Konfiguracija
id: Konfigurasi
ja: 設定
pl: Konfiguracja
uk: Налаштування
zh_cn: 配置
