Repository: kakaroto/e17
Catalog: e17/apps/elitaire/po/*.po
Languages: de

source: Elitaire Error in %s: missing element_value part!
de: Elitaire Fehler in %s: element_value part fehlt!

source: Elitaire Error in %s: missing element group!
de: Elitaire Fehler in %s: element group fehlt!

source: You win!
de: Gewonnen!

source: You lose!
de: Verloren!

source: Elitaire Error: cards file %s not found!
de: Elitaire Fehler: Kartendatei %s nicht gefunden!

source: Elitaire Error in %s: elitaire_card_field does not exist!
de: Elitaire Fehler in %s: elitaire_card_field existiert nicht!

source: Elitaire Error: unable to find %s theme!
de: Elitaire Fehler: kann das Theme %s nicht finden!

source: Games
de: Spiele

source: Themes
de: Themen

source: Cards
de: Karten

source: CONTEXT|Undo
de: Rückgängig

source: CONTEXT|Highscore
de: Bestenliste

source: CONTEXT|Preferences
de: Einstellungen

source: CONTEXT|About
de: Über

source: CONTEXT|New
de: Neu

source: Elitaire Error: No theme file in %s!
de: Elitaire Fehler: keine Themedatei in %s gefunden!

source: Elitaire Error: No cards file in %s!
de: Elitaire Fehler: keine Kartendatei in %s gefunden!

source: Elitaire Error: Card %s is missed!
de: Elitaire Fehler: Karte %s fehlt!

source: Elitaire Error: The bg pic is missed!
de: Elitaire Fehler: Das Deckblattbild (bg) fehlt!

source: Elitaire Error: The shadow pic is missed!
de: Elitaire Fehler: Das Schattenbild fehlt!

source: Elitaire Error: unknown game %s
de: Elitaire Fehler: unbekanntes Spiel %s

source: Elitaire Error: Callback registering failed!
de: Elitaire Fehler: die Callback-Registrierung schlug fehl!

source: About
de: Über

source: %s version %s Author: %s %s %s Thanks to: %s %s
de: %s Version %s Autor: %s %s %s Danke an: %s %s

source: Configuration
de: Konfiguration

source: Graphic
de: Grafik

source: animated movements
de: animierte Bewegungen

source: shadows
de: Schatten

source: velocity:
de: Geschwindigkeit:

source: Laziness
de: Faulheit

source: normal mode
de: normaler Modus

source: lazy mode
de: fauler Modus

source: Changes only affect after new start
de: Änderungen sind erst nach einem Neustart wirksam.

source: OpenGL (testing)
de: OpenGL (nur zum testen)

source: Elitaire Error: Could not save configuration.
de: Elitaire Fehler: kann Konfiguration nicht speichern.

source: Highscore
de: Bestenliste

source: Please insert your name
de: Bitte geben Sie Ihren Namen ein

source: Won Games:
de: gewonnene Spiele

source: Lost Games:
de: verlorene Spiele:

source: Elitaire Error: Cannot init Ecore
de: Elitaire Fehler: kann Ecore nicht initialisieren

source: Elitaire Error: Cannot init Ecore File
de: Elitaire Fehler: kann Ecore File nicht initialisieren

source: Elitaire Error: Cannot init Edje
de: Elitaire Fehler: kann Edje nicht initialisieren

source: Elitaire Error: Cannot init Ecore Config
de: Elitaire Fehler: kann Ecore Config nicht initialisieren

source: Elitaire Error: Cannot init Ewl
de: Elitaire Fehler: kann Ewl nicht initialisieren
