Repository: kakaroto/e17
Catalog: E-MODULES-EXTRA/weather/po/*.po
Languages: pt, sl, uk, zh_cn

source: Weather Settings
pt: Definições
sl: Nastavitev Vremena

source: Display Settings
pt: Definições de exibição
sl: Nastavitev zaslona
uk: Візуальні налаштування
zh_cn: 显示设置

source: Simple
pt: Simples
sl: Preprosto
uk: Прості
zh_cn: 简单

source: Detailed
pt: Detalhes
sl: Podrobno
uk: Деталізовані
zh_cn: 详细信息

source: Poll Time
pt: Intervalo entre atualizações
sl: Čas posodabljanja
uk: Час запиту
zh_cn: 更新时间

source: %2.0f minutes
pt: %2.0f minutos
sl: %2.0f·min.
uk: %2.0f хвилин
zh_cn: %2.0f 分钟

source: Degree Settings
pt: Unidade de medida
sl: Nastavitev stopinj
uk: Налаштування градусів
zh_cn: 单位设置

source: Celsius
sl: Celzija
uk: Цельсій
zh_cn: 摄氏

source: Farenheit
sl: Farenheita
uk: Фаренгейт
zh_cn: 华氏

source: ICAO Code
pt: Código ICAO
sl: ICAO·Šifra
uk: Код МОЦА(Міжнародна організація цивільної авіації)
zh_cn: ICAO 代码

source: Get your ICAO code at:
pt: Obtenha o seu código ICAO em:
sl: Dobi svojo·ICAO·šifro na:
uk: Отримати свій код на сайті:
zh_cn: 请在以下地址获得您的 ICAO 代码：

source: Weather
pt: Meteorologia
sl: Vreme
uk: Погода

source: Settings
pt: Definições
sl: Nastavitve

source: Weather Configuration
uk: Налаштування погоди
zh_cn: Weather 配置

source: Configuration
uk: Налаштування
zh_cn: 配置
