Repository: kakaroto/e17
Catalog: E-MODULES-EXTRA/forecasts/po/*.po
Languages: eo, he, uk

source: Forecasts Configuration
eo: Konfiguraĵo de Vetero
he: תצורת התחזיות
uk: Налаштування пронозу погоди

source: Display Settings
eo: Vidigaj Agordoj
he: הגדרות תצוגה
uk: Налаштування екрана

source: Poll Time
he: זמן האיחזור
uk: Час запиту

source: %2.0f minutes
eo: %2.0f minutoj
he: %2.0f דקות
uk: %2.0f хвилин

source: Show Description
eo: Vidigi Priskibon
he: הצג תיאור
uk: Показати опис

source: Popup on mouse over
he: הקפצת חלונית עם מעבר העכבר
uk: Виринання при наведені курсора

source: Unit Settings
eo: Agordoj de Unuoj
he: הגדרות יחידה
uk: Налаштування одиниць вимірювання

source: Metric
eo: Metriko
he: מטרית
uk: Метричний

source: English
eo: Angla
he: אימפריאלית
uk: Англійська

source: Yahoo Forecasts Code
eo: Vetera Kodo de Yahoo
he: קוד התחזית של יאהו
uk: Код прогнозу погоди Yahoo

source: Yahoo Forecasts Code/US Zip Code
eo: Yahoo Forecasts Code/Usona Poŝtkodo
he: קוד התחזיות של יאהו/קוד המיקוד האמריקאי
uk: Код/US Zip код прогнозу погоди Yahoo

source: To find the code for your area, go to:
eo: Por trovi la kodon por via zono, iru al:
he: על מנת למצוא את הקוד התואם לאזורך, פנה אל:
uk: Щоб знайти код вашої місцевості, відвідайте:

source: %s, find your area, and look at the URL
eo: %s, trovu vian zonon, kaj rigardu la URL-on
he: %s, מצא את האזור שלך, והבט בכתובת
uk: %s, знайдіть вашу місцевість, і загляньте за посиланням

source: Forecasts
eo: Veteroj
he: תחזיות
uk: Прогноз погоди

source: Configuration
eo: Konfiguraĵo
he: תצורה
uk: Налаштування

source: Wind Chill
eo: Venta malvarmigo
he: משב הרוח
uk: Прохолодний вітер

source: Wind Speed
eo: Venta Rapideco
he: מהירות הרוח
uk: Швидкий вітер

source: Humidity
eo: Humideco
he: לחות
uk: Вологість

source: Visibility
eo: Videbleco
he: ראות
uk: Видимість

source: Pressure
eo: Aerpremo
he: לחץ
uk: Тиск

source: Rising
eo: Sunleviĝo
he: מתחזקת
uk: Зростання

source: Falling
eo: Krepusko
he: נחלשת
uk: Спадання

source: Steady
eo: Konstanta
he: יציבה
uk: Рівномірний

source: Sunrise / Sunset
eo: Suna leviĝo / malleviĝo
he: זריחה / שקיעה
uk: Схід / Захід

source: High
eo: Alta
he: גבוהה
uk: Високий

source: Low
eo: Malalta
he: נמוכה
uk: Низький
