Repository: kakaroto/e17
Catalog: E-MODULES-EXTRA/photo/po/*.po
Languages: eo, es, fi, fr, hr, hu, it, pt, uk

source: <hilight>Viewer %s not found !</hilight><br><br>You can change the viewer for images in Photo module configuration panel (Advanced view)
eo: <hilight>Regardilo %s ne trovita!</hilight><br><br> Vi povas ŝanĝi la regardilon por bildoj en la panelo de agordo de la modulo de fotoj (detala vido)
es: <hilight>¡No se ha encontrado el visor %s!</hilight><br><br>Puede cambiar el visor de imágenes en el panel de configuración del módulo de fotos (Vista avanzada).
fi: <hilight>Katselinta %s ei löytynyt</hilight><br><br>Voit vaihtaa kuvien katselinta Fotomoduulin asetuspaneelissa (lisäasetusnäyttö)
fr: <hilight>Le programme %s est introuvable !</hilight><br><br>Vous pouvez changer le programme de visualisation des images dans le panneau de configuration du module photo (mode Avancé)
hr: <hilight>Preglednik %s nije pronađen!</hilight><br><br>Možete promijeniti preglednik za slike u konfiguracionom panelu Foto modula (Napredni pregled)
hu: <hilight>%s Nézegető nem található!</hilight><br><br> Megváltoztathatod a nézegetőt a fénykép modul beállításoknál. (speciális beállítások)
it: <hilight>Visualizzatore %s non trovato!</hilight><br><br>Si può cambiare il visualizzatore per le immagini dal<br>pannello di configurazione del modulo Photo (modo avanzato).
pt: <hilight>O visualizador %s não foi encontrado !</hilight><br><br>Pode alterar o visualizador de imagens no painel de configurações do módulo.
uk: <hilight>Переглядач %s не знайдено !</hilight><br><br>Ви можете змінити переглядача зображень у панелі налаштування світлини (Розширений перегляд).

source: Pause slideshow
eo: Paŭzi la bildoprezenton
es: Pausar presentación
fi: Pysäytä kuvaesitys
fr: Interrompre le diaporama
hr: Pauziraj slideshow
hu: Diavetítés szüneteltetése
it: Pausa presentazione
pt: Pausar apresentação
uk: Зупинити показ слайдів

source: Resume slideshow
eo: Restarigi la bildoprezenton
es: Reiniciar presentación
fi: Jatka kuvaesitystä
fr: Reprendre le diaporama
hr: Nastavi slideshow
hu: Diavetítés folytatása
it: Continua presentazione
pt: Retomar apresentação
uk: Продовжити показ слайдів

source: Picture informations
eo: Informoj pri la bildo
es: Imformaciones de imágenes
fi: Kuvan tiedot
fr: Informations de l'image
hr: Informacije o Slici
hu: Kép információk
it: Informazioni immagine
pt: Informações da imagem
uk: Інформація про малюнок

source: Open in
eo: Malfermi en
es: Abrir en
fi: Avaa
fr: Ouvrir dans
hr: Otvori u
hu: Megnyitás -ban, -ben
it: Apri con
pt: Abrir com
uk: Відкрити в

source: Configure Photo module
eo: Agordi la modulon de fotoj
es: Configurar módulo de fotos
fi: Muokkaa Fotomoduulia
fr: Configurer le module photo
hr: Konfiguriraj Foto modul
hu: Fénykép modul beállítása
it: Configura il modulo Photo
uk: Налаштування світлини

source: Configure this Photo gadget
eo: Agordi ĉi tiun akcesoraĵon de fotoj
es: Configurar este gadget de fotos
fi: Muokkaa tätä Fotovempainta
fr: Configurer ce gadget photo
hr: Konfiguriraj ovaj Foto Gadget
hu: Fénykép modul beállítása
it: Configura questo gadget di Photo
uk: Налаштувати цей фотоґаджет

source: Configure Gadget and Shelf
eo: Agordi akcesoraĵojn kaj bretojn
es: Configurar gadget y Shelf
fi: Muokkaa vempainta ja hyllyä
fr: Configurer le gadget et le rack
hr: Konfiguriraj Gadget i Shelf
hu: Polc és modul beállítása
it: Configura gadget e mensola
uk: Налаштування ґаджета і полиці

source: Historic
eo: Kronologia
es: Histórico
fi: Historia
fr: Historique
hr: Povijesno
hu: Történet
it: Storico
pt: Histórico
uk: Історичний

source: <hilight>Directory %s doesnt exists.</hilight><br><br>You can change the picture's folders in main configuration panel<br>They can be jpeg or png<br><br>After import, if you can remove these files and the pictures still can<br>be viewed, but you wont be able to set them as wallpaper anymore<br><br>
eo: <hilight>La dosierujo %s ne ekzistas.</hilight><br><br> Vi povas ŝanĝi la dosierujoj de bildoj en la ĉefa panelo de agordoj.<br> Ili povas esti jpeg aŭ png<br><br> Post importado, se vi forigis ĉi tiujn dosierojn kaj se la bildoj<br> ĉiam videblas, sed vi ne plu povos uzi ilin kiel ekranfono<br><br>
es: <hilight>El directorio %s no existe.</hilight><br><br>Puede cambiar la carpeta de imágenes en el panel principal de configuración.<br>Éstas pueden ser jpeg o png<br><br>Después de importarlas, puede eliminar estas imágenes y se seguirán viendo<br> pero ya no podrá ponerlas como fondo de pantallas.<br><br>
fi: <hilight>Hakemistoa %s ei ole olemassa.</hilight><br><br>Voit vaihtaa kuvien kansioita pääasetuspaneelissa<br>Ne voivat olla joko jpeg- tai png-tiedostoja<br><br>Jos tuonnin jälkeen voitkin poistaa nämä kuvat ja silti katsella<br>niitä, et kuitenkaan voi asettaa niitä enää taustakuvaksi<br><br>
fr: <hilight>Le dossier %s n'existe pas.</hilight><br><br>Vous pouvez changer les dossiers d'images dans le panneau de configuration principal<br>On peut utiliser le format jpeg ou png<br><br>Après l'importation, vous pouvez supprimer ces fichiers et ils resteront visibles,<br>mais vous ne pourrez plus alors les choisir comme papier peint<br><br>
hr: <hilight>Direktorij %s ne postoji.</hilight><br><br>Možete promijeniti mape slika u glavnom konfiguracionom panelu.<br>One mogu biti .jpeg ili .png<br><br>Nakon uvoza možete ukloniti ove datoteke i slike i dalje mogu biti pregledavane,<br>ali ih više ne možete postaviti kao pozadinu.<br><br>
hu: <hilight>%s könyvtár nem létezik.</hilight><br><br> Megváltoztathatod a képek könyvtárát az alap beállításoknál.<br> Ezek lehetnek jpeg vagy png képek.<br><br> Az importálás után bármikor eltávolíthatja ezeket a képeket, de a továbbiakban ugyanúgy <br>megnézheti őket.
it: <hilight>La directory %s non esiste.</hilight><br><br>Si possono cambiare le directory immagini dal pannello<br>di configurazione. Si possono usare jpeg o png<br><br>Dopo l'importazione si possono rimuovere i file e le<br>immagini possono continuare ad essere visualizzate,<br>ma non sarà più possibile impostarle come sfondo.<br><br>
pt: <hilight>O diretório %s não existe.</hilight><br><br>Pode alterar as pastas com imagens no painel de configuração.<br>As fotos podem ser do tipo .jpeg ou .png<br><br>Após a importação, pode remover os ficheiros pois as imagens ainda estarão visíveis, mas já não as consegue definir como imagem de fundo.
uk: <hilight>Тека %s не існує.</hilight><br><br>Ви можете змінити фототеку в головній панелі налаштувань<br>Вони можуть бути в jpeg або png форматі<br><br>Після імпорту, якщо ви можете вилучити ті файли і малюнки буде можна <br>переглядати, але ви бажаєте встановлювати їх ще як тло<br><br>

source: Photo Module Information
eo: Informo pri la modulo de fotoj
es: Información del módulo de fotos
fi: Fotomoduulin tiedot
fr: Information du module photo
hr: Informacije o oto Modulu
hu: Fénykép modul információ
it: Informazioni modulo Photo
pt: Informação do módulo
uk: Інформація про світлину

source: <hilight>Creating thumbs</hilight><br><br>Some pictures are being thumbed in a <hilight>background task</hilight>.<br>It can take a while, but after, loading will be faster and lighter :)<br><br>Each time wou will load pictures that haven't been loaded in Photo module before,<br>they will be thumbed.<br><br>While creating popups, you will not be able to see any picture in Photo.<br>I hope i'll be able to change that :)
eo: <hilight>Kreado de miniaturoj</hilight><br><br> Kelkaj bildoj estas miniaturigintaj en <hilight>fona tasko</hilight>.<br> Tio povas malŝpari tempon, sed poste, ŝargado estos pli rapida kaj malpeza :)<br><br> Ĉiufoje kiam vi ŝargos bildojn, kiuj ne estis antaŭe ŝargitaj en la modulo de fotoj, ili estos<br> miniaturigitaj.<br><br>Dum kreado de ŝprucfenestroj, vi ne povas vidi iun ajn<br>bildon en Foto.<br>Mi esperas, ke mi scipovos ŝanĝi tion :)
es: <hilight>Crear miniaturas</hilight><br><br>Algunas imágenes se miniaturizarán en una <hilight>tarea en el fondo</hilight>.<br>Puede tardar un rato, pero después, cargarán más rápidas y ligeras :)<br><br>Cada vez que carge imágenes que no se hayan cargado por el módulo de fotos antes,<br>se les crearán miniaturas.<br><br>Mientras se les crean emergentes, no podrá ver ninguna imagen en Photo.<br>Espero poder cambiar esto :)
fi: <hilight>Luodaan pienoiskuvia</hilight><br><br>Jotkin kuvat käsitellään <hilight>taustatyönä</hilight>.<br>Se voi kestää hetken, mutta sen jälkeen kuvien lataaminen on nopeampaa ja keveämpää :)<br><br>Aina kun lataat Fotomoduulissa kuvia, joita ei aikaisemmin ole ladattu,<br>ne pienoiskuvitetaan.<br><br>Ponnahduksia luotaessa et voi nähdä yhtään kuvaa Fotossa.<br>Toivon voivani muuttaa tämän joskus :)
fr: <hilight>Génération des vignettes</hilight><br><br>Des images sont en cours de miniaturisation en <hilight>tâche de fond</hilight>.<br>Cela peut prendre un peu de temps mais, par la suite, le chargement sera bien plus rapide :) <br><br>À chaque fois que des images inconnues du module photo seront chargées<br>elles seront miniaturisées.<br><br>Pendant la création des pop-up, il est impossible de regarder des images dans Photo.<br>J'espère que je pourrais arranger ça :)
hr: <hilight>Kreiranje sličica</hilight><br><br>Od nekih slika se mogu se mogu napraviti sličice u <hilight>pozadinskom odredniku.</hilight><br>Ovo može trajati duže vremena, ali naknadno učitavanje će biti puno brže i lakše:)<br><br>Svaki put kad učitavate slike koje nisu već unesene u Foto module, <br>program će za njih kreirati sličice.<br><br>Međutim, još uvijek kod kreiranja pop-ups nećete moći vidjeti slike u Foto.<br>Nadam se da ću to uskoro riješiti:)
it: <hilight>Creazione miniature</hilight><br><br>Si stanno creando miniature di alcune immagini in<br>un <hilight>processo in background</hilight>.<br>Questo può impiegare del tempo, ma in seguito il<br>caricamento sarà più veloce e leggero :)<br><br>Ogni volta che si caricheranno immagini che non sono<br>mai state caricate prima in Photo per esse verrà<br>creata una miniatura.<br><br>Durante la creazione dei popup non si potrà vedere<br>nessuna immagine in Photo.<br>Spero di poter risolvere questo :)
pt: <hilight>A criar miniaturas</hilight><br><br>Estão a ser criadas miniaturas das imagens numa <hilight>tarefa secundária</hilight>.<br>Inicialmente pode levar algum tempo mas, posteriormente, o carregamento das fotos será mais rápido :)<br><br>Cada vez que carregar imagens que não tenham sido abertas no módulo, será criada uma miniatura.<br>Durante a criação, não será capaz de ver as fotos.<br>Espero conseguir alterar isto :)
uk: <hilight>Створення ескізів</hilight><br><br>Деякі малюнки працюють <hilight>фоново</hilight>.<br>Це може зайняти трохи часу, але згодом завантаження буде швидшим і світлішим :)<br><br>Кожного разу малюнки, що не були завантажені в світлину раніше,<br>будуть завантажуватись.<br><br>Упродовж створення виринань ви не зможете бачити які-небудь малюнки в світлині<br>Сподіваюсь, я це виправлю :)

source: Module Settings
pt: Definições do módulo

source: Settings
pt: Definições
