Repository: kakaroto/e17
Catalog: E-MODULES-EXTRA/photo/po/*.po
Languages: eo, es, fi, fr, hr, hu, it, pt, uk

source: Photo Module
eo: Modulo de fotoj
es: Módulo foto
fi: Fotomoduuli
fr: Module photo
hr: Foto Modul
hu: Fénykép modul
it: Modulo Photo
pt: Módulo de fotos
uk: Світлина

source: E Canvas init failed !
eo: Pravalorizo de E-Canvas malsukcesis!
es: ¡Y falló la inicialización del lienzo!
fi: E-kankaan käynnistys epäonnistui!
fr: Échec de l'Initialisation du canevas de E !
hr: ECanvas init neuspješan !
hu: E Vászon indítás nem sikerült!
it: Fallita inizializzazione canvas!
pt: Falha ao iniciar E Canvas!
uk: Не вдалось запустити полотно !

source: Theme init failed !
eo: Pravalorizo de etoso malsukcesis!
es: ¡Falló la inicialización del tema!
fi: Teeman käynnistys epäonnistui!
fr: Échec de l'initialisation du thème !
hr: Init Tema neuspješan !
hu: Téma indítás nem sikerült!
it: Fallita inizializzazione tema!
pt: Falha ao iniciar tema!
uk: Не вдалось запустити тему !

source: Config init failed
eo: Pravalorizo de agordoj malsukcesis
es: ¡Falló la inicialización de configuración!
fi: Asetusten asetus epäonnistui
fr: L'initialisation de la configuration a échoué
hr: Config init neuspješan
hu: Konfiguráció indítás nem sikerült
it: Fallita inizializzazione configurazione!
pt: Falha ao iniciar configuração!
uk: Не вдалось запустити налаштування

source: Picture subsystem init failed
eo: Pravalorizo de la bildo-subsistemo malsukcesis
es: ¡Falló la inicialización del subsistema de imagen!
fi: Kuva-alijärjestelmän käynnistys epäonnisti
fr: L'initialisation du sous-système graphique a échoué
hr: Podsustav slika init neuspješan
hu: Kép alrendszer indítás nem sikerült
it: Fallita inizializzazione sottosistema immagini!
pt: Falha ao iniciar sistema de imagens!
uk: Не вдалось запустити підсистему малюнків

source: Popup warn subsystem init failed
eo: Pravalorizo de la subsistemo de ŝprucfenestro por avertoj malsukcesis
es: ¡Falló la inicialización del subsistema de avisos emergentes!
fi: Ponnahdusvaroitusalijärjestelmän käynnistys epäonnistui
fr: L'initialisation du sous-système de pop-up d'avertissement a échoué
hr: Pop-up warn podsustav init neuspješan
hu: Felugró ablak alrendszerindítás nem sikerült
it: Fallita inizializzazione sottosistema popup d'avvertimento!
pt: Falha ao iniciar os alertas de aviso!
uk: Не вдалось запустити підсистему виринань застережень

source: Popup info subsystem init failed
eo: Pravalorizo de la informo-subsitemo malsukcesis
es: Falló la inicialización del subsistema de notificaciones emergentes
fi: Ponnahdustietoalijärjestelmän käynnistys epäonnistui
fr: L'initialisation du sous-système de pop-up d'information a échoué
hr: Pop-up info podsustav init neuspješan
hu: felugró információ indítása nem sikerült
it: Fallita inizializzazione sottosistema popup d'informazione!
pt: Falha ao iniciar os alertas de informações!
uk: Не вдалось запустити підсистему виринань інформації

source: Photo
eo: Foto
es: Foto
fi: Foto
hr: Foto
hu: Fénykép
pt: Foto
uk: Світлина

source: <hilight>Photo module : Configuration Upgraded</hilight><br><br>Your configuration of photo module<br>has been upgraded<br>Your settings were removed<br>Sorry for the inconvenience<br><br>(%d -> %d)
eo: <hilight>Modulo de fotoj: Agordoj ĝisdatigitaj</hilight><br><br>Viaj agordoj de la modulo<br>estas ĝisdatigitaj<br>Viaj agordoj estis forigitaj<br>Pardonu por la ĝeno<br><br>(%d → %d)
es: <hilight>Módulo Photo: configuración actualizada</hilight><br><br>Su Configuración del módulo de fotos<br>fue actualizada<br>Sus preferencias fueron eliminadas<br>Disculpe las molestias<br><br>(%d -> %d)
fi: <hilight>Fotomoduuli : Asetukset päivitetty</hilight><br><br>Sinun Fotomoduulisi asetukset<br>on päivitetty<br>Asetuksesi poistettiin<br>Pahoittelut aiheutetusta vaivasta<br><br>(%d -> %d)
fr: <hilight>Module photo: Configuration actualisée</hilight><br><br>La configuration du module photo<br>a dû être mise à jour<br>Vos réglages ont été supprimés<br>Désolé pour le désagrément<br><br>(%d -> %d)
hr: <hilight>Foto modul: Konfiguracija Nadograđena</hilight><br><br>Vaša konfiguracija foto modula<br>je nadograđena.<br>Vaše postavke su uklonjene.<br>Žao nam je zbog neugodnosti.<br><br>(%d -> %d)
hu: <hilight>Fénykép modul : Beállítások frisstve</hilight><br><br> A beállításaid<br> frisstve lettek<br>. A korábbi beállításaid törölve lettek<br> Elnézést kérünk<br><br>(%d -> %d)
it: <hilight>Modulo Photo: aggiornamento configurazione</hilight><br><br>La vostra configurazione del modulo Photo<br>è stata aggiornata<br>Le vostre impostazioni sono state cancellate<br>Ci scusiamo per l'inconveniente<br><br>(%d -> %d)
pt: <hilight>Módulo de fotos: configuração atualizada</hilight><br><br>A configuração do módulo foi atualizada.<br>As suas definições foram removidas.<br>Desculpe qualquer inconveniente.<br><br>(%d -> %d)
uk: <hilight>Світлина : налаштування оновлені</hilight><br><br>Ваші налаштування світлини<br>оновлені<br>Ваші налаштування вилучені<br>Вибачте за незручності<br><br>(%d -> %d)

source: Photo Module version
eo: Versio de la modulo de fotoj
es: Módulo Photo versión
fi: Fotomoduulin versio
fr: Version du module photo
hr: Inačica Foto Modula
hu: Fénykép modul verzió
it: Modulo Photo versione
pt: Versão do módulo
uk: Версія світлини

source: <hilight>Photo module : Configuration Downgraded</hilight><br><br>Your configuration of Photo module<br>has been downgraded<br>Your settings were removed<br>Sorry for the inconvenience<br><br>(%d ->%d)
eo: <hilight>Modulo de fotoj: Agordoj antaŭdatigitaj</hilight><br><br>Viaj agordoj de la modulo de fotoj<br>estas antaŭdatigita<br>Viaj agordoj estis forigitaj<br>Pardonu por la malagrablaĵo<br><br>(%d →%d)
es: <hilight>Módulo de fotos: configuración revertida</hilight><br><br>La configuración del módulo de fotos <br>ha sido revertida<br>Tus preferencias se han borrado<br>Sentimos las molestias<br><br>(%d ->%d)
fi: <hilight>Fotomoduuli : Asetukset alipäivitetty</hilight><br><br>Sinun Fotomoduulisi asetukset<br>on alipäivitetty<br>Asetuksesi poistettiin<br>Pahoittelut aiheutetusta vaivasta<br><br>(%d -> %d)
fr: <hilight>Module photo: Configuration rétrogradée</hilight><br><br>La configuration du module photo<br>a dû être ramenée à un état intérieur<br>Vos réglages ont été supprimés<br>Désolé pour le désagrément<br><br>(%d -> %d)
hr: <hilight>Foto modul: Konfiguracija Unazađena</hilight><br><br>Vaša konfiguracija foto modula<br>je unazađena.<br>Vaše postavke su uklonjene.<br>Žao nam je zbog neugodnosti.<br><br>(%d ->%d)
hu: <hilight>Fénykép modul : Beállítások visszaállítva</hilight><br><br> A beállításaid<br> vissza lettek állítva<br>. A korábbi beállításaid törölve lettek<br> Elnézést kérünk<br><br>(%d -> %d)
it: <hilight>Modulo Photo: ripristino configurazione</hilight><br><br>La vostra configurazione del modulo Photo<br>è stata ripristinata<br>Le vostre impostazioni sono state cancellate<br>Ci scusiamo per l'inconveniente<br><br>(%d -> %d)
pt: <hilight>Módulo de fotos: configuração revertida</hilight><br><br>A configuração do módulo foi revertida.<br>As suas definições foram removidas.<br>Desculpe qualquer inconveniente.<br><br>(%d -> %d)
uk: <hilight>Світлина : налаштування понижені версією</hilight><br><br>Ваші налаштування світлини<br>понижені версією<br>Ваші налаштування вилучені<br>Вибачте за незручність<br><br>(%d ->%d)

source: Photo Configuration
eo: Agordo de fotoj
es: Configuración de foto
fi: Foton asetukset
fr: Configuration de photo
hr: Foto Konfiguracija
hu: Fénykép beállítás
it: Configurazione di Photo
pt: Configuração
uk: Налаштуванння світлини

source: Picture directories
eo: Dosierujoj de bildoj
es: Directorios de imágenes
fi: Kuvahakemistot
fr: Dossiers des images
hr: Direktoriji Slika
hu: Kép könyvtár
it: Directory immagini
pt: Diretórios de imagens
uk: Фототеки

source: Add
eo: Aldoni
es: Añadir
fi: Lisää
fr: Ajouter
hr: Dodaj
hu: Hozzáadás
it: Aggiungi
pt: Adicionar
uk: Створити

source: Delete
eo: Forigi
es: Eliminar
fi: Poista
fr: Effacer
hr: Izbriši
hu: Törlés
it: Elimina
pt: Apagar
uk: Вилучити

source: Configure
eo: Agordoj
es: Configurar
fi: Muokkaa
fr: Configurer
hr: Konfiguriraj
hu: Beállítás
it: Configura
pt: Configurar
uk: Налаштування

source: Reload picture directories
eo: Reŝargi la dosierujojn de bildoj
es: Recargar directorios de imágenes
fi: Lataa kuvahakemistot uudelleen
fr: Recharger les dossiers des images
hr: Ponovno učitavanje direktorija slika
hu: Kép könyvtár újratöltése
it: Ricarica directory immagini
pt: Atualizar diretórios de imagens
uk: Оновити фототеки

source: Stop loading
eo: Ĉesigi ŝargadon
es: Detener la carga
fi: Lopeta lataaminen
fr: Arrêter le chargement
hr: Prestani sa učitavanjem
hu: Betöltés leállítása
it: Ferma caricamento
pt: Parar de carregar
uk: Зупинити оновлення

source: Appearance
eo: Aspekto
es: Apariencia
fi: Ulkonäkö
fr: Aspect
hr: Izgled
hu: Megjelenés
it: Aspetto
pt: Aparência
uk: Вигляд

source: Always show label
eo: Montri ĉiam etikedon
es: Siempre mostrar etiqueta
fi: Näytä aina nimike
fr: Toujours afficher l'étiquette
hr: Uvijek prikaži oznaku
hu: Mindig mutasd a címkét
it: Mostra sempre etichetta
pt: Mostrar sempre o texto
uk: Постійно показувати мітки

source: Nice transitions
eo: Agrablaj transpasoj
es: Efectos de transición
fi: Sulavat siirtymät
fr: Transitions améliorées
hr: Lijep prijelaz
hu: Kellemes megjelenés
it: Transizioni carine
pt: Transições suaves
uk: Успішне переміщення

source: Default Mouse actions
eo: Defaŭltaj agadoj de muso
es: Acciones de ratón predeterminadas
fi: Oletushiiritoiminnot
fr: Actions de la souris par défaut
hr: Zadane akcije Miša
hu: Alapértelmezett egérműveletek
it: Azioni predefinite del mouse
pt: Ações padrão do rato
uk: Типові дії миші

source: Over
eo: Supre
es: Sobre
fi: Yllä
fr: Survol
hr: Preko
hu: Felül
it: Sopra
pt: Sobre
uk: Правий

source: Left
eo: Maldekstren
es: Izquierda
fi: Vasen
fr: Gauche
hr: Lijevo
hu: Balra
it: Sinistro
pt: Esquerda
uk: Лівий

source: click
eo: alklaki
es: Pulsar
fi: klikkaa
fr: clic
hr: klik
hu: kattints
pt: clique
uk: клац

source: Middle
eo: Meza
es: Medio
fi: Keski
fr: Milieu
hr: Sredina
hu: Középre
it: Centrale
pt: Central
uk: Середній

source: No
eo: Ne
fi: Ei
fr: Non
hr: Ne
hu: Nem
pt: Não
uk: Нема

source: Popups
eo: Ŝprucfenestroj
es: Emergentes
fi: Ponnahdukset
fr: Pop-up
hu: Felugró ablakok
it: Popup
pt: Alertas
uk: Виринання

source: Picture loader popup
eo: Ŝprucfenestro de bildo-ŝargilo
es: Cargador de imágenes emergente
fi: Kuvanlataimen ponnahdus
fr: Pop-up au chargement de l'image
hr: Pop-up za učitavač slika
hu: Felugró képbetöltés
it: Popup caricamento immagine
pt: Alertas de carregamento
uk: Завантажувач виринань малюнків

source: Never
eo: Neniam
es: Nunca
fi: Ei koskaan
fr: Jamais
hr: Nikad
hu: Soha
it: Mai
pt: Nunca
uk: Ніколи

source: Summary
eo: Resumo
es: Resumen
fi: Yhteenveto
fr: Résumé
hr: Sažetak
hu: Összegzés
it: Sommario
pt: Resumo
uk: Підсумок

source: Verbose
eo: Detaleme
es: Detallado
fi: Kattava
fr: Verbeux
hr: Preopširan
hu: Bőbeszédű
it: Prolisso
pt: Detalhes
uk: Багатослівний

source: Miscellaneous
eo: Aliaĵoj
es: Varios
fi: Sekalainen
fr: Divers
hr: Razno
hu: Egyebek
it: Varie
pt: Diversos
uk: Різноманітний

source: Remove generated backgrounds
eo: Forigi generitajn ekranfonojn
es: Eliminar fondos generados
fi: Poista luodut taustakuvat
fr: Supprimer les fonds d'écran générés
hr: Ukloni generirane pozadine
hu: Hátterek eltávolítása
it: Elimina sfondi generati
pt: Remover imagens de fundo geradas
uk: Вилучити стоворені фонові елементи

source: Pictures viewer
eo: Montrilo de bildoj
es: Visor de imágenes
fi: Kuvankatselin
fr: Programme de visualisation
hr: Preglednik Slika
hu: Képnéző
it: Visualizzatore immagini
pt: Visualizador de imagens
uk: Переглядач малюнків

source: Images Quality
eo: Kvalito de bildoj
es: Calidad de imágenes
fi: Kuvanlaatu
fr: Qualité des images
hr: kvalitete Slika
hu: Képek minősége
it: Qualità immagini
pt: Qualidade das imagens
uk: Якість малюнків

source: %1.0f pix
eo: %1.0f rastrumeroj
fi: %1.0f pikseliä
fr: %1.0f pixels
hu: %1.0f pixel
it: %1.0f pixel
uk: %1.0f пікселів

source: Automaticly reload directories
eo: Aŭtomate reŝargi la dosierujojn de bildoj
es: Recarga automática de directorios
fi: Lataa hakemistot uudelleen automaattisesti
fr: Rechargement automatique des dossiers
hr: Automatski preučitaj direktorije
hu: Könyvtárak automatikus újratöltése
it: Ricarica directory automaticamente
pt: Recarregar diretórios automaticamente
uk: Автоматично оновлювати теки

source: when add / modify directory list
eo: post aldono/modifo de la listo de dosierujoj
es: al añadir/modificar lista de directorios
fi: lisättäessä / muokattaessa hakemistolistaa
fr: Quand ajout / modification de la liste
hr: kod dodavanja / modificiraj listu direktorija
hu: könyvtárlista módosításánál / hozzáadásánál
it: quando aggiungi/modifichi elenco directory
pt: ao adicionar/modificar diretórios
uk: коли створюють/змінюють список теки

source: Show label
eo: Montri etikedon
es: Mostrar etiqueta
fi: Näytä nimike
fr: Afficher l'étiquette
hr: Prikaži oznaku
hu: Címke megjelenítése
it: Mostra etichetta
pt: Mostrar texto
uk: Показати мітки

source: Show informations
eo: Montri informojn
es: Mostrar informaciones
fi: Näytä tiedot
fr: Afficher les informations
hr: Prikaži informacije
hu: Információk megjelenítése
it: Mostra informazioni
pt: Mostrar informações
uk: Показати інформацію

source: Previous picture
eo: Antaŭa bildo
es: Imagen anterior
fi: Edellinen kuva
fr: Image précédente
hr: Prethodna slika
hu: Előző kép
it: Immagine precedente
pt: Imagem anterior
uk: Попередній малюнок

source: Next picture
eo: Sekva bildo
es: Imagen siguiente
fi: Seuraava kuva
fr: Image suivante
hr: Slijedeća slika
hu: Következő kép
it: Immagine successiva
pt: Imagem seguinte
uk: Наступний малюнок

source: Pause
eo: Paŭzo
es: Pausa
fi: Tauko
hr: Pauza
hu: Szünet
it: Pausa
pt: Pausa
uk: Призупинити

source: Set as background
eo: Difini kiel ekranfono
es: Establecer como fondo
fi: Aseta taustakuvaksi
fr: Choisir comme fond d'écran
hr: Postavi kao pozadinu
hu: Beállítás háttérképnek
it: Imposta come sfondo
pt: Definir como imagem de fundo
uk: Встановинити як тло

source: Open viewer
eo: Malfermi rigardilon
es: Abrir visor
fi: Avaa katselin
fr: Ouvrir le programme de visualisation
hr: Otvori preglednik
hu: Néző megnyitása
it: Apri visualizzatore
pt: Abrir visualizador
uk: Відкрити переглядач

source: Show menu
eo: Montri menuon
es: Mostrar menú
fi: Näytä valikko
fr: Afficher le menu
hr: Prikaži izbornik
hu: A menü megjelenítése
it: Mostra menù
pt: Mostrar menu
uk: Показати меню

source: Photo Directory Configuration
eo: Agordoj de la dosiero de bildoj
es: Configuración del directorio de fotos
fi: Foton hakemistoasetukset
fr: Configuration du dossier de Photo
hr: Konfiguracija Foto Direktorija
hu: Fénykép könyvtár beállítás
it: Configurazione directory di Photo
pt: Configuração do diretório de fotos
uk: Налаштування фототеки

source: Directory
eo: Dosierujo
es: Directorio
fi: Hakemisto
fr: Dossier
hr: Direktorij
hu: Könyvtár
pt: Diretório
uk: Тека

source: Loading options
eo: Opcioj de ŝargado
es: Cargando opciones
fi: Latauksen valinnat
fr: Options de chargement
hr: Učitavanje opcija
hu: Betöltési opciók
it: Opzioni di caricamento
pt: Opções de carregamento
uk: Варіанти завантаження

source: Recursive
eo: Rekursiva
es: Recursivo
fi: Rekursiivinen
fr: Récursif
hr: Suvratan
hu: Rekurzív:
it: Ricorsiva
pt: Recursivo
uk: Рекурсивний

source: Read hidden files
eo: Legi kaŝitajn dosierojn
es: Leer archivos ocultos
fi: Lue piilotiedostot
fr: Inclure les fichiers cachés
hr: Čitaj skrivene datoteke
hu: Rejtett fájlok olvasása
it: Leggi file nascosti
pt: Ler ficheiros ocultos
uk: Прочитати приховані файли

source: Photo Module Warning
eo: Averto de la modulo de fotoj
es: Avisos del módulo de fotos
fi: Fotomoduulin varoitus
fr: Avertissement du module photo
hr: Foto Module Upozorenje
hu: Fénykép modul figyelmeztetés
it: Avvertimento modulo Photo
pt: Aviso do módulo de fotos
uk: Застереження світлини

source: Photo Item Configuration
eo: Agordo de elemento de fotoj
es: Configuración de fotografía
fi: Foton kohteen asetukset
fr: Configuration de l'élément Photo
hr: Konfiguracija Foto Jedinke
hu: Fénykép elem beállítás
it: Configurazione elemento Photo
pt: Configuração dos itens
uk: Налаштування фотопунктів

source: Timer between pictures change
eo: Tempo inter ŝanĝoj de bildoj
es: Tiempo entre cambio de imágenes
fi: Ajastin kuvien vaihtamiselle
fr: Minuterie du changement d'images
hr: Promjena tajmera između slika
hu: Képváltási időközök
it: Intervallo cambio immagine
pt: Duração entre a transição de imagens
uk: Таймер між малюнками змінює

source: Activate
eo: Aktivigi
es: Activar
fi: Aktivoi
fr: Activer
hr: Aktiviraj
hu: Aktiválás
it: Attiva
pt: Ativar
uk: Увімкнути

source: %1.0f seconds
eo: %1.0f sekundoj
es: %1.0f segundos
fi: %1.0f sekuntia
fr: %1.0f secondes
hr: %1.0f sekundi
hu: %1.0f másodperc
it: %1.0f secondi
pt: %1.0f segundos
uk: %1.0f секунд

source: Alpha
eo: Alfo
es: Alfa
fi: Alfa
fr: Transparence alpha
hr: Alfa
hu: Alfa
pt: Alfa
uk: Альфа

source: Yes
eo: Jes
es: Sí
fi: Kyllä
fr: Oui
hr: Da
hu: Igen
it: Sì
pt: Sim
uk: Так

source: Default setting
eo: Defaŭltaj agordoj
es: Configuración predeterminada
fi: Oletusasetus
fr: Paramètre par défaut
hr: Zadane postavke
hu: Alapértelmezett
it: Impostazioni predefinite
pt: Predefinições
uk: Типові налаштування

source: Mouse actions
eo: Agoj de muso
es: Acciones de ratón
fi: Hiiritoiminnot
fr: Actions de la souris
hr: Akcije Miša
hu: Egérműveletek
it: Azioni del mouse
pt: Ações do rato
uk: Дії миші

source: <hilight>File %s doesnt exists.</hilight><br><br>This file is in Photo module picture list, but it seems you removed it from the disk<br>It cant be set as background, sorry.
eo: <hilight>Dosiero %s ne ekzistas!</hilight><br><br>Ĉi tiu dosiero estas en la listo de bildoj de la modulo, sed verŝajne vi forigis ĝin el la disko.<br>Ĝi ne povas esti difinata kiel ekranfono.
es: <hilight>El archivo %s no existe.</hilight><br><br>Este archivo está en la lista del módulo de fotos, pero al parecer fue eliminado del disco<br>No puede utilizarse como fondo.
fi: <hilight>Tiedostoa %s ei ole.</hilight><br><br>Tämä tiedosto on Fotomoduulin kuvalistalla, mutta näytät poistaneesi sen levyltä.<br>Sitä ei voi asettaa taustakuvaksi, pahoittelen.
fr: <hilight>Le fichier %s n'existe pas.</hilight><br><br>Ce fichier est bien dans la liste d'images du module photo, mais il semble qu'il ne soit plus présent sur le disque dur<br>Il ne peut être choisi comme fond d'écran, désolé.
hr: <hilight>Datoteka %s ne postoji.</hilight><br><br>Ova datoteka je u Foto module listi slika, ali se čini da ste istu izbrisali sa diska.<br>Na žalost ne može se postaviti kao pozadina.
hu: <hilight>%s fájl nem létezik. </hilight><br><br>A fájl benne van a fényképlistában, de úgy látszik már letörölted a merevlemezről, <br>ezért nem tudom beállítani háttérképnek, bocsika.
it: <hilight>Il file %s non esiste.</hilight><br><br>Questo file è nell'elenco immagini del modulo Photo,<br>ma sembra che sia stato rimosso dal disco.<br>Impossibile impostarlo come sfondo.
pt: <hilight>O ficheiro %s não existe.</hilight><br><br>O ficheiro está na lista de imagens, mas não está no disco.<br>Já não o pode definir como imagem de fundo.
uk: <hilight>Файл %s не існує.</hilight><br><br>Цей файл є в списку малюнків світлини, але схоже на те, що ви вилучили його з диска<br>Тому неможливо його встановити як тло, вибачте.

source: Photo Module Error
eo: Eraro de la modulo de fotoj
es: Error del módulo de fotos
fi: Fotomoduulin virhe
fr: Erreur du module photo
hr: Greška Foto Modula
hu: Fénykép modul hiba
it: Errore modulo Photo
pt: Erro no módulo de fotos
uk: Помилка світлини

source: <hilight>e17setroot needed</hilight><br><br>%s is not an edje file !<br>Photo module needs e17setroot util from e_utils package to set you're picture as backgroundPlease install it and try again
eo: <hilight>e17setroot bezonata</hilight><br><br>%s ne estas edje-dosiero!<br>La modulo Foto bezonas la aplikaĵon e17setroot el la pakaĵo e_utils por difini vian bildon kiel ekranfono. Bonvolu instali ĝin kaj reklopodi.
es: <hilight>Se necesita e17setroot</hilight><br><br>¡%s no es un archivo edje!<br>El módulo de fotos necesita las utilidades de e17setroot del paquete e_utils para asignar la imagen como fondo. Por favor, instálelo y pruebe otra vez
fi: <hilight>e17setroot tarvitaan</hilight><br><br>%s ei ole edje-tiedosto!<br>Fotomoduuli tarvitsee e_utils-paketin e17setroot-ohjelman asettaakseen kuvasi taustakuvaksi. Asenna se ja yritä uudelleen, kiitos
fr: <hilight>e17setroot requis</hilight><br><br>%s n'est pas un fichier edj !<br>Le module photo a besoin de e17setroot (disponible dans e_utils) pour convertir votre image en fond d'écran. Merci d'installer e_utils et de réessayer
hr: <hilight>e17setroot je potreban</hilight><br><br>%s nije edje datoteka!<br>Foto modul treba e17 setroot util iz e_utils paketa da bi postavio vašu sliku kao pozadinu. Molimo instalirajte i probajte ponovo.
hu: <hilight>e17setroot szükséges</hilight><br><br>%s nem egy edje fájl! <br>A fényép modulnak szüksége van az e17setroot eszközre az e_utils csomagból, hogy beállíthassa a képedet háttérképnek.
it: <hilight>E' necessario e17setroot</hilight><br><br>%s non è un file edje!<br>Il modulo Photo ha bisogno dell'utilità e17setroot del<br>pacchetto e_utils per impostare la vostra immagine come<br>sfondo. Si prega di installarlo e riprovare.
pt: <hilight>Requer o e17setroot</hilight><br><br>%s não é um ficheiro edje!<br>Este módulo requer os pacotes e17setroot e e_utils para definir a imagem de fundo. Instale-os e tente novamente.
uk: <hilight>Потрібно e17setroot</hilight><br><br>%s — не файл edje !<br>Світлині потрібно e17setroot, допоки Ви не встановите з пакету e_utils ваш малюнок як тло. Будь ласка, встановіть його та спробуйте знову.

source: <hilight>File %s doesnt exists !</hilight><br><br>This file is in Photo's module picture list, but it seems you removed it from the disk.<br>It cant be set opened in a viewer, sorry.
eo: <hilight>Dosiero %s ne ekzistas!</hilight><br><br>Ĉi tiu dosiero estas en la listo de bildoj de la modulo, sed verŝajne vi forigis ĝin el la disko.<br>Bedaŭrinde, ĝi ne povas esti malfermita en la regardilo.
es: <hilight>¡El archivo %s no existe!</hilight><br><br>Este archivo está en la lista de fotos del módulo pero parece haber sido eliminado del disco.<br>No se puede abrir con el visor.
fi: <hilight>Tiedostoa %s ei ole!</hilight><br><br>Tämä tiedosto on Fotomoduulin kuvalistalla, mutta näytät poistaneesi sen levyltä.<br>Sitä ei voi avata katselimessa, pahoittelen.
fr: <hilight>Le fichier %s n'existe pas.</hilight><br><br>Ce fichier est bien dans la liste d'images du module photo, mais il semble qu'il ne soit plus présent sur le disque dur<br>Il ne peut être ouvert dans un programme de visualisation, désolé.
hr: <hilight>Datoteka %s ne postoji!</hilight><br><br>Ova datoteka je u Foto module listi slika, ali se čini da ste istu izbrisali sa diska.<br>Na žalost ne može biti ovtorena u pregledniku.
hu: <hilight>File %s doesnt exists.</hilight><br><br>This file is in Photo module picture list, but it seems you removed it from the disk<br>It cant be set as background, sorry.
it: <hilight>Il file %s non esiste.</hilight><br><br>Questo file è nell'elenco immagini del modulo Photo,<br>ma sembra che sia stato rimosso dal disco.<br>Impossibile aprirlo in un visualizzatore.
pt: <hilight>O ficheiro %s não existe.</hilight><br><br>O ficheiro está na lista de imagens, mas não está no disco.<br>Já não o pode abrir no visualizador.
uk: <hilight>Файл %s не існує !</hilight><br><br>Цей файл є в списку малюнків світлини, але схоже на те, що ви його вилучити з диска.<br>Тому малюнок не можливо відкрити переглядачем, вибачте.
