Repository: kakaroto/e17
Catalog: E-MODULES-EXTRA/moon/po/*.po
Languages: sl

source: Moon Settings
sl: Nastavitve Lune

source: Display Settings
sl: Nastavitve prikaži

source: Animated Clouds
sl: Animirani oblaki

source: Moon Phase Value
sl: Vrednost lunine faze

source: Show always
sl: Vedno prikaži

source: Show on mouse over
sl: Prikaži ob prehodu z miško

source: Never show
sl: Nikoli ne prikazuj

source: Description
sl: Opis

source: Numerical
sl: Številčni način

source: Moon
sl: Luna

source: Settings
sl: Nastavitve

source: New Moon
sl: Nova luna

source: Waxing Crescent
sl: Prvi srp (Včeraj mlaj)

source: First Quarter
sl: Prvi krajec

source: Waxing Gibbous
sl: Prvi izbok (U3 ščip)

source: Full Moon
sl: Polna luna

source: Waning Gibbous
sl: Zadnji izbok (Včeral Polna luna)

source: Last Quarter
sl: Zadnji krajec

source: Waning Crescent
sl: Zadnji srp (U3 mlaj)
