Repository: kakaroto/e17
Catalog: E-MODULES-EXTRA/everything-mpris/po/*.po
Languages: ar

source: No Title
ar: بلا عنوان

source: Loading Playlist
ar: تحميل قائمة التشغيل

source: Empty Playlist
ar: قائمة التشغيل فارغة

source: Playlist
ar: قائمة التشغيل

source: Play Track
ar: اقرأ مسارا

source: Play
ar: اقرأ

source: Pause
ar: قف مؤقتا

source: Stop
ar: قف

source: Forward
ar: تقدّم

source: Rewind
ar: تراجع

source: Remove Track
ar: ازل مسارا

source: Clear Playlist
ar: نظِّف قائمة التشغيل

source: Play File
ar: اقرأ ملفا

source: Add Files...
ar: أضِف ملفا...

source: Enqueue in Playlist
ar: ضُمه في قائمة التشغيل

source: Add Music...
ar: أضف ملفا صوتيا...

source: Remove Duplicates
ar: أزل كل ما هو مكرر

source: Remove Missing Files
ar: أزل الملفات المفقودة
