Repository: kakaroto/e17
Catalog: E-MODULES-EXTRA/language/po/*.po
Languages: el, hu

source: Language Module Settings
el: Ρυθμίσεις Αρθρώματος Γλώσσας
hu: Nyelvi modul beállítások

source: Available Languages
el: Διαθέσημες Γλώσσες
hu: A rendelkezésre álló nyelvek

source: Selected Languages
el: Επλεγμένες Γλώσσες
hu: Kijelölt nyelvek

source: Up
el: Πάνω
hu: Fel

source: Down
el: Κάτω
hu: Le

source: Language Switch Policy
el: Πολιτική Εναλλαγής Γλώσσας
hu: Nyelv kapcsoló házirend

source: Global
el: Καθολική
hu: Globális

source: Window
el: Παράθυρου
hu: Ablak

source: Application
el: Εφαρμογής
hu: Alkalmazás

source: Keyboard Model
el: Μοντέλο Πληκτρολογίου
hu: Billentyűzet típus

source: Layout Variant
el: Παραλλαγές Διάταξης
hu: Kimeneti variáns

source: Language
el: Γλώσσα
hu: Nyelv

source: Switch To Next Language
el: Εναλλαγή στην Επόμενη Γλώσσα
hu: Ugrás a következő nyelvre

source: Switch To Previous Language
el: Εναλλαγή στην Προηγούμενη Γλώσσα
hu: Vissza az előző nyelvre

source: Configuration
el: Ρύθμιση
hu: Beállítás

source: Configure Key Bindings
el: Ρύθμιση Συνδυασμών Πλήκτρων
hu: Billentyűkombinációk beállítása

source: Module Configuration
el: Ρύθμιση Αρθρώματος
hu: Modul beállítás
