Repository: kakaroto/e17
Catalog: E-MODULES-EXTRA/iiirk/po/*.po
Languages: it

source: Configuration
it: Configurazione

source: Applications
it: Applicazioni

source: IIirk Applications
it: Applicazioni per Iiirk

source: Internal
it: Interni

source: IIirk Other
it: Altro

source: Iiirk Configuration
it: Configurazione di Iiirk

source: Selected Iiirk Source
it: Sorgente selezionata per Iiirk

source: Add
it: Aggiungi

source: Delete
it: Elimina

source: Configure
it: Configura

source: General Settings
it: Impostazioni generali

source: Hide window from any list when iconified
it: Nascondi finestra dalle liste quando iconificata

source: Show Icon Label
it: Mostra etichetta icona

source: Display Name
it: Visualizza nome

source: Display Title
it: Visualizza titolo

source: Display Class
it: Visualizza classe

source: Display Icon Name
it: Visualizza nome icona

source: Display Border Caption
it: Visualizza didascalia bordo

source: Screen
it: Schermo

source: Show windows from all screens
it: Mostra finestre da tutti gli schermi

source: Show windows from current screen
it: Mostra finestre dallo schermo attuale

source: Show windows from all desktops
it: Mostra finestre da tutti i desktop

source: Show windows from active desktop
it: Mostra finestre dal desktop attivo

source: Create new IIirk source
it: Crea nuova sorgente per Iiirk

source: Enter a name for this new source:
it: Inserire nome per questa sorgente:

source: You requested to delete "%s".<br><br>Are you sure you want to delete this iiirk source?
it: Avete richiesto di eliminare "%s".<br><br>Siete sicuri di voler eliminare questa sorgente per Iiirk?

source: Are you sure you want to delete this iiirk source?
it: Siete sicuri di voler eliminare questa sorgente per Iiirk?

source: All Applications
it: Tutte le applicazioni

source: Selected Applications
it: Applicazioni selezionate

source: Up
it: Su

source: Down
it: Gi√π
